package raf.console.zickreee

import android.os.Bundle
import androidx.activity.ComponentActivity
import androidx.activity.compose.setContent
import androidx.activity.enableEdgeToEdge
import androidx.compose.foundation.isSystemInDarkTheme
import androidx.compose.foundation.layout.fillMaxSize
import androidx.compose.material3.MaterialTheme
import androidx.compose.material3.Surface
import androidx.compose.runtime.Composable
import androidx.compose.runtime.collectAsState
import androidx.compose.runtime.getValue
import androidx.compose.runtime.remember
import androidx.compose.ui.Modifier
import androidx.compose.ui.platform.LocalContext
import androidx.hilt.navigation.compose.hiltViewModel
import androidx.lifecycle.viewmodel.compose.viewModel
import androidx.navigation.NavType
import androidx.navigation.compose.NavHost
import androidx.navigation.compose.composable
import androidx.navigation.compose.rememberNavController
import androidx.navigation.navArgument
import dagger.hilt.android.AndroidEntryPoint
import raf.console.zickreee.domain.models.BookmarkManager
import raf.console.zickreee.presentation.screens.dalailhairat.Part8Screen
import raf.console.zickreee.presentation.screens.about_app.AboutScreen
import raf.console.zickreee.presentation.screens.counter.CounterDetailScreen
import raf.console.zickreee.presentation.screens.dua.AfterNamazScreen
import raf.console.zickreee.presentation.screens.dua.DuaForReachnessScreen
import raf.console.zickreee.presentation.screens.dua.DuaIftitahSunnaScreen
import raf.console.zickreee.presentation.screens.dua.DuaIsmulAzamScreen
import raf.console.zickreee.presentation.screens.dua.DuaProtectScreen
import raf.console.zickreee.presentation.screens.dua.DuaQuranScreen
import raf.console.zickreee.presentation.screens.dua.DuaRasulScreen
import raf.console.zickreee.presentation.screens.dua.DuaSeyfAsSagirScreen
import raf.console.zickreee.presentation.screens.dua.EveryDayScreen
import raf.console.zickreee.presentation.screens.dua.HirzScreen
import raf.console.zickreee.presentation.screens.home.HomeScreen
import raf.console.zickreee.presentation.screens.dua.IstigfarScreen
import raf.console.zickreee.presentation.screens.dua.MorningAndEveningAzkarsScreen
import raf.console.zickreee.presentation.screens.dua.NamesScreen
import raf.console.zickreee.presentation.screens.dua.RukiaScreen
import raf.console.zickreee.presentation.screens.dua.SalavatScreen
import raf.console.zickreee.presentation.screens.dua.SavesScreen
import raf.console.zickreee.presentation.screens.settings.SettingsScreen
import raf.console.zickreee.presentation.screens.dua.TajnamaScreen
import raf.console.zickreee.presentation.screens.welcome.WelcomeScreen
import raf.console.zickreee.presentation.screens.counter.CounterListScreen
import raf.console.zickreee.presentation.screens.dalailhairat.AsmaUlHusnaScreen
import raf.console.zickreee.presentation.screens.dalailhairat.AsmaUnNabiSAWScreen
import raf.console.zickreee.presentation.screens.dalailhairat.DalailHomeScreen
import raf.console.zickreee.presentation.screens.dalailhairat.DuaFatihScreen
import raf.console.zickreee.presentation.screens.dalailhairat.DuaHatmScreen
import raf.console.zickreee.presentation.screens.dalailhairat.DuaIstigfarScreen
import raf.console.zickreee.presentation.screens.dalailhairat.DuaNiyatScreen
import raf.console.zickreee.presentation.screens.dalailhairat.DuaTaufickScreen
import raf.console.zickreee.presentation.screens.dalailhairat.HowToReadScreen
import raf.console.zickreee.presentation.screens.dalailhairat.ImportantDuaScreen
import raf.console.zickreee.presentation.screens.dalailhairat.Part1Screen
import raf.console.zickreee.presentation.screens.dalailhairat.Part2Screen
import raf.console.zickreee.presentation.screens.dalailhairat.Part3Screen
import raf.console.zickreee.presentation.screens.dalailhairat.Part4Screen
import raf.console.zickreee.presentation.screens.dalailhairat.Part5Screen
import raf.console.zickreee.presentation.screens.dalailhairat.Part6Screen
import raf.console.zickreee.presentation.screens.dalailhairat.Part7Screen

import raf.console.zickreee.ui.theme.AppTheme
import raf.console.zickreee.util.AppPreferences
import raf.console.zickreee.util.ThemeOption
import raf.console.zickreee.presentation.viewmodel.AppViewModel
import raf.console.zickreee.presentation.viewmodel.AppViewModelFactory
import raf.console.zickreee.presentation.viewmodel.CounterViewModel


@AndroidEntryPoint
class MainActivity : ComponentActivity() {
    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        enableEdgeToEdge()
        setContent {
            val appViewModel: AppViewModel = viewModel(factory = AppViewModelFactory(this))

            // Подгружаем сохранённые настройки
            val selectedTheme by appViewModel.theme.collectAsState()
            val dynamicColorState by appViewModel.dynamicColor.collectAsState()
            val contrastThemeState by appViewModel.contrastTheme.collectAsState()

            // Определяем, должна ли быть тёмная тема
            val darkTheme = when (selectedTheme) {
                ThemeOption.Dark -> true
                ThemeOption.Light -> false
                ThemeOption.SystemDefault -> isSystemInDarkTheme()
            }

            // Применяем тему
            AppTheme (
                darkTheme = darkTheme,
                dynamicColor = dynamicColorState,
                contrastLevel = contrastThemeState
            ) {
                Surface(
                    modifier = Modifier.fillMaxSize(),
                    color = MaterialTheme.colorScheme.background,
                    contentColor = MaterialTheme.colorScheme.onSurface,
                ) {
                    AppNavigation(appViewModel)  // Основной контент
                }

            }
        }
    }
}

@Composable
fun AppNavigation(appViewModel: AppViewModel) {
    val navController = rememberNavController()
    val context = LocalContext.current
    val appPreferences = remember { AppPreferences(context) }
    val counterViewModel: CounterViewModel = hiltViewModel()

    // Проверяем, первый ли это запуск
    val isFirstLaunch = appPreferences.isFirstLaunch()

    val bookmarkManager = BookmarkManager(LocalContext.current)

    //navController.graph = rememberNavController().graph

    NavHost(
        navController = navController,
        startDestination = if (isFirstLaunch) "welcome" else "home"
    ) {
        composable("welcome") {
            WelcomeScreen(
                onStartClick = {
                    // Устанавливаем флаг, что первый запуск завершен
                    appPreferences.setFirstLaunchCompleted()
                    // Переходим на главный экран
                    navController.navigate("home") {
                        popUpTo("welcome") { inclusive = true } // Удаляем WelcomeScreen из стека
                    }
                }
            )
        }

        // Навигация на основной странице

        composable("home") {
            HomeScreen(navController = navController)
        }

        composable("namesOfAllah") {
            val arabisNames = listOf(
                "للهُﷻ ",
                "الرَّحْمَانُﷻ ",
                "الرَّحِيمُﷻ ",
                "المَلِكُﷻ ",
                "القُدُّوسُﷻ ",
                "السَّلَامُﷻ ",
                "المُؤمِنُﷻ ",
                "المُهَيْمِنُﷻ ",
                "العَزِيزُﷻ ",
                "الجَبَّارُﷻ ",
                "المُتَكَبِّرُﷻ ",
                "الخَالِقُﷻ ",
                "البَارِئُﷻ ",
                "المُصَوِّرُﷻ ",
                "الغَفَّارُﷻ ",
                "القَهَّارُﷻ ",
                "الوَهَّابُﷻ ",
                "الرَّزَّاقُﷻ ",
                "الفَتَّاحُﷻ ",
                "العَلِيمُﷻ ",
                "القَابِضُﷻ ",
                "البَاسِطُﷻ ",
                "الخَافِضُﷻ ",
                "الرَّافِعُﷻ ",
                "المُعِزُّﷻ ",
                "المُذِلُّﷻ ",
                "السَّمِيعُﷻ ",
                "البَصِيرُﷻ ",
                "الحَكَمُﷻُ ",
                "العَدْلُﷻُ ",
                "اللَّطِيفُﷻُ ",
                "الخَبِيرُﷻ ",
                "الحَلِيمُﷻ ",
                "العَظِيمُﷻ ",
                "الغَفُورُﷻ ",
                "الشَّكُورُﷻ ",
                "العَلِيُّﷻ ",
                "الكَبِيرُﷻ ",
                "الحَفِيظُﷻ ",
                "المُقِيتُﷻ ",
                "الحَسِيبُﷻ ",
                "الجَلِيلُﷻ ",
                "الكَرِيمُﷻ ",
                "الرَّقِيبُﷻ ",
                "المُجِيبُﷻ ",
                "الوَاسِعُﷻ ",
                "الحَكِيمُﷻ ",
                "الوَدُودُﷻ ",
                "المَجِيدُﷻ ",
                "البَاعِثُﷻ ",
                "الشَّهِيدُﷻ ",
                "الحَقُّﷻ ",
                "الوَكِيلُﷻ ",
                "القَوِيُّﷻ ",
                "المَتِينُﷻ ",
                "الوَلِيُّﷻ ",
                "الحَمِيدُﷻ ",
                "المُحْصِيﷻ ",
                "المُبْدِئُﷻ ",
                "المُعِيدُﷻ ",
                "المُحْيِيﷻ ",
                "المُمِيتُﷻ ",
                "الحَيُّﷻ ",
                "القَيُّومُﷻ ",
                "الوَاجِدُﷻ ",
                "المَاجِدُﷻ ",
                "الوَاحِدُﷻ ",
                "الصَّمَدُﷻ ",
                "القَادِرُﷻ ",
                "المُقْتَدِرُﷻ ",
                "المُقَدِّمُﷻ ",
                "المُؤَخِّرُﷻ ",
                "الأَوَّلُﷻ ",
                "الآخِرُﷻ ",
                "الظَّاهِرُﷻ ",
                "البَاطِنُﷻ ",
                "الوَالِيﷻ ",
                "المُتَعَالِيﷻ ",
                "البَرُّﷻ ",
                "التَّوَّابُﷻ ",
                "المُنْتَقِمُﷻ ",
                "العَفُوُّﷻ ",
                "الرَّءُؤفُﷻ ",
                "مَالِكُ المُلْكِﷻ ",
                "ذُو الجَلَالِ \nوَ الإِكْرَامِﷻ ",
                "المُقْسِطُﷻ ",
                "الجَامِعُﷻ ",
                "الغَنِيُّﷻ ",
                "المُغْنِيﷻ ",
                "المَانِعُﷻ ",
                "الضَّارُّﷻ ",
                "النَّافِعُﷻ ",
                "النُّورُﷻ ",
                "الهَادِيﷻ ",
                "البَدِيعُﷻ ",
                "البَاقِيﷻ ",
                "الوَارِثﷻ ",
                "الرَّشِيدُﷻ ",
                "الصَّبُورُﷻ "
            )

            val transcriptNames = listOf(
                "Аллах",
                "Ар-Рахман ",
                "Ар-Рахим ",
                "Аль-Малик ",
                "Аль-Куддус ",
                "Ас-Салям ",
                "Аль-Му'мин ",
                "Аль-Мухаймин ",
                "Аль-Азиз ",
                "Аль-Джаббар ",
                "Аль-Мутакяббир ",
                "Аль-Халик ",
                "Аль-Бари ",
                "Аль-Мусаууир ",
                "Аль-Гаффар ",
                "Аль-Каххар ",
                "Аль-Уаххаб ",
                "Ар-Раззак ",
                "Аль-Фаттах ",
                "Аль-'Алим ",
                "Аль-Кабид ",
                "Аль-Басит ",
                "Аль-Хафид ",
                "Ар-Рафи' ",
                "Аль-Му'изз ",
                "Аль-Музилль ",
                "Ас-Сами' ",
                "Аль-Басыр ",
                "Аль-Хакам ",
                "Аль-Адлю ",
                "Аль-Лятыф ",
                "Аль-Хабир ",
                "Аль-Халим ",
                "Аль-'Азым ",
                "Аль-Гафур ",
                "Аш-Шакур ",
                "Аль-'Алийй ",
                "Аль-Кябир ",
                "Аль-Хафиз ",
                "Аль-Мукыт ",
                "Аль-Хасиб ",
                "Аль-Джалиль ",
                "Аль-Кярим ",
                "Ар-Ракыб ",
                "Аль-Муджиб ",
                "Аль-Уаси' ",
                "Аль-Хаким ",
                "Аль-Уадуд ",
                "Аль-Маджид ",
                "Аль-Ба'ис ",
                "Аш-Шахид ",
                "Аль-Хакк ",
                "Аль-Уакиль ",
                "Аль-Каууийй ",
                "Аль-Матин ",
                "Аль-Уалийй ",
                "Аль-Хамид ",
                "Аль-Мухсы ",
                "Аль-Мубди ",
                "Аль-Му'ыд ",
                "Аль-Мухти ",
                "Аль-Мумит ",
                "Аль-Хайй ",
                "Аль-Каййум ",
                "Аль-Уааджид ",
                "Аль-Мааджид ",
                "Аль-Уахид ",
                "Ас-Самад ",
                "Аль-Кадир ",
                "Аль-Муктадир ",
                "Аль-Мукаддим ",
                "Аль-Мууаххыр",
                "Аль-Аууаль ",
                "Аль-Ахир ",
                "Аз-Захир ",
                "Аль-Батын ",
                "Аль-Уали ",
                "Аль-Мута'али ",
                "Аль-Барр ",
                "Ат-Таууаб ",
                "Аль-Мунтакым ",
                "Аль-'Афувв ",
                "Ар-Рауф ",
                "Маликуль Мульк ",
                "Зуль Джаляли уаль икрам ",
                "Аль-Муксит ",
                "Аль-Джами' ",
                "Аль-Ганийй ",
                "Аль-Мугни ",
                "Аль-Маани' ",
                "Аз-Зарр ",
                "Ан-Нафи' ",
                "Ан-Нур ",
                "Аль-Хади ",
                "Аль-Бади' ",
                "Аль-Бакы ",
                "Аль-Уарис ",
                "Ар-Рашид ",
                "Ас-Сабур "
            )

            val translateNames = listOf(
                "Аллах",
                "Милостивый",
                "Милосердный ",
                "Властелин всего сущего ",
                "Святой ",
                "Миротворящий ",
                "Дарующий стабильность и веру ",
                "Хранитель ",
                "Могущественный ",
                "Подчиняющий, управляющий всеми ",
                "Превосходящий ",
                "Созидатель ",
                "Создатель ",
                "Придающий всему форму и облик ",
                "Скрывающий чужие грехи ",
                "Господствующий ",
                "Дарующий ",
                "Наделяющий ",
                "Раскрывающий ",
                "Всезнающий ",
                "Уменьшающий блага ",
                "Увеличивающий блага ",
                "Унижающий нечестивцев ",
                "Возвышающий уверовавших ",
                "Возвеличивающий ",
                "Ослабляющий ",
                "Всеслышащий ",
                "Всевидящий ",
                "Судья ",
                "Справедливый ",
                "Облегчающий ",
                "Сведущий ",
                "Кроткий ",
                "Величайший ",
                "Всепрощающий ",
                "Благодарный ",
                "Высочайший ",
                "Великий ",
                "Хранитель ",
                "Поддерживающий своих рабов ",
                "Учитывающий все ",
                "Величественный ",
                "Щедрый ",
                "Наблюдающий ",
                "Отвечающий ",
                "Всеобъемлющий ",
                "Мудрый ",
                "Любящий, Любимый ",
                "Славный ",
                "Воскрешающий ",
                "Свидетель ",
                "Истинный ",
                "Покровитель ",
                "Сильнейший ",
                "Непоколебимый ",
                "Друг ",
                "Достойный хвалы ",
                "Считающий ",
                "Основатель ",
                "Возвращающий все живое к смерти, а затем вновь к жизни ",
                "Оживляющий ",
                "Умертвляющий ",
                "Вечно живой ",
                "Не зависимый ни от кого и ни от чего ",
                "Богатый, имеющий все ",
                "Благородный ",
                "Единый ",
                "Самодостаточный ",
                "Всемогущий ",
                "Делающий все наилучшим образом ",
                "Продвигающий ",
                "Отодвигающий ",
                "Первый ",
                "Последний ",
                "Явный ",
                "Скрытый ",
                "Правящий ",
                "Высочайший ",
                "Благостный ",
                "Принимающий покаяние ",
                "Мстящий ",
                "Прощающий грешников ",
                "Мягкий ",
                "Царь царей ",
                "Обладатель величия и щедрости ",
                "Справедливый ",
                "Собирающий ",
                "Богатый, ни в чем не нуждающийся ",
                "Обогащающий ",
                "Удерживающий ",
                "Разрушитель ",
                "Благоволящий ",
                "Просветляющий ",
                "Ведущий верным путем ",
                "Изобретающий ",
                "Остающийся навечно ",
                "Наследник всего сущего ",
                "Направляющий на путь истины ",
                "Терпеливейший "
            )

            val infoNames = listOf(
                "АЛЛАХ — Единый — самое великое Имя Господа, указывающее на Его Божественную сущность. Нет иной сущности, достойной поклонения. Нет у Него ни начала, ни конца. Кур'ан начинается со слов Бисми-ллахи-р-рахмани- р-рахим, что обычно переводят как «Во имя Аллаха Милостивого и Милосердного». Этим Именем не называют больше никого. Все сомнения и любая неуверенность покинет сердце того, кто повторяет это Имя 1000 раз ежедневно, зато воцарятся определенность и вера.",
                "АР-РАХМАН— Милостивый, т. е. Обладающий безграничной милостью и благами. Милостивый на этом свете ко всем Своим созданиям: и к тем, кто достоин милости, и к тем, кто не достоин ее, т. е. к верующим и неверующим, мусульманам и немусульманам. Этим Именем также не нарекают больше никого. Имя ар-Рахман входит в состав первых трех Имен, которыми обозначен Создатель с самого начала Кур'ана, наряду со словами Аллах и ap- Рахим. Если это Прекрасное Имя Аллаха произносить 100 раз после каждого намаза, то улучшится память, человека покинет жестокость и невнима- тельность в религиозных вопросах.",
                "АР-РАХИМ — Милосердный. Одно из трех часто упоминаемых Имен Бога, наряду с Именами Аллах и Рахман. Проявляющий всегда милосердие, Обладающий безграничным милосердием, Проявляющий на том свете милосердие только к уверовавшим, покорным рабам. Это Имя указывает на особое благоволение Господа к верующим. Он даровал им великую милость: во-первых, когда сотворил их; во-вторых, когда наставил на прямой путь и даровал веру; в-третьих, когда осчастливит их в последней жизни; в- четвертых, когда удостоит их лицезреть Свой благородный лик. Аллах — Милосердный, и милосердие Его объемлет всякую вещь и опережает Его гнев. Он повелел верующим быть милосердными к другим творениям и Сам любит Своих милосердных последователей.",
                "АЛЬ-МАЛИК — Властитель всего сущего, Владыка дня Суда, Тот Единственный, Которому принадлежит истинное царство. Аллах самодостаточен в Своей сущности и абсолютно не нуждается ни в одном из Своих творений, в то время как все они нуждаются в Нем и находятся в Его власти. Аллах — абсолютный Владыка, у Которого нет сотоварища, и никто не смеет давать Ему указания. Он ни у кого не ищет помощи. Он одаряет из Своих владений кого хочет и чем хочет. Человек обретет финансовую независимость, если станет читать это Прекрасное Имя Аллаха многократно после завваля (полудня).",
                "АЛЬ-КУДДУС—Святой, Чистейший, Чистый от недостатков, от виновности, от всего недостойного; Недоступный для интеллекта творений и Чистый от того, что может вообразить человек; Далекий от всех качеств, которые могут быть постигнуты чувствами человека либо представлены в нашем воображении и мыслях. Аллах избавит от всех душевных заболеваний того, кто будет часто повторять это Его Прекрасное Имя. А для избавления от тревог желательно читать это Прекрасное Имя Аллаха по 100 раз ежедневно.",
                "АС-САЛЯМ— Миротворящий, наделяющий миром и благополучием Свои творения; Тот, сущности Которого не присущи недостатки, временность, исчезновение; Тот, Чья сущность лишена всех пороков, атрибуты — всех недостатков, а деяния — всякого зла. Все благополучие, которое получает раб и остальные творения, исходит от Него. Человек, познавший это Имя Всевышнего Аллаха, избавляет свое сердце от всего, что оскорбляет достоинство Аллаха, веру в Него и Его шари'ат.",
                "AЛЬ-МУ'МИН — Достойный доверия, Верный договору со Своими рабами. Спасающий от мучений Своих верных рабов; Тот, от Кого исходят безопасность и спокойствие. Только Он дарует безопасность, и спокойствие наступает только по Его милости. Он даровал нам органы чувств, обеспечивающие наше благополучие, указал нам путь к спасению, даровал лекарства для нашего исцеления, еду и питье для нашего существования.",
                "АЛЬ-МУХАЙМИН — Охраняющий Свои творения, Контролирующий их, Осуществляющий дела и блага созданий, Устанавливающий им сроки, Взявшийся охранять, содержать их; Тот, Кто оберегает, владеет, управляет и наблюдает за деяниями, жизнью и пропитанием каждого из всех Своих созданий. Тому, кто после совершения гусуль (полного омовения) выполнит 2 рак'ата намаза и затем прочтет это Прекрасное Имя Аллаха 100 раз с искренностью и благоговением, Аллах дарует духовное и физическое очищение.",
                "АЛЬ-'АЗИЗ — Могучий, Тот, у Кого особое величие, Непобедимый, Сильнейший, Одерживающий победу над всеми, Величайший; существование, сходное с Его существованием, абсолютно невозможно. Всевышний Аллах — Один, у Него нет сотоварищей, и нужда Его творений в Нем огромна; ни один из нас не в состоянии обойтись без Него. Если бы Его не было, то и мы не существовали бы. Аллах наградит почетом и независимостью того, кто читает это Имя по 40 раз в течение 40 дней последовательно. Не будет недостатка или нужды ни в ком и ни в чем у повторяющего по 40 раз это Имя Аллаха ежедневно после утреннего намаза.",
                "АЛЬ-ДЖАББАР — Могущественный, мудрость Которого охватывает все; по воле Которого происходит все; воля Которого не остается неосуществленной; Тот, Который укрощает творения (т. е. все сущее); Тот, воле Которого подчинены абсолютно все творения, однако Сам Он не подчиняется ничьей воле и никто не состоянии выйти из-под Его власти. Он сокрушает тиранов, пытающихся посягнуть на Его право и права Его творений, и подчиняет их Своей собственной воле так же, как подчинил всех смерти.",
                "АЛЬ-МУТАКЯББИР — Всевышний, Недоступный полному познанию, Превосходящий все творения; Тот, Который выше сыфатов творений, чист от сыфатов творений: Единственный Обладатель Истинного величия; Все творения ничтожны по сравнению с Его сущностью, и гордости не достоин никто, кроме Него. Его гордость проявляется в том, что Он не позволяет никому претендовать на Сотворение и оспаривать Его повеления, власть и волеизъявление. Он сокрушает всех, высокомерно относящихся к Нему и Его созданиям. Человек, познавший это Имя Аллаха, не проявляет жестокости и высокомерия по отношению к созданиям Аллаха, ибо жестокость подразумевает насилие и несправедливость, а высокомерие — самовозвеличивание, презрение к другим и посягательство на их права. Жестокость не относится к желаемым качествам праведных рабов Аллаха, обязанных подчиняться и покоряться своему Властителю.",
                "АЛЬ-ХАЛИК — Творец; Тот, Кто творит по-настоящему, без примера и прообраза, и определяет судьбу для созданий; Тот, Кто создает, что хочет, из ничего; Тот, Кто создал мастеров и их мастерство и квалификацию; Тот, Кто предопределил меру всех созданий еще до их существования и наделил их качествами, необходимыми для существования.",
                "АЛЬ-БАРИ' — Создатель; Тот, Кто по Своему могуществу сотворил все сущее; Он — Творец, Который создал все из небытия по Своему предопределению. Для этого Ему не надо прилагать каких-либо усилий; Он говорит чему-либо: «Будь!» — и это сбывается. Познавший это Имя Всевышнего не поклоняется никому, кроме своего Создателя, обращается только к Нему, ищет помощи только у Него и просит то, в чем нуждается, только у Него.",
                "АЛЬ-МУСАУУИР — Тот, Кто придает формы и образы творениям; Тот, Кто придал каждому творению Свою неповторимую, отличную от других таких же творений форму, рисунок.",
                "АЛЬ-ГАФФАР — Прощающий; Тот, Кто является единственным, прощающим и утаивающим грехи творений, прощающим и на этом и на том свете; Тот, Кто делает явными прекрасные черты Своих рабов и покрывает их недостатки. Он скрывает их в мирской жизни и воздерживается от воздаяния за грехи в жизни будущей. Он скрыл за прекрасной внешностью человека то, что неприятно для взора, Он обещал тем, кто обращается к Нему, искренне каясь о совершенном, заменить их грехи благими деяниями. Человек, познавший это Имя Аллаха, скрывает все порочное и скверное и покрывает пороки других творений, обращаясь с ними с прощением и снисхождением.",
                "АЛЬ-КАХХАР — Всемогущий, Всесильный; Тот, Кто Своим высочеством и могуществом укрощает творения; Тот, Кто заставляет делать то, что хочет, независимо от того, желают этого творения или не желают; Тот, Чьему величию покорны творения.",
                "АЛЬ-ВАХХАБ — Дарующий; Тот, Кто дарует бескорыстно, Кто дарует блага рабам Своим; Тот, Кто, не дожидаясь просьбы, дарует необходимое, не преследуя корыстных целей. Подобным качеством не обладает никто, кроме Всевышнего Аллаха. Человек, познавший это Имя Аллаха, целиком посвящает себя служению своему Господу, не стремясь при этом ни к чему, кроме Его довольства. Он совершает все свои деяния только ради Него и бескорыстно помогает нуждающимся, не ожидая от них ни награды, ни благодарности.",
                "АР-РАЗЗАК — Бог, наделяющий средствами к существованию; Тот, Кто сотворил средства к существованию и наделил ими Свои создания. Он почтил их дарами как осязаемыми, так и такими, как разум, знание и вера в сердце. Тот, Кто сохраняет жизнь живых творений и налаживает ее. Польза же, которую получает человек, познавший это Имя Аллаха, состоит в знании того, что никто, кроме Аллаха, не в состоянии даровать удел, и он уповает только на Него и стремится стать причиной ниспослания пропитания другим созданиям. Он не стремится получить удел Аллаха в том, что Он запретил, а терпит, взывает к Господу и трудится для получения удела в дозволенном.",
                "АЛЬ-ФАТТАХ — Первооткрыватель и Победитель; Тот, Кто раскрывает скрытое, облегчает трудности, отводит их; Тот, у Кого ключи от сокровенных знаний и небесных благ. Он раскрывает сердца верующих для познания Его и любви к Нему, открывает нуждающимся врата для удовлетворения их потребностей. Человек, познавший это Имя Аллаха, помогает людям, отводя от них вред и устраняя зло, и стремится стать поводом для раскрытия перед ними врат небесных благ и веры.",
                "АЛЬ-'АЛИМ — Всеведущий; Тот, которому известны и самые малые деяния, и утаенные мысли, и намерения, и мечты; Он не нуждается в дополнительной информации, напротив, всякое знание исходит от Него. От Него не скрыта ни малейшая частица. Он знает обо всем, что было и что произойдет, и ведает о невозможном. Алимами (однокоренное с этим именем слово) в мусульманских странах называют ученых — тех, которые своими знаниями объемлют все сущее. Постигшие это Имя стремятся к знаниям.",
                "АЛЬ-КАБИД — Сужающий, Сжимающий, Дарующий грусть; Тот, Кто по Своему справедливому порядку сужает (уменьшает) блага, кому хочет; Тот, Кто удерживает души в Своей власти, подчинив их смерти, владеет благодеяниями Своих искренних рабов и принимает служение их, удерживает сердца грешников и лишает их возможности познать Его из- за их непокорности и высокомерия. Человек, познавший это Имя Аллаха, ",
                "АЛЬ-БАСИТ — Расстилающий, Расширяющий, Дарующий радость; Тот, Кто влагает в создания жизнь, одарив их тела душами, и доставляет щедрый удел как слабым, так и богатым. Никто, кроме Него, не способен ниспослать мир и спокойствие стесненным душам. Польза от познания этого Имени Аллаха состоит в том, что человек обращает свое сердце и тело к благу и призывает к этому других людей путем проповедования и доброго примера.",
                "АЛЬ-ХАФИД — Унижающий всех тех, кто нечестив и восстал против шари'ата: Хранитель мудрости, заключенной в Священном Кур'ане.",
                "АР-РАФИ' — Возвышающий уверовавших, которые заняты богослужением; Удерживающий на высоте небеса, облака, птиц и тому подобное.",
                "АЛЬ-МУ'ИЗЗ — Дающий силу, мощь, славу победу тому, кому захочет, возвышая его. Только Ему дана такая сила. Он прославит всякого, если захочет. Никто не сможет унизить прославленного человека, если на то нет Его воли. Однако истинная слава и истинное уважение оказываются в Раю. Люди, снискавшие славу, пребудут там вечно.",
                "АЛЬ-МУЗИЛЛЬ — Принижающий того, кого хочет, лишив его силы, мощи и победы. Аллах волен возвысить любого из Своих рабов точно так же, как Он волен и унизить их. Неизменен лишь Сам Аллах.",
                "АС-САМИ' — Всеслышащий; Тот, Кто слышит и самые утаенные, самые тихие, даже невысказанные мысли; Тот, для Кого не существует неслышимого среди слышимого; Тот, Кто объемлет Своим слухом даже самое неслышное.",
                "АЛЬ-БАСЫР — Всевидящий; Тот, Кто видит открытое и скрытое, явное и тайное; Тот, для Кого не существует невидимого среди видимого; Тот, Кто объемлет Своим видением даже самое мельчайшее, для взора Которого нет границ. Он Своим взором в одно и то же время объемлет все во Вселенной. Он — Всемогущий.",
                "AЛЬ-XAKAM — Судья; Тот, Кто судит созданных Им так, как хочет; Тот, Кто отличает истинное от ложного, не соответствующего истине; Тот, Чьего предопределения никто не в состоянии отвергнуть, избежать; Тот, Чью мудрость никто не в состоянии оценить и понять; в Чьи решения никто не в состоянии вникнуть; Наивысший Судья, Чье постановление никто не в силах отвергнуть и Чьему решению никто не в силах воспрепятствовать. Его постановления совершенно справедливы, а решения всегда имеют силу. Он обладает совершенной мудростью, знает сущность всего происходящего и его результаты. Человек, познавший это Имя Аллаха, осознает то, что он находится в абсолютной власти Аллаха и подчинен Его воле. Раб Аллаха знает, что Его религия — самая справедливая и самая мудрая, и поэтому он живет этой религией и ни в коем случае не противоречит ей. Он знает, что все деяния и повеления Аллаха заключают в себе наивысшую мудрость, и никогда не противится им.",
                "АЛЬ-'АДЛЬ — Справедливый; Тот, у Кого порядок, решения и дела справедливы; Тот, Кто Сам не проявляет несправедливости и запретил это остальным; Тот, Кто чист от несправедливости в Своих делах и решениях; Дающий каждому по заслугам; Тот, Кто является источником наивысшей справедливости. Со Своими врагами Он обходится справедливо, а к Своим друзьям и праведным рабам Он милостив и милосерден. Человек, познавший это Имя Аллаха, поступает справедливо всегда, даже по отношению к врагам. Он никого не угнетает, не притесняет и не сеет порчи на земле, ибо не противится предустановлению Аллаха.",
                "АЛЬ-ЛЯТЫФ — Добрый по отношению к Своим рабам. Милостивый по отношению к ним, Облегчающий им жизнь, Содержащий их. Милующий их даже без их ведома.",
                "АЛЬ-ХАБИР — Сведущий, Знающий тайное так же, как и явное, знающий как внешнее проявление, так и внутреннее содержание; Тот, для Которого не существует тайного; Тот, от Чьего знания ничто не скрыто; Тот, Кто знает то, что было, и то, что будет. Человек, познавший это Имя Аллаха, покорен своему Творцу, так как Он лучше всех знает о каждом нашем деянии, как явном, так и скрытом. Нам следует вверить все свои дела Ему, ибо Он лучше всех знает, какие из них благие. Достигнуть же этого упования можно только следуя Его повелениям и искренне взывая к Нему.",
                "АЛЬ-ХАЛИМ — Кроткий; Тот, Кто утаивает, прощает грехи и освобождает от мучений проявивших ослушание; Тот, Кто дает блага как проявившим покорность, так и ослушавшимся; Тот, Кто видит ослушание Своих повелений, однако Им не овладевает гнев, и Он не спешит с возмездием, несмотря на все Свое могущество. Человек, познавший это Имя Аллаха, мягок и кроток в общении, не гневается и не поступает легкомысленно.",
                "АЛЬ-'АЗЫМ— Величайший; величию Которого нет начала и нет конца; высоте Которого нет границ; Тот, Которому нет подобного; Тот, Чью подлинную сущность и величие, которые превыше всякой вещи, не в силах постичь никто, ибо это превыше возможностей разума творений. Человек, познавший это Имя Аллаха, возвеличивает Его, унижается перед Ним и не возвеличивает себя ни в собственных глазах, ни перед кем-либо из Созданий Всевышнего",
                "АЛЬ-ГАФУР — Всепрощающий: Тот, Кто прощает Своим рабам их грехи и оплошности, собственных глазах, ни перед кем-либо из созданий Всевышнего.",
                "АШ-ШАКУР — Благодарный, Воздающий большую награду рабам Своим за их малое богослужение, Доводящий до совершенства слабые деяния, Прощающий их. Человек, познавший Аллаха посредством этого Имени, благодарит своего Создателя за Его блага в мирской жизни и использует их для приобретения Его довольства, но ни в коем случае не для неповиновения Ему, а также благодарит те создания Господа, которые добродетельно вели себя с ним.",
                "АЛЬ-'АЛИ — Высочайший, Высокочтимый: Тот, у Кого нет равных, нет соперников, нет соратников и сотоварищей; Тот, Кто выше всего этого, Тот, Чьи сущность, мощь и сила наивысочайшие.",
                "АЛЬ-КЯБИР — Великий, Большой, Высочайший; Тот, у Которого в качествах (атрибутах) и делах наличествует истинное величие; Не нуждающийся ни в чем; Тот, Которого никто и ничто не может ослабить; Тот, с Которым нет сходных.",
                "АЛЬ-ХАФИЗ — Охраняющий все сущее, включая наимельчайшие субстанции; Тот, Чье покровительство нескончаемо, бесконечно; Тот, Кто охраняет и содержит всякое сущее. Никто не может нанести вред тому, что Он охраняет. Никто не может сохранить то, что не находится под Его покровительством.",
                "АЛЬ-МУКЫТ — Распоряжающийся всем необходимым для материального и духовного жизнеобеспечения Своих созданий; Определяющий его количество и меру; Дающий помощь; Могущественный.",
                "АЛЬ-ХАСИБ — Учитывающий все. Он насыщает рабов Своих по Своей милости, отводит от них беды. Его достаточно, чтобы в достижении благ и пропитания уповать только на Него, и нет необходимости в ком- либо ином. В Нем нуждаются все Его создания, ибо Его достаточность вечна и совершенна. Подобное осознание достаточности Всевышнего достигается посредством причин, Создателем которых является Сам Всевышний Аллах. Он установил их и указал нам на них, разъяснив, как их использовать для достижения желаемого. Тот, кто познал это Имя Господа, просит у Него Его достаточности и обходится только ею, после чего его не постигают волнение, страх или беспокойство.",
                "АЛЬ-ДЖАЛИЛЬ— Величественный; Тот, у Кого истинное величие и все совершенные качества; у всякого из Его созданий есть недостатки. Лишь Он Чист от всяких недостатков.",
                "АЛЬ-КЯРИМ — Щедрый; Тот, щедрость Которого беспредельна. Тот, у Кого блага не уменьшаются, сколько бы Он ни дал; Ценнейший, Охватывающий все ценное; Тот, у Кого каждое деяние достойно высочайшей похвалы; Тот, Кто исполняет Свои обещания и одаряет не только сполна, но и добавляет из Своей милости даже тогда, когда исчерпываются все желания созданий. Он никого не наказывает и не обделяет без причины. Двери Его щедрости и милости всегда широко раскрыты Его созданиям, Он любит прощать согрешивших и раскаявшихся рабов Своих. Наибольшим же благодеянием Аллаха по отношению к нам является то, что Он даровал нам возможность познать Его посредством Его Имен и прекрасных качеств. Поэтому в своих ду'а мы всегда должны говорить: Аллахумма 'иннака 'афуввун каримун тухиббу-л-'афва фа-'фу 'анни, что значит: «О Аллах! Ты — Всемилостивейший, Ты любишь миловать. Помилуй же и меня». Мы не должны терять надежды на Его милость и прощение. У тех, кто в гордыне своей не надеялся лишь на Аллаха, в день Суда спросят: «Кто сделал тебя столь высокомерным?». Поистине, потеря надежды или веры в милость Аллаха равносильна неверию.",
                "АР-РАКЫБ — Следящий за состоянием Своих созданий, Знающий все их деяния, Отмечающий все их деяния; Тот, от контроля Которого никто и ничто не скрывается.",
                "АЛЬ-МУДЖИБ — Всеслышащий, отзывающийся на молитвы и просьбы. Он стремится облагодетельствовать Своего раба еще до того, как он к Нему обратится, отвечает на его мольбу еще до того, как того постигнет нужда. Тот, кто познал Всевышнего посредством этого Имени, отвечает своим любимым, когда они его зовут, помогает просящим о помощи по мере своих возможностей.",
                "АЛЬ-ВАСИ ' — Всеобъемлющий; Тот, блага Которого для созданий необъятны подобно морю; Тот, милость Которого велика для всякого сущего. Милость Его так всеобъемлюща, Милость и щедрость Его столь безграничны, что все грехи рабов Его, вместе взятые, подобны капле в море.",
                "АЛЬ-ХАКИМ — Мудрый; Тот, Кто все вершит мудро; Тот, у Кого дела правильны; Тот, Кто постиг суть, внутреннее содержание всех дел; Тот, Кому хорошо ведомо мудрое решение, предопределенное Им Самим; Тот, у Кого все дела, все решения, справедливы и мудры. Во всех Его повелениях и запретах содержится определенное мудрое решение. Точно так же Он и человека создал с определенной целью, и человек всегда пребывает под Его контролем.",
                "АЛЬ-УАДУД — Любовь. Это Имя имеет два значения: 1) Любящий Своих рабов и 2) Любимый для сердец авлийа (авлийа — мн. ч. от вали — «праведные друзья Аллаха»)",
                "АЛЬ-МАДЖИД — Славный, Наивысочайший по величию; Тот, у Кого добра много, Кто дает щедро, от Кого польза великая.",
                "АЛЬ-БА'ИС — Воскрешающий создания в день Суда; Тот, Кто посылает к людям пророков, отправляет помощь рабам Своим. У того, кто перед сном, положив руку на грудь, повторит это Имя Аллаха 100 или 101 раз, сердце наполнится мудростью и светом. Также повторение этого Имени увеличивает богобоязненность.",
                "АШ-ШАХИД — Свидетель, зорко и бдительно следящий за миром, за всем тем, что происходит на земле и на небе. Слово шахид родственно понятию шарада — «свидетельство». Он — Свидетель происходящего, от Которого нельзя утаить ни одного события, сколь малым и ничтожным оно бы ни было. Он видит все и всех, хотя мы не видим Его. По этому поводу Пророк наш сказал: «Молитесь, будто Аллах видит вас. Хотя вы и не видите Его, Он вас видит».",
                "АЛЬ-ХАКК — Истина. Устанавливающий истинность истинного через Свои калима (выражения); Тот, Кто устанавливает истинность Своих вали. То, что Всемогущий Аллах Есть и Един, — истина.",
                "АЛЬ-УАКИЛЬ — Покровитель; Тот, на Кого следует полагаться; Достаточный для полагающихся только на Него; Тот, Кто радует надеющихся и полагающихся только на Него.",
                "АЛЬ-КАУИ — Сильнейший; Обладатель полной, совершенной мощи. Побеждающий, Тот, Который не проигрывает; Тот, сила Кого выше всякой другой силы. Нет силы, равной Его силе и мощи, равной Его мощи. Он — Тот, Который дает нам силу для служения Ему в молитвах. Без Его помощи мы не имели бы силы не только для намаза — даже для одного вздоха.",
                "АЛЬ-МАТИН — Прочный, Сильный, Не нуждающийся в средствах для осуществления Своих решений: Не нуждающийся в помощи; Тот, Кому не нужен помощник, соратник. Сила Аллаха абсолютна. Нет никакой возможности спастись от гнева Его.",
                "АЛЬ-УАЛИ — Покровитель, Друг; Тот, Кто благоприятствует подчинившимся; Помогающий тем, кто любит Его; Укрощающий врагов; Поручающийся за деяния созданий; Охраняющий созданных. Всевышний Аллах — друг и заступник правоверных. Вес мусульмане пребывают под Его защитой, не испытывая страха перед огнем преисподней. Всевышний Аллах в суре Ал- Бакара Священного Кур'ана явил милость Свою таким айатом: Аллах — покровитель тех, кто уверовал. Он ведет их от мрака к свету. Покровители же неверующих — идолы, которые ведут их от света к мраку. Они — обитатели адского огня и там пребудут вечно. (2:257)",
                "АЛЬ-МУХСЫ — Считающий; Тот, Кто Своими знаниями определяет границы для всего сущего; Тот, от Кого ничего не ускользает. Лишь Аллаху дано знать меру всего, что существует в мире. Лишь Ему свойственно не ошибаться ни в чем.",
                "АЛЬ-ХАМИД — Славный, Достойный всех похвал по причине Своего совершенства; Обладатель вечной славы. Аллах не нуждается в славословиях Своих рабов. Если даже никто не будет возносить Ему хвалу, Он от этого будет еще достойнее ее. Хвала Аллаху необходима и полезна самим восхваляющим Его. Чем больше кто-либо возносит хвалу Аллаху, тем выше степень его перед Ним.",
                "AЛЬ-МУБДИ' — Начинающий; Тот, Кто с самого начала, без примера и прообраза сотворил все сущее. Когда во Вселенной ничего не было, существовал лишь Аллах. Когда Он создавал все существа и предметы, не было ничего, что могло бы послужить примером. Он один — Создатель всего сущего. Так, Он создал Адама, мир ему, из глины, Хавву — из ребра Адама, 'Ису, мир ему, — с помощью Марйам. Остальным существам Он также придал форму в утробе матери. Он — созидатель всех существ во Вселенной, о которых мы даже не имеем представления.",
                "АЛЬ-МУ'ИД — Повторяющийся, придающий Вселенной устойчивость, Возвращающий; Тот, Кто возвращает все живое в мертвое состояние, а затем на том свете оживляет их, возвращая к жизни. Это Он делает для того, чтобы показать, кто — истинный раб Его, а кто — неверующий, и воздать каждому по заслугам. Создатель, который из ничего создал все, способен оживить мертвого и отнять жизнь у живого, расчленить тело на части и из этих частей снова воссоздать его.",
                "АЛЬ-МУХЬЙИЙ — Оживляющий; Тот, Кто творит жизнь; Тот, Кто дает жизнь любой вещи, которой хочет; Тот, Кто создал творения из ничего; Тот, Кто оживит и после смерти.",
                "АЛЬ-МУМИТ — Умертвляющий; Тот, Кто предписал смерть всем смертным; Тот, кроме Которого нет умерщвляющего; Тот, Кто укрощает рабов Своих смертью когда хочет и как хочет.",
                "АЛЬ-ХАЙЙ — Вечно живой; Тот, жизни Которого нет начала и нет конца; Тот, Кто всегда был живым и останется таковым вечно; Живой, Не Умирающий.",
                "АЛЬ-КАЙЙУМ — Сущий, Самостоятельный, Не зависимый ни от кого и ни от чего, Не Нуждающийся ни в ком и ни в чем; Тот, Кто заботится обо всем; благодаря Которому существует все сущее; Тот, Кто сотворил творения и содержит их; Тот, Кто владеет знанием обо всем.",
                "АЛЬ-УАДЖИД — Богатый; Тот, у Которого все сущее, для Которого отсутствует понятия «недостающее» и «недостаточность»; Тот, у Которого сохраняются все дела, не пропадает ничего; Тот, Кто разумеет все.",
                "АЛЬ-МАДЖИД — Благородный; Тот. у Кого полное совершенство; Тот, у Кого прекрасное Величие; Проявляющий щедрость и милость по отношению к Своим рабам.",
                "АЛЬ-УАХИД — Единый, Единственный, Имя, упомянутое в Кур'ане (18:110). Нет никого, кроме Него, и никого, равного Ему.",
                "АС-САМАД — символизирует вечность и независимость Аллаха. Он — Тот, Которому все подчиняются; Тот, без Чьего ведома не происходит ничего; Тот, в Ком нуждаются все во всем, а Сам Он не нуждается ни в ком и ни в чем. Это имя упомянуто в суре 112:2 Священного Кур 'ана.",
                "АЛЬ-КАДИР — Всемогущий; Тот, Кто может сотворить из ничего и может уничтожить сущее; Тот, Кто может создать бытие из небытия и снова превратить в небытие; Делающий все мудро. Никто и ничто не может явиться преградой Его безграничной мощи. Если Он захочет что- либо сотворить, Ему достаточно сказать «Будь!» — и это вмиг свершится. Если Он пожелает, воды перестанут течь и горы рухнут. По Его воле наступит Судный день. Свидетельством этому может служить айат из суры Йа Син: Когда Он хочет чего-либо, то стоит только Ему произнести: «Будь!» — и творение возникает. (36:82)",
                "АЛЬ-МУКТАДИР — Могущественный; Тот, Кто устраивает дела созданий наилучшим образом, так, как никто этого не может. Лишь Аллах может наделить силой все живые существа, сделать людей способными совершать предписанные Им дела. Все мы двигаемся и действуем по Его воле.",
                "АЛЬ-МУКАДДИМ — Выдвигающий вперед все то, что должно быть впереди; Выдвигающий вперед достойных рабов Своих. Выбор за Ним. Так, Он пророков Своих поставил впереди всех, а Пророка Мухаммада превыше всех пророков и приблизил к Себе.",
                "АЛЬ-МУУАХХЫР— Отодвигающий назад все то, что должно быть позади; Тот, Кто отодвигает назад по Своему разумению и по Своей воле неверных, нечестивцев и всех тех, кто должен быть отодвинут назад. Ничто не может помешать Ему приблизить каждого, кого Он Сам захочет, и указать правильный путь или отдалить.",
                "АЛЬ-'АУУАЛЬ — Первый, Безначальный и Предвечный. Тот, Кто Пред- шествовал Вселенной. Когда ничего не было, существовал лишь Он.",
                "АЛЬ-АХЫР — Последний; Тот, Кто останется после уничтожения всего сотворенного; Тот, Кому нет конца, вечно Остающийся; Тот, Кто уничтожает все; Тот, после Которого не будет ничего.",
                "A3-ЗАХИР — Явный; во всем можно увидеть множество знамений, свидетельствующих о Его существовании, единственности и могуществе.",
                "АЛЬ-БАТЫН — Скрытый; Тот, Кто знает как явное, так и скрытое обо всем; Тот, Чьи признаки явственны, а Сам Он на этом свете невидим. Аллах действительно существует, но мы не можем осознать Его, располагая нашими обычными чувствами, не можем лицезреть Его, услышать. Но мы знаем, что Он един и Он есть.",
                "АЛЬ-УАЛИ — Правящий, Властвующий над всем сущим; Тот, Кто осуществляет все по Своему желанию и мудрости; Тот, Чьи решения имеют силу везде и всегда. Мы знаем, что земные правители, сколь могущественными они бы ни были, правят на ограниченной территории и ограничены определенными полномочиями. Один Аллах — обладатель абсолютных полномочий. Любой человек, даже самый высокопоставленный, подчинен вышестоящему. Лишь Аллах не подчинен никому, наоборот, все существа и все сущее подчинено Ему. Все земные правители имеют помощников. Один лишь Аллах самостоятельно правит всей Вселенной.",
                "АЛЬ-МУТА'АЛИ — Высочайший; Тот, Кто выше клеветнических измышлений, выше сомнений, возникающих у созданных.",
                "АЛЬ-БАРР — Благостный; Тот, Кто творит добро для рабов Своих, Милостив к ним; Дающий тем, кто просит, проявляя милость к ним; Верный договору, обещанию для созданных. Тем, кто совершает хотя бы одно благое дело (саваб), Он воздает десятикратно. Он воздаст по заслугам даже за неосуществленное благое намерение.",
                "АТ-ТАУУАБ (от арабского тавба — «покаяние») — Принимающий покаяние слуг, Благоприятствующий им в покаянии, Приводящий их к покаянию, Отвечающий на мольбы; Прощающий грехи покаявшихся. Да, Аллах поистине Милостивый и Прощающий грехи рабов Своих. Это имя упомянуто в Кур'ане: Воздай хвалу Господу твоему и проси у Него прощения, ибо Он — Прощающий. (110:3) Пророк , сказал: «Всевышний Аллах принимает мольбы раба Своего о прощении, пока душа того не вылетит из тела». Для того, чтобы тавба была принята, необходимо выполнение ряда условий: • осознать, что содеянное тобой — это грех; • сожалеть о содеянном грехе; • стараться не повторять греховного дела.",
                "АЛЬ-МУНТАКЫМ — Мстящий, Ломающий хребет ослушавшимся; Мучающий нечестивцев, но только после оповещения и предупреждения, если они не опомнились. Ибо Он Милостив. Однако есть такие люди, которые, надеясь на прощение и милость Аллаха, продолжают совершать неблаговидные дела, считая, что достаточно попросить у Него отпущения грехов. Ответом для них может послужить вот этот айат из суры Ал-'Имран: Ведь Аллах — Могучий, раздающий возмездие. (3:4)",
                "АЛЬ-'АФУВВ — Прощающий грешников; Скрывающий вину; Очищающий плохие деяния; Тот, Кто прощает грехи; Тот, Чья милость велика. Целый ряд сур Курана говорит об этих качествах Аллаха. Действительно, прощение и милость Аллаха столь огромны, что хватит на всех Его существ. Однако необходимо удостоиться Высшего прощения, т. е. осознать свои грехи, глубоко сожалеть о них и не повторять их.",
                "АР-РА'УФ — Кроткий, Мягкий, Нежный, Лишенный грубости, Милостивый, Принимающий покаяние грешников и Наделяющий их Своей милостью и благами после их покаяния, Скрывающий их вину, Прощающий. Ибрахим ибн Адхам говорил: «О Мой Аллах! Ты лишь проявляешь милость ко мне. Если предо мной закроются двери милости Твоей, то кто смилостивится надо мной?!». Благодеяния и милость Аллаха безграничны. Он — беспримерный образец для Своих созданий. Он учит и призывает Своих рабов проявлять милость и заботу по отношению друг к другу. Но что это значит по сравнению с милостью и заботой Аллаха, которые обьемлют все и вся? Милость Его превыше гнева Его.",
                "МАЛИК АЛЬ-МУЛЬК— Царь царств; Всевластный Царь Сущего Царства; Тот, Кто делает то, что хочет; нет никого, кто мог бы игнорировать и отменить Его решения; нет никого, кто мог бы не одобрять, критиковать, ставить Его решение под сомнение. Не стоит перечислять то, что принадлежит Ему, ибо Ему принадлежит все. Об этом свидетельствуют и следующие айаты: Ему принадлежит то, что на небесах, и то, что на земле. (2:255) Аллаху принадлежит то, что на небесах и на земле. (2:284)",
                "3УЛЬ-ДЖАЛАЛИ ВАЛЬ-'ИКРАМ — Обладатель истинного величия, почета и милости; Обладатель высоты и совершенства; Достойный возвеличивания.",
                "АЛЬ-МУКСЫТ — Справедливый; Тот, у Кого все решения мудры и справедливы; Мстящий притеснителям за притесненных. Он устанавливает совершенный порядок, устраняет беззакония и несправедливость, поддерживает угнетенного и наказывает притеснителя. Аллах не допускает в Своих делах несправедливости и беззакония.",
                "АЛЬ-ДЖАМИ' — Собирающий; Тот, Кто собрал все совершенства сущности и дел; Тот, Кто собирает все творения; Тот, Кто собирает в день Воскрешения людей в местности 'Арасат. В суре Ал- 'Имран есть такой айат: Господи наш! Воистину, Ты соберешь людей в день, в [приходе] которого нет сомнения. (3:9)",
                "АЛЬ-ГАНИ — Богатый, Не нуждающийся ни в чем; Самостоятельный; Тот, в Ком нуждаются все. Ниспосланные Аллахом богатства на самом деле принадлежат Ему же, Он отдает их рабам Своим как бы на хранение, под залог благодеяний. Поэтому богатство следует тратить так, чтобы Аллах был доволен.",
                "АЛЬ-МУГНИ — Обогащающий, Дающий блага Своим рабам; Тот, Кто обогащает, кого хочет; Достаточный для созданных. Это подтверждает и следующий айат Священного Кур'ана: Ты даруешь владычество кому пожелаешь, и отнимаешь владычество у кого пожелаешь. (3:26)",
                "АЛЬ-МАНИ' — Удерживающий; Тот, Кто не дает тому, кому не хочет дать, чтобы испытать его или удержать, защитить его от плохого. Мы, рабы Аллаха, беремся за различные дела, задумываем многое, но не все у нас получается. Ибо все в воле Аллаха. Он в воле удержать то, что не по душе Ему, даже если за это берутся миллионы людей.",
                "АД-ДАРР — Разрушитель, уничтожающий Вселенную, стирающий царства и народы с лица Земли, насылающий эпидемии и стихийные бедствия, испытывающий грешников. Видимыми причинами разрушений, несчастий, людских невзгод могут быть стихийные бедствия, войны, вражда и человеческое коварство. Но за всем этим стоит воля Аллаха.",
                "АН-НАФИ' — Благоволящий, Приносящий пользу тому, кому хочет, исходя из Собственных решений; Тот, без Чьего ведома никто не в состоянии принести пользу или воспользоваться плодами Его благоволения.",
                "АН-НУР — Свет Просвещающий; Тот, Кто осветил светом существования небеса и землю; Тот, Кто наставляет созданных на Истинный Путь; Показывающий сияние Истинного Пути. В Кур'ане говорится, что Аллах — «Свет, освещающий небо и землю».",
                "АЛЬ-ХАДИ — Ведущий Верным Путем; Тот, Кто истинными высказываниями наставляет созданных на Истинный Путь; Тот, Кто оповещает созданных об Истинном Пути; Тот, Кто подводит сердца к познанию Себя; Тот, Кто подводит тела созданных к богослужению. Поэтому мы каждый день во время намазов неоднократно повторяем: Веди нас прямым путем. (1:6)",
                "АЛЬ-БАДИ' — Изобретающий; Тот, для Которого нет равных, Которому нет подобных ни в сущности, ни в сифатах, ни в повелениях, ни в решениях; Тот, Кто творит все без примера и прообраза. Сначала ничего не было, был лишь Он. Все, что Он создал, гармонично и целенаправленно.",
                "АЛЬ-БАКЫ — Остающийся навечно; Тот Единственный, Кто остается навечно; Тот, существование Которого вечно; Тот, Кто не исчезает; Тот, Кто остается бесконечно, навсегда; Тот, Кто является вечным наследником всего, что создано Им Самим.",
                "АЛЬ-УАРИС — Наследник всего сущего; Тот, Кто остается навечно, Которому остается наследство всех Его творений; Тот, у Кого остается вся власть после исчезновения Его творений; Тот, Кто наследует мир и все сущее в нем. Так было и так будет. А люди являются временными владельцами благ этого мира.",
                "АР-РАШИД — направляющий на Правильный Путь; Тот, Кто дает счастье тому, Кому хочет, направляя его на Истинный Путь; Тот, Кто отдаляет того, кого хочет, по установленному Им порядку. Ср. Муршид — «Наставник».",
                "АС-САБУР — Терпеливый; Тот, Чьи кротость и терпение безграничны; Тот, Кто не спешит мстить ослушавшимся; Тот, Кто отсрочивает наказание; Тот, Кто не делает ничего раньше срока; Тот, Кто делает все в свое время."
            )


            NamesScreen(
                arabisNames,
                transcriptNames,
                translateNames,
                infoNames,
                onHomeClick = {
                    navController.navigate("home") // Переход на главный экран
                },
                bookmarkManager = bookmarkManager
            )
        }
        composable("duaFromQuran") {
            DuaQuranScreen(LocalContext.current,
                onHomeClick = {
                    navController.navigate("home") // Переход на главный экран
                }, bookmarkManager)
        }
        composable("salawat") {
            SalavatScreen(LocalContext.current,
                onHomeClick = {
                    navController.navigate("home") // Переход на главный экран
                }, bookmarkManager)
        }
        composable("istighfar") {
            IstigfarScreen(LocalContext.current,
                onHomeClick = {
                    navController.navigate("home") // Переход на главный экран
                }, bookmarkManager)
        }
        composable("duaForReachness") {
            DuaForReachnessScreen(LocalContext.current,
                onHomeClick = {
                    navController.navigate("home") // Переход на главный экран
                }, bookmarkManager)
        }
        composable("morningEveningAzkar") {
            MorningAndEveningAzkarsScreen(LocalContext.current,
                onHomeClick = {
                    navController.navigate("home") // Переход на главный экран
            }, bookmarkManager)
        }
        composable("ismulAzam") {
            DuaIsmulAzamScreen(LocalContext.current,
                onHomeClick = {
                    navController.navigate("home") // Переход на главный экран
                }, bookmarkManager)
        }
        composable("duaRasul") {
            DuaRasulScreen(LocalContext.current,
                onHomeClick = {
                    navController.navigate("home") // Переход на главный экран
                }, bookmarkManager)
        }

        composable("afterNamaz") {
            AfterNamazScreen(LocalContext.current,
                onHomeClick = {
                    navController.navigate("home") // Переход на главный экран
                }, bookmarkManager)
        }

        composable("hirz") {
            HirzScreen(LocalContext.current,
                onHomeClick = {
                    navController.navigate("home") // Переход на главный экран
                }, bookmarkManager)
        }

        composable("duaProtect") {
            DuaProtectScreen(LocalContext.current,
                onHomeClick = {
                    navController.navigate("home") // Переход на главный экран
                }, bookmarkManager)
        }

        composable("rukia") {
            RukiaScreen(LocalContext.current,
                onHomeClick = {
                    navController.navigate("home") // Переход на главный экран
                }, bookmarkManager)
        }

        composable("everyDay") {
            EveryDayScreen(LocalContext.current,
                onHomeClick = {
                    navController.navigate("home") // Переход на главный экран
                }, bookmarkManager)
        }

        composable("duaIftitahSunna") {
            DuaIftitahSunnaScreen(LocalContext.current,
                onHomeClick = {
                    navController.navigate("home") // Переход на главный экран
                }, bookmarkManager)
        }

        composable("duaSeyfSagir") {
            DuaSeyfAsSagirScreen(LocalContext.current,
                onHomeClick = {
                    navController.navigate("home") // Переход на главный экран
                }, bookmarkManager)
        }

        composable("duaTajnama") {
            TajnamaScreen(LocalContext.current,
                onHomeClick = {
                    navController.navigate("home") // Переход на главный экран
                }, bookmarkManager)
        }

        composable("saves") {
            SavesScreen(LocalContext.current,
                onHomeClick = {
                    navController.navigate("home") // Переход на главный экран
                }, bookmarkManager)
        }

        //
        composable("counter") {
            CounterListScreen(counterViewModel, navController)
        }

        composable(
            "counterDetail/{counterId}",
            arguments = listOf(navArgument("counterId") { type = NavType.LongType }
            )) { backStackEntry ->
                var counterId = backStackEntry.arguments?.getLong("counterId") ?: 0L
                CounterDetailScreen(
                    counterId = counterId,
                    viewModel = hiltViewModel(),
                    onBack = {
                        navController.navigate("home") // Переход на главный экран
                    }
                )
            }


        composable("dalailAlKhairat") {
            DalailHomeScreen(navController = navController)
        }

        composable("settings") {
            SettingsScreen(onBackClick = { navController.popBackStack() },
                appViewModel = appViewModel,
                onHomeClick = {
                    navController.navigate("home") // Переход на главный экран
                })
        }
        composable("aboutApp") {
            AboutScreen(navController)
        }


        // Навигация Даляиль Аль-Хайрат

        composable("back") {
            HomeScreen(navController = navController)
        }

        composable("howToRead") {
            HowToReadScreen()
        }

        composable("importantDua") {
            ImportantDuaScreen(LocalContext.current,
                onHomeClick = {
                    navController.navigate("dalailAlKhairat") // Переход на главный экран
                }, bookmarkManager)
        }

        composable("duaIstigfar") {
            DuaIstigfarScreen(LocalContext.current,
                onHomeClick = {
                    navController.navigate("dalailAlKhairat") // Переход на главный экран
                }, bookmarkManager)
        }

        composable("duaNiyat") {
            DuaNiyatScreen(LocalContext.current,
                onHomeClick = {
                    navController.navigate("dalailAlKhairat") // Переход на главный экран
                }, bookmarkManager)
        }

        composable("duaFatih") {
            DuaFatihScreen(LocalContext.current,
                onHomeClick = {
                    navController.navigate("dalailAlKhairat") // Переход на главный экран
                }, bookmarkManager)
        }

        composable("asmaUlHusna") {
            AsmaUlHusnaScreen(LocalContext.current,
                onHomeClick = {
                    navController.navigate("dalailAlKhairat") // Переход на главный экран
                }, bookmarkManager)
        }

        composable("duaTaufick") {
            DuaTaufickScreen(LocalContext.current,
                onHomeClick = {
                    navController.navigate("dalailAlKhairat") // Переход на главный экран
                }, bookmarkManager)
        }

        composable("namesRasul") {
            AsmaUnNabiSAWScreen(LocalContext.current,
                onHomeClick = {
                    navController.navigate("dalailAlKhairat") // Переход на главный экран
                }, bookmarkManager)
        }

        composable("mon") {
            Part1Screen(LocalContext.current,
                onHomeClick = {
                    navController.navigate("dalailAlKhairat") // Переход на главный экран
                }, bookmarkManager)
        }

        composable("tus") {
            Part2Screen(LocalContext.current,
                onHomeClick = {
                    navController.navigate("dalailAlKhairat") // Переход на главный экран
                }, bookmarkManager)
        }

        composable("wen") {
            Part3Screen(LocalContext.current,
                onHomeClick = {
                    navController.navigate("dalailAlKhairat") // Переход на главный экран
                }, bookmarkManager)
        }

        composable("ths") {
            Part4Screen(LocalContext.current,
                onHomeClick = {
                    navController.navigate("dalailAlKhairat") // Переход на главный экран
                }, bookmarkManager)
        }

        composable("fri") {
            Part5Screen(LocalContext.current,
                onHomeClick = {
                    navController.navigate("dalailAlKhairat") // Переход на главный экран
                }, bookmarkManager)
        }

        composable("sat") {
            Part6Screen(LocalContext.current,
                onHomeClick = {
                    navController.navigate("dalailAlKhairat") // Переход на главный экран
                }, bookmarkManager)
        }

        composable("sun") {
            Part7Screen(LocalContext.current,
                onHomeClick = {
                    navController.navigate("dalailAlKhairat") // Переход на главный экран
                }, bookmarkManager)
        }

        composable("mon2") {
            Part8Screen(LocalContext.current,
                onHomeClick = {
                    navController.navigate("dalailAlKhairat") // Переход на главный экран
                }, bookmarkManager)
        }

        composable("duaHatm") {
            DuaHatmScreen(LocalContext.current,
                onHomeClick = {
                    navController.navigate("dalailAlKhairat") // Переход на главный экран
                }, bookmarkManager)
        }

    }
}
