[

    {
        "num": "",
        "arabic_dua": "اللَّهُمَّ اشْرَحْ بِالصَّلَاةِ عَلَيْهِ صُدُورَنَا، وَيَسِّرْ بِهَا أُمُورَنَا، وَفَرِّجْ بِهَا هُمُومَنَا، وَاكْشِفْ بِهَا غُمُومَنَا، وَاغْفِرْ بِهَا ذُنُوبَنَا، وَاقْضِ بِهَا دُيُونَنَا، وَأَصْلِحْ بِهَا أَحْوَالَنَا، وَبَلِّغْ بِهَا آمَالَنَا، وَتَقَبَّلْ بِهَا تَوْبَتَنَا، وَاغْسِلْ بِهَا حَوْبَتَنَا، وَانْصُرْ بِهَا حُجَّتَنَا، وَطَهِّرْ بِهَا أَلْسِنَتَنَا، وَآنِسْ بِهَا وَحْشَتَنَا، وَارْحَمْ بِهَا غُرْبَتَنَا، وَاجْعَلْهَا نُورًا بَيْنَ أَيْدِينَا، وَمِنْ خَلْفِنَا، وَعَنْ أَيْمَانِنَا، وَعَنْ شَمَائِلِنَا، وَمِنْ فَوْقِنَا، وَمِنْ تَحْتِنَا، وَفِي حَيَاتِنَا، وَمَوْتِنَا، وَفِي قُبُورِنَا، وَحَشْرِنَا، وَنَشْرِنَا، وَظِلًّا فِي يَوْمِ القِيَامَةِ عَلَی رُؤُوسِنَا، وَثَقِّلْ بِهَا مَوَازِينَ حَسَنَاتِنَا، وَأَدِمْ بَرَكَاتِهَا عَلَيْنَا حَتَّى نَلْقَى نَبِيَّنَا وَسَيِّدَنَا مُحَمَّدًا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، وَنَحْنُ آمِنُونَ مُطْمَئِنُّونَ فَرِحُونَ مُسْتَبْشِرُونَ، وَلَا تُفَرِّقْ بَيْنَنَا وَبَيْنَهُ حَتَّى تُدْخِلَنَا مُدْخَلَهُ، وَتُؤْوِيَنَا إِلَی جِوَارِهِ الكَرِيمِ مَعَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ مِنَ النَّبِيِّـنَ وَالصِّدِّيقِينَ وَالشُّهَدَآءِ وَالصَّـٰلِحِينَ ۚ وَحَسُنَ أُوْلَـٰٓئِكَ رَفِيقًا. اللَّهُمَّ إِنَّا آمَنَّا بهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ وَلَمْ نَرَهُ، فَمَتِّعْنَا اللَّهُمَّ فِي الدَّارَيْنِ بِرُؤْيَتِهِ، وَثَبِّتْ قُلُوبَنَا عَلَى مَحَبَّتِهِ، وَاسْتَعْمِلْنَا عَلَى سُنَّتِهِ، وَتَوَفَّنَا عَلَى مِلَّتِهِ وَاحْشُرْنَا فِي زُمْرَتِهِ النَّاجِيَةِ وَحِزْبِهِ المُفْلِحِينَ، وَانْفَعْنَا بِمَا انْطَوَتْ عَلَيْهِ قُلُوبُنَا مِنْ مَحَبَّتِهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ يَوْمَ لَا جَدَّ وَلَا مَالَ وَلَا بَنِينَ، وَأَوْرِدْنَا حَوْضَهُ الأَصْفَى، وَاسْقِنَا بِكَأْسِهِ الأَوْفَى، وَيَسِّرْ عَلَيْنَا زِيَارَةَ حَرَمِكَ وَحَرَمِهِ مِنْ قَبْلِ أَنْ تُمِيتَنَا، وَأَدِمْ عَلَيْنَا الإِقَامَةَ بِحَرَمِكَ وَحَرَمِهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِلَى أَنْ نُتَوَفَّى. اللَّهُمَّ إِنَّا نَسْتَشْفِعُ بِهِ إِلَيْكَ إِذْ هُوَ أَوْجَهُ الشُّفَعَاءِ إِلَيْكَ، وَنُقْسِمُ بِهِ عَلَيْكَ إِذْ هُوَ أَعْظَمُ مَنْ أُقْسِمَ بِحَقِّهِ عَلَيْكَ، وَنَتَوَسَّلُ بِهِ إِلَيْكَ إِذْ هُوَ أَقْرَبُ الوَسَائِلِ إِلَيْكَ، نَشْكُو إِلَيْكَ يَا رَبِّ قَسْوَةَ قُلُوبِنَا، وَكَثْرَةَ ذُنُوبِنَا، وَطُولَ آمَالِنَا، وَتَكَاسُلَنَا عَنِ الطَّاعَاتِ، وَهُجُومَنَا عَلَى المُخَالَفَاتِ، فَنِعْمَ المُشْتَكَى إِلَيْهِ أَنْتَ يَا رَبِّ، بِكَ نَسْتَنْصِرُ عَلَى أَعْدَائِنَا وَأَنْفُسِنَا فَانْصُرْنَا، وَعَلَى فَضْلِكَ نَتَوَكَّلُ فِي صَلَاحِنَا، فَلَا تَكِلْنَا إِلَى غَيْرِكَ يَا رَبَّنَا، وَإِلَى جَنَابِ رَسُولِكَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَنْتَسِبُ فَلَا تُبَعِّدْنَا، وَبِبَابِكَ نَقِفُ فَلَا تَطْرُدْنَا، وَإِيَّاكَ نَسْأَلُ فَلَا تُخَيِّبْنَا. اللَّهُمَّ ارْحَمْ تَضَرُّعَنَا، وَآمِنْ خَوْفَنَا، وَتَقَبَّلْ أَعْمَالَنَا، وَأَصْلِحْ أَحْوَالَنَا، وَاجْعَلْ بِطَاعَتِكَ اشْتِغَالَنَا، وَإِلَى الخَيْرِ مَآلَنَا، وَحَقِّقْ بِالزِّيَادَةِ آمَالَنَا، وَاخْتِمْ بِالسَّعَادَةِ آجَالَنَا. هَذَا ذُلُّنَا ظَاهِرٌ بَيْنَ يَدَيْكَ، وَحَالُنَا لَا يَخْفَى عَلَيْكَ، أَمَرْتَنَا فَتَرَكْنَا، وَنَهَيْتَنَا فَارْتَكَبْنَا، وَلَا يَسَعُنَا إِلَّا عَفْوُكَ فَاعْفُ عَنَّا يَا خَيْرَ مَأْمُولٍ، وَأَكْرَمَ مَسْئُولٍ، إِنَّكَ عَفُوٌّ غَفُورٌ رَؤُوفٌ رَحِيمٌ يَا أَرْحَمَ الرَّاحِمِينَ. وَصَلَّى اللَّهُ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلَى آلِهِ وَصَحْبهِ وَسَلَّمَ تَسْلِيمًا، وَالحَمْدُ لِلَّهِ رَبِّ العَالَمِينَ.",
        "transcript": "Allāhumma shraḥ biṣṣalāti ʿalayhi sudūrana, wa yassir bihā umūranā, wa farrij bihā humūmanā, wakshif bihā ghumūmanā, waghfir bihā dhunūbanā, waqḍi bihā duyūnanā, wa aṣliḥ bihā aḥwālanā, wa balligh bihā āmālanā, wa taqabbal bihā tawbatanā, waghsil bihā ḥawbatanā, wanṣur bihā ḥujjatanā, wa ṭahhir bihā al sinatanā, wa ānis bihā waḥshatanā, warḥam bihā ghurbatanā, wajʿalhā nūran bayna aydīnā wa min khalfinā wa ʿan aymānina wa ʿan shamāʾilinā, wa min fawqinā wa min taḥtinā, wa fī ḥayātina wa mawtinā, wa fī qubūrinā wa ḥashrinā wa nashrinā, wa ẓillan fī yawmal qiyāmati ʿalā ruʾūsina, wa thaqqil bihā ya rabbi mawāzīna ḥasanātinā, wa adim barakātihā ʿalaynā ḥattā nalqa nabiyyinā wa sayyidinā Muḥammadan ṣallAllahu ʿalayhi wa ṣallama, wa naḥnu āminūna muṭmaʾinnūna fariḥūna mustabshirūna, wa lā tufarriq baynanā wa baynahu ḥattā tudkhilanā madkhalahu, wa taʿwiyanā ilā jiwārihil karīmi maʿalladhīna anʿamta ʿalayhim min annabiyyīna waṣ ṣiddīqīna wash shuhadāʾi waṣ ṣāliḥīna, wa ḥasuna ūlāʾika rafīqa. Allāhumma innā āmannā bihi ṣallAllahu ʿalayhi wa ṣallama wa lam narahu, famattiʿnAllahuma fiddāraini biruʾyatihi, wa thabbit qulūbana ʿalā maḥabbatihi, wastaʿmilna ʿalā sunnatihi, wa tawaffanā ʿalā millatihi, waḥshurna fī zumratihin nājiyati wa ḥizbihil mufliḥīna, wanfaʿna biman ṭawat ʿalayhi qulūbuna min maḥabbatihi ṣallAllahu ʿalayhi wa ṣallama yawma lā jadda wa lā māla wa lā banīn, wa awridnā ḥawḍahul aṣfa, wasqinā bikaʾ sihil awfa, wa yassir ʿalaynā ziyārata ḥaramika wa ḥaramihi min qabli an tumītana, wa adim ʿalaynal iqāmata biḥaramika wa ḥaramihi ṣallAllahu ʿalayhi wasṣallama ilā an natawaffa. Allāhumma innā nastashfiʿu bihi ilayka idh huwa awjahush shufaʿāi ilayka, wa nuqsimu bihi ʿalayka idh huwa aʿẓamu man uqsima bi ḥaqqihi ʿalayka, wa natawassalu bihi ilayka idh huwa aqrabul wasāʾili ilayka, nashkū ilayka yā rabbi qaswata qulūbina, wa kathrata dhunūbinā, wa ṭūla āmālinā, wa fasada ʿāmālina, wa takasulanā ʿaniṭṭāʿāti, wa hujūmanā ʿalal mukhālafāti, faniʿmal mushtaka ilayhi anta yā rabbi bika nastanṣiru ʿalā aʿdāʾinā wa anfusinā fanṣurnā, wa ʿalā faḍlika natawakkalu fī ṣalāḥinā, falā takilnā ilā ghayrika yā rabbana, wa ilā janābi rasūlika ṣallAllahu ʿalayhi wa ṣallama nantasibu falā tubaʿidnā, wa bibābika naqifufalā taṭrudnā, wa iyyāka nasʾalu falā tukhayyibnā. Allāhumma rḥam taḍarruʿanā, wa āmin khawfanā, wa taqabbal ʿamālanā, wa aṣliḥ aḥwālanā, wajʿal biṭāʿatikash tighālanā, wa ilāl khayri mālanā, wa ḥaqqiq bizziyādati āmālanā, wakhtim bissaʿādati ājālanā, hadhā dhullunā ẓāhirun bayna yadayka, wa ḥālunā la yakhfa ʿalayka, amartanā fataraknā, wa nahaytanā fartakabnā, wa lā yasʿunā illā ʿafwuka, faʿfu ʿannā yā khayra maʾmūlin, wa akrami masʾūlin, innaka ʿafuwwun ghafūrun raʾūfun raḥīmun, yā arḥamar raḥimīna, wa ṣallAllahu ʿalā sayyidinā Muḥammadin wa ʿalā ālihi wa ṣaḥbihi wa ṣallama taslīman, walḥamduliLlahi rabbil ʿālamīn.",
        "translate": "O Allah, through our asking for blessings upon Your Prophet, sallAllahu alayhi wasallam, expand our hearts. And thereby ease our affairs. And dispel our anxieties. And remove our sorrows. And thereby forgive our sins and relieve our debts. And improve our state and fulfill our hopes. And accept our repentance. And cleanse our misdeeds. And thereby champion our aspirations. And purify our tongues. And end our loneliness. And thereby relieve our separation. And make it a light in front of us and behind us. And to our right and to our left. And above us and beneath us. And in our lives and in our deaths. And in our graves and in our gathering and in our resurrection, and shade for us on the Day of Judgment over our heads. And weigh down the scales thereby with good actions. And repeat its blessing on us until we meet with our Prophet, Sayyidina Muhammad, Allah’s peace and blessings be upon him and his family. We are believing, we are certain, we are overjoyed, and we are the receivers of good news. And do not separate us from him until You admit us through his entrance hall, accommodate us in his noble neighbourhood with those You have favoured amongst the Prophets, the truthful ones, the martyrs and the righteous ones, and they are the best of company. O Allah, we have believed in him, sallAllahu alayhi wasallam, without seeing him, so make us enjoy, O Allah, a vision of him in both the realms, and keep our hearts forever in love with him and establish us on his path. And cause us to complete our lives, adhering to his religion. And raise us in his secure company and party of success. And avail us of that love of him, sallAllahu alayhi wasallam, which is sealed in our hearts, on the day when there will be no ancestors, no wealth, and no sons (to speak for us). And have us drink at his pure wellspring. To drink from his fullest chalice. And facilitate for us a visit to Your sanctuary (Makkah) and his holy place (Medina) before You cause us to die. And make our stay at Your sanctuary and his maqam last until we pass away. O Allah, we seek his intercession with You, for his is the most lauded by You. And we exhort You through him for he is the best to entreat You (on our behalf). We seek access to You through him for his is the closest access to You. We lament to You, O Lord, about the hardness of our hearts, and the abundance of our sins. And the extent of our hopes and the imperfection of our actions. And our reluctance to do good deeds and our haste to commit bad deeds. Bestow upon the ones who seek Your help, O Lord, victory over our enemies. And help our souls. And through Your grace make us rely solely on our good acts and no other considerations, O Our Lord. O Lord, we associate ourselves with the honour of Your Messenger, sallAllahu alayhi wasallam, so do not distance us. And we stop at Your door, so do not turn us away. And we entreat You alone so do not thwart us. O Allah, have mercy upon our beseeching and allay our fear. Accept our actions and make us righteous. Make obedience to You our main occupation. And cause us to spend our wealth only for good. And fulfill our hopes and more. And seal our final destination with bliss. Thus is our lowliness made clear before You and our condition is not hidden from You. You have commanded us and we have been remiss. You have forbidden and we have transgressed. Nothing is wider than Your clemency. So pardon us, O Best Gratifier of Hopes. And Most Generous Redeemer of Petitions. For You are the Pardoner, the Forgiver, the Merciful, O Most Merciful of the Merciful. And the blessings and bountiful peace of Allah be upon Sayyidina Muhammad and upon his family and companions, and praise be to Allah, Lord of the Worlds.",
        "isbookmarked": "false"
    }
]
