[
    {
        "num": "1",
        "arabic_text": "بِسْمِ اللهِ الرَّحْمٰنِ الرَّحِيمِ اللَّهُمَّ يَا جَادَ تَبَنَّكَ سَيِّدَنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ عِنْدَكَ وَمَكَانَتَهُ لَدَيْكَ وَمَكْتَبَتَكَ لَهُ وَمَكْتَبَهُ لَكَ، وَبَاسِطَ الَّذِي يَبِيتُكَ وَبَيْتَهُ أَسْأَلُكَ أَنْ نُصَلِّيَ وَتُسَلِّمَ عَلَيْهِ وَعَلَى آلِهِ وَضَاعِفِ اللَّهُمَّ مَكْتَبِي فِيهِ وَعَرِّفْنِي بِحَقِّهِ وَرَتِّبْهُ",
        "transcript": "Bismillahi-r-Rahmani-r-Rahim. Allahumma ya jadda tabannaka sayyidana Muhammadan sallallahu alayhi wa sallam indaka wa makanatahu ladayka wa maktabataka lahu wa maktabahu laka, wa basita alladhi yabituka wa baytahu as'aluka an nusalliya wa tusallima alayhi wa ala alihi wa da'ifi Allahumma maktabi fihi wa arifni bihaqqihi wa rattibhu",
        "translate": "Во имя Аллаха, Милостивого, Милосердного. О Аллах, о Щедрый, прими нашего господина Мухаммада (да благословит его Аллах и приветствует) близко к Себе, даруй ему высокое положение перед Тобой, сделай так, чтобы Ты был доволен им, а он - Тобой. О Раскрывающий то, что сокрыто в Твоем знании и в его доме, я прошу Тебя благословлять и приветствовать его и его семью. О Аллах, укрепи меня в этом, познакомь меня с его истинным положением и степенью",
        "isbookmarked": "false"
    },
    {
        "num": "2",
        "arabic_text": "وَوَفِّقْنِي لِاتِّبَاعِهِ وَالقِيَامِ بِأَدَبِهِ وَسُنَّتِهِ، وَأَجْمَعْنِي مَعَهُ، وَسَتْعِنْ بِرُؤْيَتِهِ وَأَسْعِدْنِي بِمُكَالَمَتِهِ",
        "transcript": "Wa waffiqni li-ttiba'ihi wal-qiyami bi-adabihi wa sunnatihi, wa ajma'ni ma'ahu, wa sta'in bi-ru'yatihi wa as'idni bi-mukalamatihi",
        "translate": "Помоги мне следовать за ним, соблюдать его этикет и сунну, соедини меня с ним, помоги мне увидеть его и удостой меня беседы с ним",
        "isbookmarked": "false"
    },
    {
        "num": "3",
        "arabic_text": "وَازْفَعْ عَنِّي العَوَابِقَ وَالعَلَائِقَ وَالوَسَائِطَ وَالحِجَابِ، وَشَيِّفْ سَمْعِي مَعَهُ بِلَذِيذِ الخِطَابِ، وَهَيِّنْ لِي التَّأَلُّقَ مِنْهُ وَأَهْلِنِي لِحُضْمَتِهِ وَاجْعَلْ صَلَاتِي عَلَيْهِ ثَوَابًا تَامًّا كَامِلًا مُكْمَلًا طَاهِرًا مُطَهَّرًا مَاحِيًا كُلَّ ظُلْمٍ وَظُلْمَةٍ وَشَكٍّ وَشِرْكٍ وَكُفْرٍ وَزُورٍ وَوزْنٍ",
        "transcript": "Wazfa' anni al-awabiqa wal-ala'iq wal-wasa'it wal-hijab, wa shayyif sam'i ma'ahu bil-ladhidhi al-khitab, wa hayyin li at-ta'alluqa minhu wa ahlin li hudmatihi waj'al salati alayhi thawaban tammam kamilan mukmalam tahiran mutahharan mahiyan kulla zulmin wa zulmatin wa shakkin wa shirkin wa kufrin wa zurin wa waznin",
        "translate": "Отдали от меня преграды, привязанности, посредников и завесы, сделай мой слух восприимчивым к сладостным речам с ним, облегчи мне достижение близости к нему, сделай меня достойным его общества. И сделай мои благословения на него полным, совершенным, завершенным, чистым и очищающим вознаграждением, стирающим всякую несправедливость, мрак, сомнение, многобожие, неверие, ложь и тяжесть",
        "isbookmarked": "false"
    },
    {
        "num": "4",
        "arabic_text": "وَاجْعَلْهَا سَبَبًا لِلتَّمَحُّصِ وَمَرْقًى لِأَعْلَى مَقَامِ الإِخْلَاصِ وَالتَّخَلُّصِ حَتَّى لَا يَبْقَى فِي رُوحِي وَقَلْبِي إِلَّا لَكَ وَحَتَّى أَمْلَحَ لِحَضْرَتِكَ وَأَكُونَ مِنْ أَهْلِ خُصُوصِيَّاتِكَ",
        "transcript": "Waj'alha sababan li-t-tamahhusi wa marqan li-a'la maqami al-ikhlas wa at-takhallusi hatta la yabqa fi ruhi wa qalbi illa laka wa hatta amlaha li-hadratika wa akuna min ahli khhususiyatik",
        "translate": "И сделай это причиной очищения и ступенью к высшей степени искренности и освобождения, чтобы в моей душе и сердце не осталось ничего, кроме Тебя, и чтобы я стал угодным Твоему присутствию и был среди особых избранников Твоих",
        "isbookmarked": "false"
    },
    {
        "num": "5",
        "arabic_text": "مُسْتَتْعِسًا بِإِذْنِهِ وَمُسْتَعْصِمًا بِهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ مُسْتَعْصِمًا بِهِ مِنْ حَفَرَتِكَ العَالِيَةِ فِي كُلِّ وَقْتٍ وَحِينٍ يَا إِلٰهُ يَا ثَوَّابُ يَا حَقُّ يَا مُبِينُ وَصَلَّى اللهُ تَعَالَى عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلَى آلِهِ وَصَحْبِهِ وَسَلَّمَ",
        "transcript": "Mustat'isan bi-idhnihi wa musta'siman bihi sallallahu alayhi wa sallam musta'siman bihi min hafratika al-aliyah fi kulli waqtin wa hinin ya Ilahu ya Thawwabu ya Haqqu ya Mubinu wa sallallahu ta'ala ala sayyidina Muhammadin wa ala alihi wa sahbihi wa sallam",
        "translate": "Взывая с позволения Его и ища защиты у Него (да благословит его Аллах и приветствует), ища защиты у Него от Твоих высоких испытаний в каждое время и момент. О Боже, о Воздающий, о Истинный, о Ясный! И да благословит Аллах Всевышнего нашего господина Мухаммада, его семью и сподвижников и да приветствует",
        "isbookmarked": "false"
    }
]
