[
    {
        "num": "",
        "arabic_dua": "بِسْمِ اللهِ الرَّحْمٰنِ الرَّحِيمِ",
        "transcript": "Bismillahir-Rahmanir-Raheem",
        "translate": "In the name of Allah, the Most Gracious, the Most Merciful",
        "isbookmarked": "false"
    },
    {
        "num": "",
        "arabic_dua": "أَسْتَغْفِرُ اللهَ الْعَظِيمَ الَّذِي لَا إِلٰهَ إِلَّا هُوَ الْحَقُّ الْقَيُّومُ وَأَتُوبُ إِلَيْهِ، وَنَسْأَلُهُ الثَّابِتَةَ وَالْمَغْفِرَةَ وَالْهُدَايَةَ لَنَا إِلٰهُ هُوَ التَّقَارُبُ الرَّحِيمُ",
        "transcript": "Astaghfirullahal-'Adheem alladhi la ilaha illa Huwal-Haqqul-Qayyoomu wa atoobu ilayh, wa nas'aluhuth-thabitata wal-maghfirata wal-hudata lana ilahun Huwat-taqarubur-Raheem",
        "translate": "I seek forgiveness from Allah the Almighty, besides Whom there is no deity, the Ever-Living, the Sustainer of existence, and I repent to Him. We ask Him for steadfastness, forgiveness, and guidance. Our God is the Most Near, the Most Merciful",
        "isbookmarked": "false"
    },
    {
        "num": "",
        "arabic_dua": "سِيجَانَ اللهِ وَالْعَمَدُ لَهُ وَلَا إِلٰهَ إِلَّا اللهُ وَاللهُ أَكْبَرُ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللهِ الْعَلِيُّ الْعَظِيمُ",
        "transcript": "Seejanallahi wal-'amadu lahu wa la ilaha illallahu wallahu akbar, wa la hawla wa la quwwata illa billahil-'Aliyyil-'Adheem",
        "translate": "Allah's protection and support are sufficient, there is no deity except Allah, and Allah is the Greatest. There is no power nor strength except with Allah, the Most High, the Almighty",
        "isbookmarked": "false"
    },
    {
        "num": "",
        "arabic_dua": "حَسْبُنَا اللهُ وَنِعْمَ الْوَكِيلُ، نِعْمَ المَوْلَى وَ نِعْمَ النَّصِيرُ، غُفْرَانَكَ رَبَّنَا وَاِلَيْكَ الْمَصِير",
        "transcript": "Hasbunallahu wa ni'mal-Wakeel, ni'mal-Mawla wa ni'man-Naseer, ghufranaka Rabbana wa ilaykal-maseer",
        "translate": "Allah is sufficient for us and He is the best Disposer of affairs. What an excellent Protector and what an excellent Helper. Your forgiveness, our Lord, and to You is the destination",
        "isbookmarked": "false"
    }
]