[
  {
    "arabic_dua": "بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ",
    "transcript": "Бисми-Лляхи ллязи ля йадурру ма’асмихи шай-ун филь-арды ва ля фис-самаа-и ва хува с-Сами’уль ’Алим",
    "translate": "С именем Аллаха, с именем Которого ничто не причинит вреда ни на земле, ни на небе, ведь Он – Слышащий, Знающий! (3 раза утром и вечером) - Тот, кто скажет три раза: “С именем Аллаха, с именем Которого ничто не причинит вреда ни на земле, ни на небе, ведь Он – Слышащий, Знающий! - того не постигнет нежданная беда до самого утра, а тот, кто произнесёт их утром три раза, того не постигнет нежданная беда до самого вечера. Абу Дауд № 5088"
  },
  {
    "arabic_dua": "أعُوذُ بِكَلِماتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ ما خَلَق",
    "transcript": "А‘узу би-кялимати-Ллахи-т-таммати мин шарри ма халяк",
    "translate": "Прибегаю к защите совершенных слов Аллаха от зла того, что Он создал (Муслим, 2709)"
  },
  {
    "arabic_dua": "بِسْمِ اللَّهِ تَوَكَّلْتُ عَلَى اللَّهِ لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ",
    "transcript": "Бисмиллах, таваккальту ‘аля Ллах, ва ла хауля уа ла куввата илля биЛлях",
    "translate": "Я начинаю с имени Аллаха; я уповаю на Аллаха; ничто не может изменить положение, кроме как сила Аллаха (Абу Дауд, ат-Тирмизи, ан-Наса’и)"
  },
  {
    "arabic_dua": "حَسْبِيَ اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ عَلَيهِ تَوَكَّلتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيمِ",
    "transcript": "Хасбийа Ллаху ля иляха илля хуа; ‘алейхи таваккяльту ва хуа Раббу ль-‘арши ль-‘азым.",
    "translate": "Достаточно мне Аллаха, помимо Которого нет иного бога; на Него я уповаю, и Он — Господь великого престола. (7 раз)"
  },
  {
    "arabic_dua": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَالْعَجْزِ وَالْكَسَلِ، وَالْجُبْنِ وَالْبُخْلِ، وَضَلَعِ الدَّيْنِ وَغَلَبَةِ الرِّجَالِ",
    "transcript": "Аллахумма инни а’узу бика миналь-хамми валь-хазани, валь-‘аджзи валь-касали, валь-джубни валь-бухли, ва даля’и-д-дайни ва гъалябати-р-риджали",
    "translate": "О Аллах, поистине, я прибегаю к Твоей защите от беспокойства и грусти, от слабости и нерадения, от скупости и малодушия, от бремени долга и притеснения людей (Бухари, 2329)"
  },
  {
    "arabic_dua": "اللّهُـمَّ إِنِّـي أَعـوذُ بِكَ مِـنْ عَذابِ القَـبْر، وَمِـنْ عَذابِ جَهَـنَّم، وَمِـنْ فِتْـنَةِ المَحْـيا وَالمَمـات، وَمِـنْ شَـرِّ فِتْـنَةِ المَسيحِ الدَّجّال",
    "transcript": "Аллахумма, инни а'узу би-кя мин 'азаби-ль-кабри, ва мин 'азаби джаханна-ма, ва мин фитнати-ль-махйа ва-ль-мамати ва мин шарри фитнати-ль-масихи-д-даджжали!",
    "translate": "О Аллах, поистине, я прибегаю к Тебе от мучений могилы, от мук ада, от искушений жизни и смерти и от зла искушения Антихриста (аль-масих д-даджаль)!"
  },
  {
    "arabic_dua": "اللّهُـمَّ إِنِّـي أَعـوذُ بِكَ مِـنْ عَذابِ القَـبْر ، وَأَعـوذُ بِكَ مِـنْ فِتْـنَةِ المَسيحِ الدَّجّـال ، وَأَعـوذُ بِكَ مِـنْ فِتْـنَةِ المَحْـيا وَالمَمـات . اللّهُـمَّ إِنِّـي أَعـوذُ بِكَ مِنَ المَأْثَـمِ وَالمَغْـرَم",
    "transcript": "Аллахумма, инни а'узу би-кя мин азаби-ль-кабри, ва а'узу би-кя мин фитна-ти-ль масихи д-даджали, ва а'узу би-кя мин фитнати-ль-махйа ва-ль-мамати. Ал-лахумма, инни а'узу би-кя мин аль-ма'сами ва-ль-маграми!",
    "translate": "О Аллах, поистине, я прибегаю к Тебе от мучений могилы, и я прибегаю к Тебе от искушения Антихриста (аль-масих д-даджаль) и я прибегаю к Тебе от искушений жизни и смерти. О Аллах, поистине, я прибегаю к Тебе от греха и ущерба!"
  },
  {
    "arabic_dua": "اللّهُـمَّ إِنِّـي ظَلَـمْتُ نَفْسـي ظُلْمـاً كَثـيراً وَلا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْت ، فَاغْـفِر لي مَغْـفِرَةً مِنْ عِنْـدِك وَارْحَمْـني، إِنَّكَ أَنْتَ الغَـفورُ الرَّحـيم",
    "transcript": "Аллахумма, инни залямту нафси зульман кясиран, ва ля йагфиру-з-зунуба илля Анта, фа-гфир ли магфиратан мин 'индикя ва-рхам-ни, инна-кя Анта-ль-Гафуру-р-Рахиму!",
    "translate": "О Аллах, поистине, я обижал самого себя много раз (то есть, грешил.), а никто, кроме Тебя не прощает грехов! Прости же меня, и даруй мне Своё прощение и помилуй меня, поистине, Ты - Прощающий, Милосердный!"
  },
  {
    "arabic_dua": "اللّهُـمَّ إِنِّـي أَعوذُ بِكَ مِنَ البُخْـل، وَأَعوذُ بِكَ مِنَ الجُـبْن، وَأَعوذُ بِكَ مِنْ أَنْ أُرَدَّ إِلى أَرْذَلِ الـعُمُر، وَأََعوذُ بِكَ مِنْ فِتْنَـةِ الدُّنْـيا وَعَـذابِ القَـبْر",
    "transcript": "Аллахумма, инни а'узу би-кя мин аль-бухли, ва а'узу бикя мин аль-джубни, ва а'узу би-кя мин ан урадда иля арзали-ль-'умри ва а'узу би-кя мин фитнати-д-дунйа ва 'азаби-ль-кабри",
    "translate": "О Аллах, поистине, я прибегаю к Тебе от скупости, и я прибегаю к Тебе от малодушия, и я прибегаю к Тебе от того, чтобы оказаться дряхлым стариком, и я прибегаю к Тебе от искушений мира этого и мучений могилы"
  },
  {
    "arabic_dua": "اللَّهُمَّ لَكَ أسْلَمْتُ، وَبِكَ آمَنْتُ، وَعَلَيْكَ تَوَكَّلْتُ، وإلَيْكَ أنَبْتُ، وَبِكَ خَاصَمْتُ، وإلَيْكَ حَاكَمْتُ. فَاغْفِرْ لِي مَا قَدَّمْتُ، وَمَا أَخَّرْتُ، وَمَا أَسْرَرْتُ، وَمَا أعْلَنْتُ، أنتَ المُقَدِّمُ، وأَنْتَ المُؤَخِّرُ، لا إلهَ إِلاَّ أنْتَ وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ باللَّهِ",
    "transcript": "Аллахумма, ля-кя аслямту, ва би-кя аманту, ва ‘аляй-кя таваккяльту, ва иляй-кя анабту, ва би-кя хасамту ва иляй-кя хакямту, фа-гфир ли ма каддамту, ва ма аххарту, ва ма асрарту ва ма а‘лянту! Анта-ль-Мукаддиму ва Анта-ль-Муаххыру, ля иляха илля Анта уа ля хауля уа ля куввата илля биЛлях",
    "translate": "О Аллах, Тебе я предаюсь, в Тебя верую, на Тебя уповаю, к Тебе обращаюсь, благодаря Тебе веду споры и Твоего суда прошу, так прости же мне совершённое мной прежде и то, что ещё не совершено, то, что я совершил тайно, и что совершил явно! Ты — Выдвигающий вперёд и Ты — Отодвигающий, нет истинного бога, кроме Тебя! И нет мощи и силы ни у кого, кроме Аллаха!"
  },
  {
    "arabic_dua": "اللَّهُمَّ إِنَّي أَعُوذُ بِكَ مِنَ العَجْزِ وَالكَسَلِ وَالبُخْلِ وَالهَرَمِ وَالقَسْوَةِ وَالغَفْلَةِ وَ العَيْلَةِ وَ الذِّلَّةِ وَالمَسْكَنَةِ وَأَعُوذُ بِكَ مِنَ الفَقْرِ وَالكُفْرِ وَالشِّرْكِ وَالنِّفَاقِ وَالسُّمْعَةِ وَالرِّيَاءِ وَأَعُوذُ بِكَ مِنَ الصَّمَمِ وَالبُكْمِ وَالجُنُونِ وَالبَرَصِ والَجُذَامِ وَ سِيئِ الأَسْقَامِ",
    "transcript": "Аллахумма инни а’узу бикя миналь-‘аджзи уаль-касали уаль-бухли уаль-hарами уаль-касуати уаль-гафляти уаль-‘айляти уаз-зилляти уаль-масканати уа а’узу бикя миналь-факри уаль-куфри Аллахумма, инни а'узу би-кя мин аль-бараси, ва-ль-джунуни, ва-ль-джузами ва сайи'и-ль-ас-ками!",
    "translate": "О, Аллах, поистине я прибегаю к Твоей защите от бессилия и лени, от скупости и дряхлой старости, от чёрствости и нерадивости, от иждевения и унижения, а также от нищеты. О, Аллах, я прибегаю к Твоей защите от бедности и неверия, от многобожия и лицемерия, от деяний на показ и на всеуслышание. О Аллах, поистине, я прибегаю к Твоей защите от проказы, безумия, лепры и (прочих) тяжких болезней!"
  },
  {
    "arabic_dua": "اللَّهمَّ أَصْلِحْ لي دِيني الَّذي هُوَ عِصْمَةُ أَمْرِي ، وأَصْلِحْ لِي دُنْيَايَ التي فِيهَا مَعَاشِي ، وَأَصْلِحْ لي آخِرَتي الَّتي فِيها معادي، وَاجْعلِ الحيَاةَ زِيادَةً لي في كُلِّ خَيْرٍ ، وَاجْعَلِ الموتَ راحَةً لي مِنْ كُلِّ شَرٍ ",
    "transcript": "Аллахумма, аслих ли дини аллязи хува 'исмату амри, ва аслих ли дунйайа алляти фи-ха ма'аши, ва аслих ли ахырати алляти фи-ха ма'ади, ва-дж'али-ль-хайата зийадатан ли фи кулли хайрин, ва-дж'али-ль-маута рахатан ли мин кулли шаррин!",
    "translate": "O Аллах, приведи для меня в порядок мою религию, которая служит мне защитой (во всех) моих делах, и приведи для меня в порядок мир этот, в котором я живу, и приведи для меня в порядок мир вечный, куда я вернусь, и сделай так, чтобы жизнь (только) добавляла мне всякого блага, и сделай для меня смерть отдохновением от всякого зла! (Муслим (2720))"
  },
  {
    "arabic_dua": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ ما عمِلْتُ ومِنْ شَرِّ ما لَمْ أَعْمَلْ",
    "transcript": "Аллахумма, инни а'узу би-кя мин шарри ма 'амильту ва мин шарри ма лям а'маль!",
    "translate": "О Аллах, поистине, я прибегаю к Твоей защите от зла того, что я сделал, и от зла того, чего я не делал! Муслим (2716)"
  },
  {
    "arabic_dua": "اللَّهُمََّ اِّني اَعُوذُ بِكَ مِنْ شَرَّ سَمْعِي وَمِنْ شَرِّ بَصَرِي وَمِنْ شَرِّ لِسَانِي وَمِنْ شَرِّ قَلْبِي وَمِنْ شَرِّ مَنِيِّي",
    "transcript": "Аллахумма инни а’узу бика мин шарри сам’и, уа мин шарри басари, уа мин шарри кальби, уа мин шарри манийи",
    "translate": "О, Аллах, я обращаюсь к Тебе от зла моего слуха, от зла моего зрения, от зла моего языка, от зла моего сердца и от зла моего семени [Т.е. от разврата, блуда и распущенности] Аль-Бухари (663)"
  },
  {
    "arabic_dua": "رَبّ أعِنِّي وَلا تُعِنْ عَليَّ، وَانْصُرْنِي وَلا تَنْصُرْ عَلَيَّ، وَامْكُرْ لي وَلا تَمْكُرْ عَليَّ، وَيَسِّرْ هُدَايَ وَانْصُرْنِي على مَنْ بَغَى عَليَّ رَبّ اجْعَلْنِي لَكَ شاكِراً، لَكَ ذَاكِراً، لَكَ رَاهِباً، لَكَ مِطْوَاعاً، إِلَيْكَ مُجِيباً أوَّاهاً مُنيباً، تَقَبَّل  تَوْبَتِي، وَاغْسِلْ حَوْبَتي، وَأجِبْ دَعْوَتي، وَثَبِّتْ حُجَّتِي، وَاهْدِ قَلْبِي، وَسَدّدْ لِساني، وَاسْلُلْ سَخِيمَةَ قَلْبِي  ",
    "transcript": "Рабби а’инни уа ля ту’ин ‘аляйя, уа-нсурни уа ля тансур ‘аляйя, уа-мкур ли уа ля тамкур ‘аляйя, уа-хдини уа йассир худайя иляйя, уа-нсурни ‘аля ман бага ‘аляйя. Аллахумма-дж’альни лякя шакиран, лякя закиран, лякя рахибан, лякя митва’ан, иляйкя мухюитан, иляйкя аууахан мунибан, Рабби такаббаль тайбати, уа-гсиль хубати уа аджиб да’уати уа саббит худжати уа-хди кальби уа саддид лисани уа-слюль сахимата кальби",
    "translate": "О, Господь мой, помоги мне, но не помогай против меня, дай мне победу, но не давай победы против меня, делай для меня козни, но не делай козни против меня. Облегчи мне прямой путь и дай мне победу против тех, кто притеснял меня. О, Господь мой, сделай меня благодарным Тебе, поминающим Тебя, страшащимся Тебя, покорным Тебе, отвечающим Тебе, стремящимся к Тебе и возвращающимся к Тебе. Прими моё покаяние, смой мою грязь, внемли моей мольбе, укрепи мой довод, направь моё сердце язык мой, и избавь меня от ненависти в сердце"
  },
  {
    "arabic_dua": "الَّلهُمَّ جَنِّبْنِي مُنْكَرَاتِ الأخْلاَقِ وَالأَهْوَاءِ وَالأَعْمَالِ وَالأَدْوَاء",
    "transcript": "Аллахумма, инни а'узу би-кя мин мункярати-ль-ахляки, ва-ль-а'мали ва-ль-aхва'и!",
    "translate": "О Аллах, удержи меня от неподобающих нравственных качеств, дел и устремлений!"
  },
  {
    "arabic_dua": "اللَّهُمَّ أعِنِّي على ذِكْرِكَ ، وشُكْرِكَ ، وَحُسنِ عِبادتِكَ",
    "transcript": "Аллахумма, а'инни 'аля зикри-кя, ва шукри-кя ва хусни 'ибадати-кя",
    "translate": "О Аллах, помоги мне поминать Тебя, и благодарить Тебя, и должным образом поклоняться Тебе"
  },
  {
    "arabic_dua": "اللهمَّ إنّي أعوذُ بكَ منْ يَوْمِ السُّوءِ ومنْ لَيْلَةِ السُّوءِ ومنْ ساعَةِ السُّوءِ ومنْ صاحِبِ السُّوءِ ومنْ جارِ السُّوءِ في دَارِ المُقامَةِ",
    "transcript": "Аллахумма инни а’узу бика мин йауми-с-суи, ва мин лейляти-с-суи, ва мин са’ати-с-суи, ва мин сахиби-с-суи, ва мин джари-с-суи фи дариль-мукъамати",
    "translate": "О Аллах, поистине, я прибегаю к Твоей защите от плохого дня, плохой ночи и плохого часа, от плохого товарища и плохого (постоянного) соседа на месте моего проживания (ат-Табарани в «аль-Му’джам аль-Кабир» (17/294))"
  },
  {
    "arabic_dua": "بِسْمِ ٱللَّٰهِ ٱلرَّحْمَٰنِ ٱلرَّحِيمِ اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلاَّ بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ",
    "transcript": "БисмиЛляхир-Рахманир-Рахим. Аллаху ля иляха илля хува ль-Хаййу ль-Каййум, ля та’хузуху синатун ва ля наум, ляху ма фи с-самавати ва ма фи ль-ард, ман за ллязи йашфа‘у ‘индаху илля би-изних, йа‘ляму ма байна айдихим ва ма хальфахум, ва ля йухитуна би-шай’ин мин ‘ильмихи илля би-ма ша’а, васи‘а курсиййуху с-самавати ва ль-ард, ва ля йа’удуху хифзухума, ва хува ль-‘Алиййу ль-‘Азым.",
    "translate": "С именем Аллаха, Милостивого ко всем на этом свете и лишь к верующим на том. Аллах — нет божества, кроме Него, Живого, Вседержителя. Им не овладевают ни дремота, ни сон. Ему принадлежит то, что на небесах, и то, что на земле. Кто станет заступаться перед Ним без Его дозволения? Он знает их будущее и прошлое. Они постигают из Его знания только то, что Он пожелает. Его Престол [Подножие Трона] объемлет небеса и землю, и не тяготит Его оберегание их. Он — Возвышенный, Великий."
  },
  {
    "arabic_dua": "بِسْمِ ٱللَّٰهِ ٱلرَّحْمَٰنِ ٱلرَّحِيم قُلْ هُوَ اللَّهُ أَحَدٌ، اللَّهُ الصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُنْ لَهُ كُفُواً أَحَدٌ",
    "transcript": "БисмиЛляхир-Рахманир-Рахим. Куль хува Ллаху ахад, Аллаху с-Самад, лям йалид ва лям йуляд, ва лям йакун ляху куфуван ахад.",
    "translate": "С именем Аллаха, Милостивого ко всем на этом свете и лишь к верующим на том. Скажи: «Он — Аллах Единый, Аллах Самодостаточный. Он не родил и не был рожден, и нет никого равного Ему»."
  },
  {
    "arabic_dua": "بِسْمِ ٱللَّٰهِ ٱلرَّحْمَٰنِ ٱلرَّحِيم قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ، مِنْ شَرِّ مَا خَلَقَ، وَمِنْ شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِنْ شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ، وَمِنْ شَرِّ حَاسِدٍ إِذَا حَسَدَ",
    "transcript": "БисмиЛляхир-Рахманир-Рахим. Куль а‘узу би-Рабби ль-фаляк, мин шарри ма халяк, ва мин шарри гасикин изза вакаб, ва мин шарри н-наффасати фи ль-‘укад, ва мин шарри хасидин изза хасад.",
    "translate": "С именем Аллаха, Милостивого ко всем на этом свете и лишь к верующим на том. Скажи: «Прибегаю к защите Господа рассвета от зла того, что Он сотворил, от зла мрака, когда он наступает, от зла [колдуний], поплевывающих на узлы, от зла завистника, когда он завидует»."
  },
  {
    "arabic_dua": "بِسْمِ ٱللَّٰهِ ٱلرَّحْمَٰنِ ٱلرَّحِيم قُلْ أَعُوذُ بِرَبِّ النَّاسِ، مَلِكِ النَّاسِ، إِلَهِ النَّاسِ، مِنْ شَرِّ الْوَسْوَاسِ الْخَنَّاسِ، الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ، مِنَ الْجِنَّةِ وَالنَّاسِ",
    "transcript": "БисмиЛляхир-Рахманир-Рахим. Куль а‘узу би-Рабби н-нас, Малики н-нас, Иляхи н-нас, мин шарри ль-васваси ль-ханнас, аллязи йувасвису фи судури н-нас, мин аль-джиннати ва н-нас.",
    "translate": "С именем Аллаха, Милостивого ко всем на этом свете и лишь к верующим на том. Скажи: «Прибегаю к защите Господа людей, Царя людей, Бога людей, от зла искусителя отступающего [или: сжимающегося] [при поминании Аллаха], который наущает в груди людей и бывает из джиннов и людей»."
  }
]