[
    {
        "num": "43-51",
        "arabic_dua": "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ نَّبِيِّكَ، وَسَيِّدِنَا إِبْرَاهِيمَ خَلِيلِكَ، وَعَلَى جَمِيعِ أَنْبِيَائِكَ وَأَصْفِيَائِكَ، مِنْ أَهْلِ أَرْضِكَ وَسَمَائِكَ، عَدَدَ خَلْقِكَ وَرِضَاءَ نَفْسِكَ وَزِنَةَ عَرْشِكَ وَمِدَادَ كَلِمَاتِكَ وَمُنْتَهَى عِلْمِكَ، وَزِنَةَ جَمِيعِ مَخْلُوقَاتِكَ، صَلَاةً مُّكَرَّرَةً أَبَدًا، عَدَدَ مَا أَحْصَى عِلْمُكَ، وَمِلْءَ مَا أَحْصَى عِلْمُكَ، وَأَضْعَافَ مَا أَحْصَى عِلْمُكَ، صَلَاةً تَزِيدُ وَتَفُوقُ وَتَفْضُلُ صَلَاةَ المُصَلِّينَ عَلَيْهِمْ مِّنَ الخَلْقِ أَجْمَعِينَ، كَفَضْلِكَ عَلَى جَمِيعِ خَلْقِكَ. اللَّهُمَّ اجْعَلْنِي مِمَّنْ لَزِمَ مِلَّةَ نَبِيِّكَ سَيِّدِنَا مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، وَعَظَّمَ حُرْمَتَهُ، وَأَعَزَّ كَلِمَتَهُ، وَحَفِظَ عَهْدَهُ وَذِمَّتَهُ، وَنَصَرَ حِزْبَهُ وَدَعْوَتَهُ، وَكَثَّرَ تَابِعِيهِ وَفِرْقَتَهُ، وَوَافَى زُمْرَتَهُ، وَلَمْ يُخَالِفْ سَبِيلَهُ وَسُنَّتَهُ. اللَّهُمَّ إِنِّي أَسْأَلُكَ الاسْتِمْسَاكَ بِسُنَّتِهِ، وَأَعُوذُ بِكَ مِنَ الانْحِرَافِ عَمَّا جَاءَ بِهِ. اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ مِنْهُ سَیِّدُنَا مُحَمَّدٌ نَّبِيُّكَ وَرَسُولُكَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا اسْتَعَاذَكَ مِنْهُ سَیِّدُنَا مُحَمَّدٌ نَّبِيُّكَ وَرَسُولُكَ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ. اللَّهُمَّ اعْصِمْنِي مِنْ شَرِّ الفِتَنِ، وَعَافِنِي مِنْ جَمِيعِ المِحَنِ، وَأَصْلِحْ مِنِّي مَا ظَهَرَ وَمَا بَطَنَ، وَنَقِّ قَلْبِي مِنَ الحِقْدِ وَالحَسَدِ، وَلَا تَجْعَلْ عَلَيَّ تِبَاعَةً لِأَحَدٍ. اللَّهُمَّ إِنِّي أَسْأَلُكَ الأَخْذَ بِأَحْسَنِ مَا تَعْلَمُ، وَالتَّرْكَ لِسَیِّئِ مَا تَعْلَمُ، وَأَسْأَلُكَ التَّكَفُّلَ بِالرِّزْقِ وَالزُّهْدَ فِي الكَفَافِ وَالمَخْرَجَ بِالْبَيَانِ مِنْ كُلِّ شُبْهَةٍ، وَالفَلَجَ بِالصَّوَابِ فِي كُلِّ حُجَّةٍ، وَالعَدْلَ فِي الغَضَبِ وَالرِّضَىٰ، وَالتَّسْلِيمَ لِمَا يَجْرِي بِهِ القَضَا، وَالاقْتِصَادَ فِي الفَقْرِ وَالغِنَىٰ، وَالتَّوَاضُعَ فِي القَوْلِ وَالفِعْلِ، وَالصِّدْقَ فِي الجِدِّ وَالهَزْلِ. اللَّهُمَّ إِنَّ لِي ذُنُوبًا فِيمَا بَيْنِي وَبَيْنَكَ، وَذُنُوبًا فِيمَا بَيْنِي وَبَيْنَ خَلْقِكَ. اللَّهُمَّ مَا كَانَ لَكَ مِنْهَا فَاغْفِرْهُ لِي، وَمَا كَانَ مِنْهَا لِخَلْقِكَ فَتَحَمَّلْهُ عَنِّي، وَأَغْنِنِي بِفَضْلِكَ إِنَّكَ وَاسِعُ المَغْفِرَةِ. اللَّهُمَّ نَوِّرْ بِالْعِلْمِ قَلْبِي، وَاسْتَعْمِلْ بِطَاعَتِكَ بَدَنِي، وَخَلِّصْ مِنَ الفِتَنِ سِرِّي، وَاشْغَلْ بِالاعْتِبَارِ فِكْرِي، وَقِنِي شَرَّ وَسَاوِسِ الشَّيْطَانِ، وَأَجِرْنِي مِنْهُ يَا رَحْمٰنُ حَتَّى لَا يَكُونَ لَهُ عَلَيَّ سُلْطَانٌ.",
        "transcript": "Allāhummaṣalli ʿalā sayyidinā Muḥammadin nabiyyika, wa sayyidinā Ibrāhīma khālīlika, wa ʿalā jamīʿi anbiyāʾika wa aṣfiyāʾika, min ahli arḍika wa samāʾika, ʿadada khalqika wa riḍāʾa nafsika wa zinata ʿarshika wa midada kalimātika wa muntahā ʿilmika, wa zinata jamīʿi makhluqātika, ṣalātan mukarraratan abadan ʿadada mā aḥsā ʿilmuka, wa milʾa mā aḥṣā ʿilmuka, wa aḍʿāfa mā aḥṣā ʿilmuka, ṣalātan tazidu wa tafūqu wa tafḍulu ṣalātal muṣallīna ʿalayhim minal khalqi ajmaʿīna, kafaḍlika ʿalā jamīʿi khalqika. Allāhummajʿalnī mimman lazima millata nabiyyika sayyidinā Muḥammadin ṣallAllāhu ʿalayhi wa sallam, wa ʿaẓẓama ḥurmatahu, wa aʿazza kalimatahu, wa ḥafiẓa ʿahdahu wa dhimmatahu, wa naṣara ḥizbahu wa daʿwatahu, wa kathara tābiʿīhi wa firqatahu, wa wāfā zumratahu, wa lam yukhālif sabīlahu wa sunnatahu. Allāhummainni asʾalukal istimsāka bisunnatihi, wa aʿūdhu bika minal inḥirāfi ʿammā jāʾa bihi. Allāhummainni asʾaluka min khayri mā saʾalaka minhu sayyidunā Muḥammadun nabiyyuka wa rasūluka ṣallAllāhu ʿalayhi wa sallama, wa aʿūdhu bika min sharri mastaʿādhaka minhu sayyidunā Muḥammadun nabiyyuka wa rasūluka ṣallAllāhu ʿalayhi wa sallam. Allāhummaʿṣimnī min sharril fitani, wa ʿāfinī min jamīʿil miḥani, wa aṣliḥ minnī mā ẓahara wa mā baṭana, wa naqqi qalbī minal ḥiqdi wal ḥasadi, wa lā tajʿal ʿalayya tibāʿatan li aḥad. Allāhummainni asʾalukal akhdha biʾaḥsani mā taʿlamu, wattarka lisayyiʾi mā taʿlamu, wa asʾalukat takaffula birrizqi waz zuhda filkafāfi, wal makhraja bil bayāni min kulli shubhatin, wal falaja biṣṣawābi fī kulli ḥujjatin, wal ʿadla fīl ghaḍabi war riḍāʾi, wat taslīma limā yajrī bihil qaḍāʾu, wal iqtiṣāda fīl faqri wal ghinā, wat tawaḍuʿa filqawli wal fiʿli, waṣ ṣidqa fīl jiddi wal hazli. Allāhummainna lī dhunuban fimā baynī wa baynaka, wa dhunūban fimā baynī wa bayna khalqika. Allāhummamā kana laka minha faghfirhu lī, wa mā kāna minhā likhalqika fataḥammalhu ʿannī, wa aghninī bifaḍlika innaka wāsiʿul maghfirah. Allāhummanawwir bil ʿilmi qalbī wastaʿmil biṭāʿatika badanī, wa khalliṣ minal fitani sirrī, washghal bilʿitibāri fikri, wa qinī sharra wasāwisish shayṭān, wa ajirnī minhu yā raḥmanu ḥatta la yākūna lahu ʿalayya sulṭān.",
        "translate": "O Allah, bless Sayyidina Muhammad, Your Prophet and Sayyidina Ibrahim, Your friend, and all Your prophets and sanctified ones from the people of Your earth and Your heaven in quantity as great as Your creation, the weight of Your throne, the ink (that writes) Your words, the furthest reach of Your knowledge, and the weight of all Your creatures. Bless them with a blessing that is repeated forever, and in quantity as great as what Your knowledge enumerates and what Your knowledge contains, with a boundless increase as only Your knowledge can enumerate. Bless them with a blessing above, superior, and better than the blessings of those who bless them from all of creation, as You favour all of Your creation. O Allah, make me among those who hold fast to the religion of Your Prophet, Sayyidina Muhammad sallAllahu alayhi wasallam. And exalt his respect, magnify his word, preserve his covenant and sanctity. Give his party and his calling victory. Increase his followers and those who pledge him allegiance. And grant that we may die in his company, and do not let us stray from his Path and sunnah. O Allah, I ask You for adherence to his sunnah, and I seek refuge with You from deviating from what he conveyed. O Allah, I ask You for the good which Sayyidina Muhammad, Your Prophet and Messenger sallAllahu alayhi wasallam asked of You. And I take refuge with You from the evil of what Sayyidina Muhammad, Your Prophet and Messenger sallAllahu alayhi wasallam took refuge. O Allah, preserve me from the evil of trials, and protect me from all afflictions, and put right what appears to me and what is hidden, and purify my heart from rancour and envy, and do not allow anyone to oppress me. O Allah, I ask You for the good that You know and to let me avoid the evil that You know. And I ask You to guarantee my provision, for Zuhd (detachment) in sufficiency, a clear way out of every uncertainty, success with proper action in every argument, justice in anger and pleasure, submission to what the Decree brings, moderation in poverty and wealth, humility in speech and action, and sincerity in gravity and jest. O Allah, I have sins between me and You, and sins between me and Your creation. O Allah, forgive what You have of them and remove from me what Your creation has of them. And enrich me with Your bounty, for Your forgiveness is All-Encompassing. O Allah, illuminate my heart with knowledge, make my body obedient to You, purify my secret from temptations, occupy my thoughts with reflection, preserve me from the evil of the whisperings of the Shaytan, and protect me, O All-Merciful, from him until he has no power over me.",
        "isbookmarked": "false"
    }
]

