[
    {
        "num": "1",
        "arabic_dua": "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ النَّبِيِّ الزَّاهِدِ، رَسُولِ المَلِكِ الصَّمَدِ الوَاحِدِ، صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ صَلَاةً دَائِمَةً إِلَی مُنْتَهَى الآبَادِ، بِلَا انْقِطَاعٍ وَلَا نَفَادٍ، صَلَاةً تُنْجِينَا بِهَا مِنْ حَرِّ جَهَنَّمَ وَبِئْسَ المِهَادُ.",
        "transcript": "Allāhummaṣalli ʿalā sayyidinā Muḥammadin nabiyyiz zāhidi, rasūlil malikiṣ ṣamadil wāḥidi, ṣallAllahu ʿalayhi wasṣallama ṣalātan dāʾimatan ilā muntahal ābādi, bilan qiṭāʾin wa lā nafādin, ṣalātan tunjīina bihā min ḥarri jahannama wa biʾsal mihād.",
        "translate": "O Allah, bless Sayyidina Muhammad, the ascetic Prophet, the Messenger of the Eternal King, the One. May Allah bless him and grant him peace with a blessing lasting until the end of eternity without interruption or depletion, a prayer by which we are saved from the heat of Jahannam, the worst resting-place.",
        "isbookmarked": "false"
    },
    {
        "num": "2",
        "arabic_dua": "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ النَّبِيِّ الأُمِّيِّ وَعَلَى آلِهِ وَسَلِّمْ، صَلَاةً لَا يُحْصَى لَهَا عَدَدٌ، وَلَا يُعَدُّ لَهَا مَدَدٌ.",
        "transcript": "Allāhummaṣalli ʿalā sayyidinā Muhammadin nabiyyil ummiyyi wa ʿalā ālihi wa ṣallim, ṣalātan lā yuḥṣa lahā ʿadadun, wa lā yuʿaddu lahā madad.",
        "translate": "O Allah, bless Sayyidina Muhammad, the unlettered Prophet, and his family, and grant them peace with a blessing that cannot be counted in number nor scale.",
        "isbookmarked": "false"
    },
    {
        "num": "3",
        "arabic_dua": "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ صَلَاةً تُكْرِمُ بِهَا مَثْوَاهُ، وَتُبَلِّغُ بِهَا يَوْمَ القِيَامَةِ مِنَ الشَّفَاعَةِ رِضَاهُ.",
        "transcript": "Allāhummaṣalli ʿalā sayyidinā Muḥammadin ṣalātan tukrimu bihā mathwāhu, wa tuballighu bihā yawmal qiyāmati minash shafāʿati riḍāh.",
        "translate": "O Allah, bless Sayyidina Muhammad with a blessing that ennobles his place of abode, and on the Day of Resurrection brings pleasure with his intercession.",
        "isbookmarked": "false"
    },
    {
        "num": "4",
        "arabic_dua": "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ النَّبِيِّ الأَصِيلِ، السَّيِّدِ النَّبِيلِ، الَّذِي جَاءَ بِالْوَحْيِ وَالتَّنْزِيلِ، وَأَوْضَحَ بَيَانَ التَّأْوِيلِ، وَجَاءَهُ الأَمِينُ سَيِّدُنَا جِبْرِيلُ عَلَيْهِ السَّلَامُ، بِالْكَرَامَةِ وَالتَّفْضِیلِ، وَأَسْرَى بِهِ المَلِكُ الجَلِيلُ، فِي اللَّيْلِ البَهِيمِ الطَّوِيلِ، فَكَشَفَ لَهُ عَنْ أَعْلَى المَلَكُوتِ، وَأَرَاهُ سَنَاءَ الجَبَرُوتِ، وَنَظَرَ إِلَى قُدْرَةِ الحَيِّ الدَّائِمِ البَاقِي الَّذِي لَا يَمُوتُ، صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، صَلَاةً مَقْرُونَةً بِالْجَمَالِ، وَالحُسْنِ وَالكَمَالِ، وَالخَيْرِ وَالإِفْضَالِ.",
        "transcript": "Allāhummaṣalli ʿalā sayyidinā Muḥammadan nabiyyil aṣīlis sayyidin nabīlilladhi jāʾa bilwaḥyi wattanzīli, wa awḍaḥa bayānat taʾwīli, wajāʾahul amīnu Jibrīlu ʿalayhis salāmu, bil karāmati watafḍīli, wa asrā bihil malikul jalīlu, fil laylil bahīmiṭ ṭawīli, fakashafa lahu ʿan aʿlal malakūti, wa arāhu sanaʾal jabarūt, wa naẓara ilā qudratil ḥayyid dāʾimil bāqilladhi la yamūtu, ṣallAllahu ʿalayhi wa ṣallama, ṣalātan maqrūnatan biljamāli, wal ḥusni wal kamāli, wal khayri wal ifḍāl.",
        "translate": "O Allah, bless Sayyidina Muhammad, the Prophet of pure origin, the noble master who brought inspiration and revelation, clarified the elucidation of interpretation, and to whom the trustworthy Jibril, peace be upon him, brought nobility and preference, and to whom the Glorious King conveyed in the long jet-black night, and so disclosed to him the highest of the Malakut and showed him the glory of the Jabarut, and he saw the power of the Living, the Enduring, the Lasting, who never dies. May Allah bless him and grant him peace with a blessing manifesting beauty, righteousness, perfection, goodness and virtue.",
        "isbookmarked": "false"
    },
    {
        "num": "5",
        "arabic_dua": "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلَى آلِ سَيِّدِنَا مُحَمَّدٍ عَدَدَ الأَقْطَارِ، وَصَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلَى آلِ سَيِّدِنَا مُحَمَّدٍ عَدَدَ وَرَقِ الأَشْجَارِ، وَصَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلَى آلِ سَيِّدِنَا مُحَمَّدٍ عَدَدَ زَبَدِ البِحَارِ، وَصَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلَى آلِ سَيِّدِنَا مُحَمَّدٍ عَدَدَ الأَنْهَارِ، وَصَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلَى آلِ سَيِّدِنَا مُحَمَّدٍ عَدَدَ رَمْلِ الصَّحَارِي وَالقِفَارِ، وَصَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلَى آلِ سَيِّدِنَا مُحَمَّدٍ عَدَدَ ثِقْلِ الجِبَالِ وَالأَحْجَارِ، وَصَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلَى آلِ سَيِّدِنَا مُحَمَّدٍ عَدَدَ أَهْلِ الجَنَّةِ وَأَهْلِ النَّارِ، وَصَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلَى آلِ سَيِّدِنَا مُحَمَّدٍ عَدَدَ الأَبْرَارِ وَالفُجَّارِ، وَصَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلَى آلِ سَيِّدِنَا مُحَمَّدٍ عَدَدَ مَا يَخْتَلِفُ بِهِ اللَّيْلُ وَالنَّهَارُ.",
        "transcript": "Allāhummaṣalli ʿalā sayyidinā Muḥammadin wa ʿalā āli sayyidinā Muḥammadin ʿadadal aqṭār, wa ṣalli ʿalā sayyidinā Muḥammadin wa ʿalā āli sayyidinā Muḥammadin ʿadada waraqil ashjār, wa ṣalli ʿalā sayyidinā Muḥammadin wa ʿalā āli sayyidinā Muḥammadin ʿadada zabadil biḥār, wa ṣalli ʿalā sayyidinā Muḥammadin wa ʿalā āli sayyidinā Muḥammadin ʿadada ramliṣ ṣaḥāra wal qifār, wa ṣalli ʿalā sayyidinā Muḥammadin wa ʿalā āli sayyidinā Muḥammadin ʿadada thiqlil jibāli wal aḥjār, wa ṣalli ʿalā sayyidinā Muḥammadin wa ʿalā āli sayyidinā Muḥammadin ʿadada ahlil jannati wa ahlin nār, wa ṣalli ʿalā sayyidinā Muḥammadin wa ʿalā āli sayyidinā Muḥammadin ʿadadal abrāri wal fujjār, wa ṣalli ʿalā sayyidinā Muḥammadin wa ʿalā āli sayyidinā Muḥammadin ʿadada mā yakhtalifu bihil laylu wan nahār.",
        "translate": "O Allah, bless Sayyidina Muhammad and the family of Sayyidina Muhammad in quantity as great as the drops of rain. Bless Sayyidina Muhammad and the family of Sayyidina Muhammad in quantity as great as the leaves of the trees. Bless Sayyidina Muhammad and the family of Sayyidina Muhammad in quantity as great as the foam of the seas. Bless Sayyidina Muhammad and the family of Sayyidina Muhammad in quantity as great as the rivers. Bless Sayyidina Muhammad and the family of Sayyidina Muhammad in quantity as great as the sand of the deserts and wastelands. Bless Sayyidina Muhammad and the family of Sayyidina Muhammad in quantity as great as the weight of the mountains and rocks. Bless Sayyidina Muhammad and the family of Sayyidina Muhammad in quantity as great as the inhabitants of the Garden and the inhabitants of the Fire. Bless Sayyidina Muhammad and the family of Sayyidina Muhammad in quantity as great as the righteous and the dissolute. And bless Sayyidina Muhammad and the family of Sayyidina Muhammad in quantity as great as the endless alternating cycles of day and night.",
        "isbookmarked": "false"
    },
    {
        "num": "6",
        "arabic_dua": "وَاجْعَلِاللَّهُمَّ صَلَاتَنَا عَلَيْهِ حِجَابًا مِنْ عَذَابِ النَّارِ، وَسَبَبًا لِإِبَاحَةِ دَارِ القَرَارِ، إِنَّكَ أَنْتَ اللَّهُ العَزِيزُ الغَفَّارُ، وَصَلَّى اللَّهُ عَلَى سَيِّدِنَا مُحَمَّدٍ، وَعَلَى آلِهِ الطَّيِّبِينَ، وَذُرِّيَّتِهِ المُبَارَكِينَ، وَصَحَابَتِهِ الأَكْرَمِينَ، وَأَزْوَاجِهِ أُمَّهَاتِ المُؤْمِنِينَ، صَلَاةً مَوْصُولَةً تَتَرَدَّدُ إِلَى يَوْمِ الدِّينِ.",
        "transcript": "WajʿalilLlāhummaṣalātana ʿalayhi ḥijāban min ʿadhābin nar, wa sababan li ibāḥati dāril qarār, innaka antaLlāhul ʿAzizul Ghaffār, wa ṣallAllāhu ʿalā sayyidinā Muḥammadin, wa ʿalā ālihiṭ ṭaiyyibīna, wa dhurriyatihil mubārakīna, wa ṣaḥābatihil akramīna, wa azwājihi ummahātil muʾminīna, ṣalātan mawṣūlatan tataraddadu ilā yawmiddīn.",
        "translate": "O Allah, make our prayer on him a veil from the punishment of the Fire, and a reason for permission to enter the Abode of Repose. You are the Almighty, the Forgiving. May Allah bless Sayyidina Muhammad and his good family, his blessed descendants, his noble companions and his wives, the Mothers of the Believers, with continuous blessings repeating until the Day of Repayment.",
        "isbookmarked": "false"
    },
    {
        "num": "7",
        "arabic_dua": "اللَّهُمَّ صَلِّ عَلَى سَيِّدِ الأَبْرَارِ، وَزَيْنِ المُرْسَلِينَ الأَخْيَارِ، وَأَكْرَمِ مَنْ أَظْلَمَ عَلَيْهِ اللَّيْلُ وَأَشْرَقَ عَلَیْهِ النَّهَارُ (3)",
        "transcript": "Allāhummaṣalli ʿalā sayyidil abrāri, wa zaynil mursalīnal akhyāri, wa akrami man aẓlama ʿalayhil laylu wa ashraqa ʿalayhin nahār.",
        "translate": "O Allah, bless the lord of the righteous, and the adornment of the good Messengers, and the noblest ever to have been cloaked in darkness or bathed in the light of day. (3 times)",
        "isbookmarked": "false"
    },
    {
        "num": "8",
        "arabic_dua": "اللَّهُمَّ يَا ذَا المَنِّ الَّذِي لَا يُكَافَى امْتِنَانُهُ، وَالطَّوْلِ الَّذِي لَا يُجَازَى إِنْعَامُهُ وَإِحْسَانُهُ، نَسْأَلُكَ بِكَ وَلَا نَسْأَلُكَ بِأَحَدٍ غَيْرِكَ، أَنْ تُطْلِقَ أَلْسِنَتَنَا عِنْدَ السُّؤَالِ، وَتُوَفِّقَنَا لِصَالِحِ الأَعْمَالِ، وَتَجْعَلَنَا مِنَ الآمِنِينَ يَوْمَ الرَّجْفِ وَالزِّلْزَالِ، يَا ذَا العِزَّةِ وَالجَلَالِ، أَسْأَلُكَ يَا نُورَ النُّورِ، قَبْلَ الأَزْمِنَةِ وَالدُّهُورِ، أَنْتَ البَاقِي بِلَا زَوَالِ، الغَنِيُّ بِلَا مِثَالِ، القُدُّوسُ الطَّاهِرُ، العَلِيُّ القَاهِرُ، الَّذِي لَا يُحِيطُ بِهِ مَكَانٌ، وَلَا يَشْتَمِلُ عَلَيْهِ زَمَانٌ، أَسْأَلُكَ بِأَسْمَائِكَ الحُسْنَى كُلِّهَا، وَبِأَعْظَمِ أَسْمَائِكَ إِلَيْكَ، وَأَشْرَفِهَا عِنْدَكَ مَنْزِلَةً، وَأَجْزَلِهَا عِنْدَكَ ثَوَابًا، وَأَسْرَعِهَا مِنْكَ إِجَابَةً، وَبِاسْمِكَ المَخْزُونِ المَكْنُونِ، الجَلِيلِ الأَجَلِّ، الكَبِيرِ الأَکْبَرِ، العَظِيمِ الأَعْظَمِ، الَّذِي تُحِبُّهُ، وَتَرْضَى عَمَّنْ دَعَاكَ بِهِ، وَتَسْتَجِيبُ لَهُ دُعَاءَهُ.",
        "transcript": "Allāhummayā dhalmannilladhi lā yukāfamtinānuhu, waṭ ṭawlilladhi lā yujāza inʿāmuhu wa iḥsānuhu, nasʾaluka bika wa lā nasʾaluka bi aḥadin ghayrika, an tuṭliqal sinatanā ʿindas suʾāli, wa tuwafqanā li ṣāliḥil aʿmāli, wa tajʿalanā minal āminīna yawmar rajfi waz zalāzili, yā dhal ʿizzati wal jalāl, asʾaluka yā nūran nūri, qablal azminati wadduhūr, antal bāqi bilā zawālinil ghaniyyu bilā mithālil quddūsuṭ ṭāhirul ʿaliyyul qāhirulladhi lā yuḥīṭu bihi makānun, wa lā yashtamilu ʿalayhi zamān, asʾaluka bi asmaʾikal ḥusna kullihā, wa bi aʿẓami asmāʾika ilayka, wa ashrafihā ʿindaka manzilatan, wa ajzalihā ʿindaka thawāban, wa asraʿihā minka ijābatan, wa bismikal makhzūnil maknūnil jalīlil ajallil kabīril akbaril ʿaẓīmil aʿẓamilladhi tuḥibbuhu, wa tarḍa ʿamman daʿāka bihi, wa tastajību lahu duʿāʾah.",
        "translate": "O Allah, O Possessor of favour Whose graciousness cannot be equalled, and possessor of generosity whose blessing and kindness cannot be repaid. We ask You by Yourself, and we do not ask any other than You, to loosen our tongues in asking, grant us righteous deeds, and make us among the faithful on the Day of the tremor and earthquake, O Possessor of Might and Majesty. We ask You, O Light of the Light before all types of time, You are the Enduring without passing, the Rich without likeness, the Holy, the Pure, the High, the Victor Who is not encompassed by place nor by time. I ask You by all Your Most Beautiful Names, by the greatest of Your Names, by the noblest with You in rank, by the most abundant in reward with You and quickest in response, and by Your hidden Name, Your treasured Name, Your pure Name, by the most Glorious, the Great, the most Great, the Mighty through which You love and by which You are pleased with whomever calls upon You by it, and by which You answer his prayer.",
        "isbookmarked": "false"
    },
    {
        "num": "9",
        "arabic_dua": "أَسْأَلُكَاللَّهُمَّ بِلَا إِلَهَ إِلَّا أَنْتَ الحَنَّانُ المَنَّانُ، بَدِيعُ السَّمَاوَاتِ وَالأَرْضِ، ذُو الجَلَالِ وَالإِكْرَامِ، عَالِمُ الغَيْبِ وَالشَّهَادَةِ الكَبِيرُ المُتَعَالِ، وَأَسْأَلُكَ بِاسْمِكَ العَظِيمِ الأَعْظَمِ الَّذِي إِذَا دُعِيتَ بِهِ أَجَبْتَ، وَإِذا سُئِلْتَ بِهِ أَعْطَيْتَ، وَأَسْأَلُكَ بِاسْمِكَ الَّذِي يَذِلُّ لِعَظَمَتِهِ العُظَمَاءُ وَالمُلُوكُ وَالسِّبَاعُ وَالهَوَامُّ وَكُلُّ شَيْءٍ خَلَقْتَهُ، يَا اللَّهُ يَا رَبِّ اسْتَجِبْ دَعْوَتِي، يَا مَنْ لَهُ العِزَّةُ وَالجَبَرُوتُ، يَا ذَا المُلْكِ وَالمَلَكُوتِ، يَا مَنْ هُوَ حَيٌّ لَّا يَمُوتُ، سُبْحَانَكَ رَبِّ مَا أَعْظَمَ شَاْنَكَ، وَأَرْفَعَ مَكَانَكَ، أَنْتَ رَبِّي، يَا مُتَقَدِّسًا فِي جَبَرُوتِهِ، إِلَيْكَ أَرْغَبُ، وَإِيَّاكَ أَرْهَبُ، يَا عَظِيمُ يَا كَبِيرُ، يَا جَبَّارُ يَا قَادِرُ يَا قَوِيُّ، تَبَارَكْتَ يَا عَظِيمُ، تَعَالَيْتَ يَا عَلِيمُ، سُبْحَانَكَ يَا عَظِيمُ، سُبْحَانَكَ يَا جَلِيلُ، أَسْأَلُكَ بِاسْمِكَ العَظِيمِ التَّامِّ الكَبِيرِ، أَنْ لَا تُسَلِّطَ عَلَيْنَا جَبَّارًا عَنِيدًا، وَلَا شَيْطَانًا مَرِيدًا، وَلَا إِنْسَانًا حَسُودًا، وَلَا ضَعِيفًا مِنْ خَلْقِكَ، وَلَا شَدِيدًا، وَلَا بَارًّا وَلَا فَاجِرًا وَلَا عَبِيدًا وَلَا عَنِيدًا.",
        "transcript": "AsʾalukaAllāhummabilā ilaha illā antal Hannānal mannānu, badīʿus samāwāti wal arḍi, dhul-jalāli wal ikrāmi, ʿalimul ghaybi wash shahādatil kabīrul mutaʿāli, wa asʾaluka bismikal ʿaẓīmil aʿẓamilladhi idha duʿīta bihi ajabta, wa idha suʾilta bihi aʿṭayta, wa asʾaluka bismikalladhi yadhillu li ʿaẓmatihil ʿuẓamāʾu wal mulūku wassibāʾu wal hawāmmu wa kullu shayʿin khalaqtahu, yā Allahu yā rabbistajib daʿwatī, yā man lahul ʿizzatu wal jabarūtu, yā dhalmulki wal malakūti, yā man huwa ḥayyun lāyamūtu, subḥānaka rabbi mā ʿaẓama shaʾnaka, wa arfaʿa makānaka, anta rabbi ya mutaqaddisan fī jabarūtihi, ilayka arghabu, wa iyyāka arhabu, yā ʿaẓīmu yā kabīru, yā jabbāru ya qādiru yā qawiyyu, tabārakta yā ʿaẓīmu, taʿālayta yā ʿalīmu, subḥānaka yā ʿaẓīmu, subḥānaka yā jalīlu, asʾaluka bismikal ʿaẓīmit tāmmal kabīri, an lā tuṣalliṭa ʿalaynā jabbāran ʿanīdan, wa lā shayṭānan marīdan, wa lā insānan ḥasūdan, wa lā ḍaʿīfan min khalqika, wa lā shadīdan, wa lā bārran wa lā fājīran wa lā ʿabīdan wa lā ʿanīda.",
        "translate": "O Allah, I ask You by, \"There is no god but You, the Loving, Gracious, the Originator of the heavens and the earth, Master of Majesty and Honour, the Knower of the Unseen and the Visible, the Great, the Self-Exalted.\" I ask You by Your mightiest Name, by which You answer when You are called upon, and if You are asked by it, You grant the request. I ask You by Your name whose majesty the powerful are abased, as are kings, beasts of prey, reptiles, and all that You created, O Allah, O Lord, answer my prayer. O You Who possesses might and the Jabarut. O Possessor of the Mulk and the Malakut. O You Who are Living and never dies. Glory be to You, my Lord. How mighty is Your affair and exalted Your place. You are my Lord. O You who is pure in His Jabarut, it is You I desire and You I fear. O Mighty, O Great, O Compeller, O Powerful, O Strong. You are blessed, O Mighty. You are self-exalted, O Knower. Glory be to You, O Immense. Glory be to You. O Majestic. I ask You by Your complete, mighty, great Name that You do not give power over us to the stubborn tyrant, the rebellious shaytan, the envious man, the weak amongst Your creation, the oppressive one, the ruinous one, the corrupt one, the enslaved one, or the wilful one.",
        "isbookmarked": "false"
    },
    {
        "num": "10",
        "arabic_dua": "اللَّهُمَّإِنِّي أَسْأَلُكَ فَإِنِّي أَشْهَدُ أَنَّكَ أَنْتَ اللَّهُ الَّذِي لَا إِلٰهَ إِلَّا أَنْتَ الوَاحِدُ الأَحَدُ الصَّمَدُ، الَّذِي ﴿لَمْ يَلِدْ وَلَمْ يُولَدْ . وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌ﴾، يَا هُوَ يَا مَنْ لَّا هُوَ إِلَّا هُوَ، يَا مَنْ لَا إِلٰهَ إِلَّا هُوَ، يَا أَزَلِيُّ يَا أَبَدِيُّ، يَا دَهْرِيُّ يَا دَيْمُومِيُّ، يَا مَنْ هُوَ الحَيُّ الَّذِي لَا يَمُوتُ، يَا إِلٰهَنَا وَإِلٰهَ كُلِّ شَيْءٍ إِلٰهًا وَاحِدًا، لَا إِلٰهَ إِلَّا أَنْتَ.",
        "transcript": "Allāhummainni asʾaluka fa innī ash-hadu annaka antAllāhulladhī lā ilāha illā antal wāḥidul aḥaduṣ ṣamadalladhī lam yalid wa lam yūlad wa lam yakun lahu kufuwan aḥadun, yā huwa yā man lā huwa illā huwa, yā man lā ilāha illā huwa, yā azaliyyu yā abadiyyu, yā dahriyyu, yā daymūmiyyu, yā man huwal ḥayyulladhī lā yamūtu, yā ilāhanā wa ilāha kulli shayʾin ilāhan wāḥidan, lā ilāha illā anta.",
        "translate": "O Allah, I ask You, and I testify that You are Allah. There is no god except You, the One, the Unique, the Eternal who did not beget nor was He begotten, and there is no equal to Him. O He, O He of whom there is no He except Him, O One who there is no god except Him, O Eternal One, O Infinite One, O Very Ancient One, O Perpetual One, O He Who is the Living Who never dies, O our God and the God of everything, Who is one God, and there is no god except You.",
        "isbookmarked": "false"
    },
    {
        "num": "11",
        "arabic_dua": "اللَّهُمَّ فَاطِرَ السَّمَاوَاتِ وَالأَرْضِ عَالِمَ الغَيْبِ وَالشَّهَادَةِ الرَّحْمَـٰنَ الرَّحِيمَ، الحَيَّ القَيُّومَ الدَّيَّانَ الحَنَّانَ المَنَّانَ، البَاعِثَ الوَارِثَ، ذَا الجَلَالِ وَالإِكْرَامِ، قُلُوبُ الخَلَائِقِ بِيَدِكَ، نَوَاصِيهِمْ إِلَيْكَ، فَأَنْتَ تَزْرَعُ الخَيْرَ فِي قُلُوبِهِمْ، وَتَمْحُو الشَّرَّ إِذَا شِئْتَ مِنْهُمْ.",
        "transcript": "Allāhummafāṭiras samāwāti wal arḍi ʿālimal ghaybi wash shahādatir raḥmānar raḥīmal ḥayyal qayyūmad dayyānal ḥannānal mannānal bāʿithal wāritha, dhal jalāli wal ikrāmi, qulūbul khalāiqi bi yadika, nawāṣīhim ilayka, fa anta tazraʿul khayra fī qulūbihim, wa tamḥūsh sharra idhā shiʾta minhum.",
        "translate": "O Allah, Creator of the heavens and the earth, Knower of the Unseen and Visible, the All-Merciful, the Most Merciful, the Living, the Self-Sustaining, the Judge, the Loving, the Generous, the Raiser, the Inheritor, the Master of Majesty and Nobility, who has control over the hearts of the creatures, You cultivate good in their hearts and efface evil from them if You wish.",
        "isbookmarked": "false"
    },
    {
        "num": "12",
        "arabic_dua": "فَأَسْأَلُكَاللَّهُمَّ أَنْ تَمْحُوَ مِنْ قَلْبِي كُلَّ شَيْءٍ تَكْرَهُهُ، وَأَنْ تَحْشُوَ قَلْبِي مِنْ خَشْيَتِكَ، وَمَعْرِفَتِكَ وَرَهْبَتِكَ، وَالرَّغْبَةِ فِيمَا عِنْدَكَ، وَالأَمْنَ وَالعَافِيَةَ، وَاعْطِفْ عَلَيْنَا بِالرَّحْمَةِ وَالبَرَكَةِ مِنْكَ، وَأَلْهِمْنَا الصَّوَابَ وَالحِكْمَةَ، فَنَسْأَلُكَاللَّهُمَّ عِلْمَ الخَائِفِينَ، وَإِنَابَةَ المُخْبِتِينَ، وَإِخْلَاصَ المُوقِنِينَ، وَشُكْرَ الصَّابِرِينَ، وَتَوْبَةَ الصِّدِّيقِينَ.",
        "transcript": "Fa asʾalukaLlāhummaan tamḥū min qalbī kulli shayʾin takrahuhu, wa an taḥshuwa qalbi min khashyatika, wa maʿrifatika wa rahbatika, war raghbata fīmā ʿindaka, wal amna wal ʿāfiyata, waʿṭif ʿalaynā bir raḥmati wal barakati minka, wa alhimnaṣ ṣawāba wal ḥikmata, fanasʾalukAllāhummaʿilmal khāʾifīna, wa inābatal mukhbitīna, wa ikhlaṣ almūqinīna, wa shukraṣ ṣābirīna, wa tawbataṣ ṣiddīqīn.",
        "translate": "So I ask You,O Allah, to efface everything You dislike from my heart and to fill my heart with fear of You, ma'rifa of You, dread of You, desire for what is with You, as well as security and well-being. Incline to us with Your mercy and barakah, and inspire us with right action and wisdom.O Allah, we ask You for the knowledge of the fearful, the repentance of the humble, the sincerity of the certain, gratitude of the patient, and the repentance of the truthful.",
        "isbookmarked": "false"
    },
    {
        "num": "13",
        "arabic_dua": "وَنَسْأَلُكَاللَّهُمَّ بِنُورِ وَجْهِكَ الَّذِي مَلَأَ أَرْكَانَ عَرْشِكَ، أَنْ تَزْرَعَ فِي قَلْبِي مَعْرِفَتَكَ حَتَّى أَعْرِفَكَ حَقَّ مَعْرِفَتِكَ، كَمَا يَنْبَغِي أَنْ تُعْرَفَ بِهِ، وَصَلَّى اللَّهُ عَلَى سَيِّدِنَا مُحَمَّدٍ خَاتَمِ النَّبِيِّينَ، وَإِمَامِ المُرْسَلِينَ، وَعَلَى آلِهِ وَصَحْبهِ وَسَلَّمَ تَسْلِیمًا، وَالحَمْدُ لِلَّهِ رَبِّ العَالَمِینَ.",
        "transcript": "Wa nasʾalukAllāhummabinūri wajhikalladhī malaʾa arkāna ʿarshika, an tazraʿa fī qalbī maʿrifataka ḥattā aʿrifaka ḥaqqa maʿrifataka, kamā yanbaghi an tuʿrafa bihi, wa ṣallAllāhu ʿalā sayyidinā Muḥammadin khātamin nabiyyīna, wa imāmil mursalīna, wa ʿalā ālihi wa ṣaḥbihi wa sallama taslīman, walḥamdu liLlahi rabbil ʿālamīn.",
        "translate": "O Allah, we ask You by the light of Your face which fills the corners of Your Throne, to cultivate ma'rifa of You in my heart until I know You with ma'rifa, as one should know You. And may Allah bless Sayyidina Muhammad, the Seal of the Prophets, the Imam of the Messengers, and his family and companions and grant them peace. Praise be to Allah, the Lord of the Worlds.",
        "isbookmarked": "false"
    }
]
