[
    {
        "num": "1",
        "arabic_dua": "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ عَبْدِكَ وَرَسُولِكَ النَّبِيِّ الأُمِّيِّ وَعَلَى آلِ سَيِّدِنَا مُحَمَّدٍ.",
        "transcript": "Allāhummaṣalli ʿalā sayyidinā Muḥammadin ʿabdika wa rasūlikan nabiyyil ummiyyi wa ʿalā āli sayyidinā Muḥammad.",
        "translate": "O Allah, bless Sayyidina Muhammad, Your slave and Messenger, the Unlettered Prophet, and the family of Sayyidina Muhammad.",
        "isbookmarked": "false"
    },
    {
        "num": "2",
        "arabic_dua": "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلَى آلِ سَيِّدِنَا مُحَمَّدٍ صَلَاةً تَكُونُ لَكَ رِضَاءً، وَلَهُ جَزَاءً، وَلِحَقِّهِ أَدَاءً، وَأَعْطِهِ الوَسِيلَةَ وَالفَضِيلَةَ، وَالمَقَامَ المَحْمُودَ الَّذِي وَعَدْتَهُ، وَاجْزِهِ عَنَّا مَا هُوَ أَهْلُهُ، وَاجْزِهِ أَفْضَلَ مَا جَازَيْتَ نَبِيًّا عَنْ قَوْمِهِ، وَرَسُولًا عَنْ أُمَّتِهِ، وَصَلِّ عَلَى جَمِيعِ إِخْوَانِهِ مِنَ النَّبِيِّينَ وَالصَّالِحِينَ، يَا أَرْحَمَ الرَّاحِمِينَ.",
        "transcript": "Allāhummaṣalli ʿalā sayyidinā Muḥammadin wa ʿalā āli sayyidinā Muḥammadin ṣalātan takūnu laka riḍāʾan, wa lahu jazāʾan, wa liḥaqihi adaʾan, wa aʿṭihil wasīlata wal faḍīlata, wal maqāmal maḥmūd alladhī waʿadtahu wajzihi ʿannā mā huwa ahluhu, wajzihi afḍala mā jāzayta nabiyyan ʿan qawmihi wa rasūlan ʿan ummatihi, wa ṣalli ʿalā jamīʿi ikhwānihi minan nabiyyīna waṣ ṣalliḥīna, ya arḥamar raḥimīn.",
        "translate": "O Allah, bless Sayyidina Muhammad and the family of Sayyidina Muhammad with a blessing that is pleasing to You, a reward for him and a right due to him. And give him the means of mediation, excellence and the Praiseworthy Station that You promised him. Reward him from us with what he deserves and reward him with the best of what You reward a Prophet from his people, and a Messenger from his community. And bless all his brothers from the Prophets and the righteous, O Most Merciful of the Merciful.",
        "isbookmarked": "false"
    },
    {
        "num": "3",
        "arabic_dua": "اللَّهُمَّ اجْعَلْ فَضَائِلَ صَلَوَاتِكَ، وَشَرَائِفَ زَكَوَاتِكَ، وَنَوَامِيَ بَرَكَاتِكَ، وَعَوَاطِفَ رَأْفَتِكَ، وَرَحْمَتِكَ وَتَحِيَّتِكَ، وَفَضَائِلَ آلَائِكَ عَلَى سَيِّدِنَا مُحَمَّدٍ سَيِّدِ المُرْسَلِينَ، وَرَسُولِ رَبِّ العَالَمِينَ، قَائِدِ الخَيْرِ، وَفَاتِحِ البِرِّ، وَنَبِيِّ الرَّحْمَةِ، وَسَيِّدِ الأُمَّةِ.",
        "transcript": "Allāhummajʿal faḍāʾila ṣalawātika wa sharāʾifa zakawātika, wa nawāmiya barakātika, wa ʿawāṭifa raʾfatika, wa raḥmatika wa taḥiyyatika, wa faḍāʾila ālāʾika ʿalā sayyidinā Muḥammadin sayyidil mursalīn, wa rasūli rabbil ʿālamīn, qāʾidil khayri, wa fātiḥil birri, wa nabiyyir raḥmati, wa sayyidil ummah.",
        "translate": "O Allah, give the virtues of Your blessings, the honour of Your pure greetings, the increase of Your barakah, the affection of Your compassion, Your mercy, Your greetings, and the favours of Your blessings upon Sayyidina Muhammad, the Master of the Messengers, and the Messenger of the Lord of the Worlds, the Leader to good, the Opener of piety, the Prophet of Mercy, and the Master of the Ummah.",
        "isbookmarked": "false"
    },
    {
        "num": "4",
        "arabic_dua": "اللَّهُمَّ ابْعَثْهُ مَقَامًا مَحْمُودًا تُزْلِفُ بِهِ قُرْبَهُ، وَتُقِرُّ بِهِ عَيْنَهُ، يَغْبِطُهُ بِهِ الأَوَّلُونَ وَالآخِرُونَ.",
        "transcript": "Allāhummaabʿath-hu maqāman maḥmūdan tuzlifu bihi qurbahu, wa tuqirru bihi ʿaynahu, yaghbiṭuhu bihil awwalūna wal ākhirūn.",
        "translate": "O Allah, raise him to a praiseworthy station, thereby bringing him near and delighting him with that which the first and last delight.",
        "isbookmarked": "false"
    },
    {
        "num": "5",
        "arabic_dua": "اللَّهُمَّ أَعْطِهِ الفَضْلَ وَالفَضِيلَةَ، وَالشَّرَفَ وَالوَسِيلَةَ، وَالدَّرَجَةَ الرَّفِيعَةَ، وَالمَنْزِلَةَ الشَّامِخَةَ.",
        "transcript": "Allāhummaaʿṭihil faḍla walfaḍīlata, wash sharafa wal wasīlata, wad darajatar rafīʿata, wal manzilatash shāmikhah.",
        "translate": "O Allah, give him favour, excellence, honour, the means of mediation, the raised station, and the lofty standing.",
        "isbookmarked": "false"
    },
    {
        "num": "6",
        "arabic_dua": "اللَّهُمَّ أَعْطِ سَيِّدَنَا مُحَمَّدًا الوَسِيلَةَ، وَبَلِّغْهُ مَأْمُولَهُ، وَاجْعَلْهُ أَوَّلَ شَافِعٍ، وَأَوَّلَ مُشَفَّعٍ.",
        "transcript": "Allāhummaaʿṭi sayyidana Muḥammadanal wasīlata, wa balligh-hu maʾmūlahu, wajʿalhu awwala shafīʿin wa awwala mushaffaʿ.",
        "translate": "O Allah, give Sayyidina Muhammad the means of mediation, give him what he hopes for, and make him the first intercessor and the first whose intercession is accepted.",
        "isbookmarked": "false"
    },
    {
        "num": "7",
        "arabic_dua": "اللَّهُمَّ عَظِّمْ بُرْهَانَهُ، وَثَقِّلْ مِيزَانَهُ، وَأَبْلِجْ حُجَّتَهُ، وَارْفَعْ فِي أَهْلِ عِلِّيِّينَ دَرَجَتَهُ، وَفِي أَعْلَى المُقَرَّبِينَ مَنْزِلَتَهُ.",
        "transcript": "Allāhummaʿaẓẓim burhānahu, wa thaqqil mīzānahu, wa ablij ḥujjatahu, warfaʿ fī ʿilliyyīna darajatahu, wa fī aʿlal muqarrabīna manzilatahu.",
        "translate": "O Allah, exalt his proof, make his scale heavy, make his argument shine, and raise his degree among the people of 'Illiyun, and make his rank among the highest of those drawn near [to Allah].",
        "isbookmarked": "false"
    },
    {
        "num": "8",
        "arabic_dua": "اللَّهُمَّ أَحْيِنَا عَلَى سُنَّتِهِ، وَتَوَفَّنَا عَلَى مِلَّتِهِ، وَاجْعَلْنَا مِنْ أَهْلِ شَفَاعَتِهِ، وَاحْشُرْنَا فِي زُمْرَتِهِ، وَأَوْرِدْنَا حَوْضَهُ، وَاسْقِنَا مِنْ كَأْسِهِ، غَيْرَ خَزَايَا وَلَا نَادِمِينَ وَلَا شَاكِّينَ، وَلَا مُبَدِّلِينَ وَلَا مُغَيِّرِينَ، وَلَا فَاتِنِينَ وَلَا مَفْتُونِينَ، آمِينَ يَا رَبَّ العَالَمِينَ.",
        "transcript": "Allāhummaaḥyina ʿalā sunatihi, wa tawaffanā ʿalā millatihi, wajʿalnā min ahli shafāʿatihi, waḥshurnā fī zumratihi, wa awridnā ḥawḍahu, wasqinā min kaʾsihi, ghayra khazāyā, wa lā nādimīna wa lā shākkīna, wa lā mubaddilīna wa lā mughayyirīna, wa lā fātinīna, wa lā maftunīna, āmīna yā rabbal ʿālamīn.",
        "translate": "O Allah, make us live according to his sunnah and let us pass away following his religion. Make us from the people for whom he intercedes, gather us in his party, let us assemble at his wellspring, and let us drink from his goblet without shame, remorse, doubt or temptations. Ameen. O Lord of the Worlds.",
        "isbookmarked": "false"
    },
    {
        "num": "9",
        "arabic_dua": "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلَى آلِ سَيِّدِنَا مُحَمَّدٍ وَأَعْطِهِ الوَسِيلَةَ وَالفَضِيلَةَ، وَالدَّرَجَةَ الرَّفِيعَةَ، وَابْعَثْهُ المَقَامَ المَحْمُودَ الَّذِي وَعَدْتَهُ مَعَ إِخْوَانِهِ النَّبِيِّينَ، وَصَلَّى اللَّهُ عَلَى سَيِّدِنَا مُحَمَّدٍ نَبِيِّ الرَّحْمَةِ، وَسَيِّدِ الأُمَّةِ، وَعَلَى أَبِينَا سَيِّدِنَا آدَمَ وَأُمِّنَا سَيِّدَتِنَا حَوَّاءَ، وَمَنْ وَلَدَا مِنَ النَّبِيِّينَ وَالصِّدِّيقِينَ وَالشُّهَدَاءِ وَالصَّالِحِينَ، وَصَلِّ عَلَى مَلَائِكَتِكَ أَجْمَعِينَ، مِنْ أَهْلِ السَّمَوَاتِ وَالأَرْضِينَ، وَعَلَيْنَا مَعَهُمْ يَا أَرْحَمَ الرَّاحِمِينَ.",
        "transcript": "Allāhummaṣalli ʿalā sayyidinā Muḥammadin wa ʿalā āli sayyidinā Muḥammadin wa aʿṭihil wasīlata wal faḍīlata, waddarajatar rafīʿata, wabʿath-hul maqāmal maḥmūdalladhi wa ʿadtahu maʿa ikhwānihin nabiyyīn, wa ṣallAllahu ʿalā sayyidinā Muḥammadin nabiyyir raḥmati, wa sayyidil ummati, wa ʿalā abīnā sayyidinā Ādama wa umminā sayyidatinā Hawwāʾa, wa man waladā minan nabiyyīna waṣ ṣiddiqīna wash shuhadāʾi waṣ ṣaliḥīna, wa ṣalli ʿalā malāʾikatika ajmaʿīna, min ahli samawāti wal arḍīna, wa ʿalaynā maʿahum yā arḥamar raḥimīn.",
        "translate": "O Allah, bless Sayyidina Muhammad and give him the means of mediation, excellence, and high degree. And raise him up to the Praiseworthy Station that You promised him with his brothers, the Prophets. May Allah bless Sayyidina Muhammad, the Prophet of Mercy and the Master of the Community, and our father Adam and our mother Hawwa', and the descendants among the Prophets, the truthful ones, the martyrs and the righteous. And bless all Your angels amongst those of the heavens and the earths, and bless us together with them, O Most Merciful of the Merciful.",
        "isbookmarked": "false"
    },
    {
        "num": "10",
        "arabic_dua": "اللَّهُمَّ اغْفِرْ لِي ذُنُوبِي وَلِوَالِدَيَّ وَارْحَمْهُمَا كَمَا رَبَّيَانِي صَغِيرًا، وَلِجَمِيعِ المُؤْمِنِينَ وَالمُؤْمِنَاتِ، وَالمُسْلِمِينَ وَالمُسْلِمَاتِ، الأَحْيَاءِ مِنْهُمْ وَالأَمْوَاتِ، وَتَابِعْ بَيْنَنَا وَبَيْنَهُمْ بِالخَيْرَاتِ. ﴿رَّبِّ اغْفِرْ وَارْحَمْ وَأَنتَ خَيْرُ الرَّٰحِمِينَ﴾، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا باللَّهِ العَلِيِّ العَظِيمِ.",
        "transcript": "Allāhummaaghfirlī dhunūbī wa liwālidayya warhamhumā kamā rabbayanī ṣaghīrā, wa lijamīʿil muʾminīna walmuʾmināti, wal muslimīna wal muslimātil ʾahyaʾi minhum wal ʾamwāt, wa tābiʿ baynanā wa baynahum bil khayrāt, rabbighfir warḥam wa anta khayrur rāhimīn, wa lā hawlā wa lā quwwata illā biLlāhil ʿaliyyīl ʿazīm.",
        "translate": "O Allah, forgive my sins, forgive my parents, and show mercy to them as they cherished me in my childhood. And forgive all the believing men and women, and all the Muslim men and women, living and passed. And make blessings accompany us and them, O Lord. Forgive and show mercy for You are the best of the Merciful, and there is no strength nor power save with Allah, the High, the Great.",
        "isbookmarked": "false"
    },
    {
        "num": "11",
        "arabic_dua": "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ نُورِ الأَنْوَارِ، وَسِرِّ الأَسْرَارِ، وَسَيِّدِ الأَبْرَارِ، وَزَيْنِ المُرْسَلِينَ الأَخْيَارِ، وَأَكْرَمِ مَنْ أَظْلَمَ عَلَيْهِ اللَّيْلُ وَأَشْرَقَ عَلَيْهِ النَّهَارُ، عَدَدَ مَا نَزَلَ مِنْ أَوَّلِ الدُّنْيَا إِلَى آخِرِهَا مِنْ قَطْرِ الأَمْطَارِ، وَعَدَدَ مَا نَبَتَ مِنْ أَوَّلِ الدُّنْيَا إِلَى آخِرِهَا مِنَ النَّبَاتِ وَالأَشْجَارِ، صَلَاةً دَائِمَةً بِدَوَامِ مُلْكِ اللَّهِ الوَاحِدِ القَهَّارِ.",
        "transcript": "Allāhummaṣalli ʿalā sayyidinā Muḥammadin, nūril anwāri, wa sirril asrāri, wa sayyidil abrāri, wa zaynil mursalīnal akhyāri, wa akrami man aẓlama ʿalayhil laylu wa ashraqa ʿalayhin nahāru, wa ʿadada mā nazala min awwalid dunyā ilā ākhiriha min qaṭril amṭāri, wa ʿadada mā nabata min awwalid dunyā ilā ākhirihā minan nabāti wal ashjāri, ṣalātan daʾimatan bidawāmi mulkiLlāhil wāḥidil qahhār.",
        "translate": "O Allah, bless Sayyidina Muhammad, the light of lights, the mystery of mysteries, the master of the pious, the adornment of the best messengers, the noblest of whomever the night has cloaked and the day has bathed in light. [Bless him] in quantity as great as the drops of rain which descend from the beginning of this world to its end. [Bless him] in quantity as great as the plants and trees which grow from the beginning of this world to its end, with a blessing that is constant, lasting as long as the Kingdom of Allah, the One, the Victorious.",
        "isbookmarked": "false"
    },
    {
        "num": "12",
        "arabic_dua": "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ صَلَاةً تُكْرِمُ بِهَا مَثْوَاهُ، وَتُشَرِّفُ بِهَا عُقْبَاهُ، وَتُبَلِّغُ بِهَا يَوْمَ القِيَامَةِ مُنَاهُ وَرِضَاهُ، هَذِهِ الصَّلَاةُ تَعْظِيمًا لِحَقِّكَ يَا سَيِّدَنَا مُحَمَّدُ (3)",
        "transcript": "Allāhummaṣalli ʿalā sayyidinā Muḥammadin ṣalātan tukrimu bihā mathwāhu, wa tusharrifu bihā ʿuqbāhu, wa tuballighu bihā yawmal qiyāmati munāhu wa riḍāhu, hādhihiṣ ṣalātu taʿẓīman liḥaqqika yā sayyidanā Muḥammad (3).",
        "translate": "O Allah, bless Sayyidina Muhammad with a blessing by which You ennoble his resting place and honour his end, and by it You give him what he desires and what pleases him on the Day of Resurrection. This prayer exalts what is your due, O Sayyidina Muhammad. (3 times)",
        "isbookmarked": "false"
    },
    {
        "num": "13",
        "arabic_dua": "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ حَاءِ الرَّحْمَةِ، وَمِيمَيِ المُلْكِ، وَدَالِ الدَّوَامِ، السَّيِّدِ الكَامِلِ، الفَاتِحِ الخَاتِمِ، عَدَدَ مَا فِي عِلْمِكَ كَائِنٌ أَوْ قَدْ كَانَ، كُلَّمَا ذَكَرَكَ وَذَكَرَهُ الذَّاكِرُونَ، وَكُلَّمَا غَفَلَ عَنْ ذِكْرِكَ وَذِكْرِهِ الغَافِلُونَ، صَلَاةً دَائِمَةً بِدَوَامِكَ، بَاقِيَةً بِبَقَائِكَ، لَا مُنْتَهَى لَهَا دُونَ عِلْمِكَ، إِنَّكَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ (3)",
        "transcript": "Allāhummaṣalli ʿalā sayyidinā Muḥammadin ḥāʾir raḥmati, wa mīmayil mulki, wa dālid dawāmis sayyidil kāmilil fātiḥil khātimi, ʿadada mā fī ʿilmika kāʾinun ʾaw qad kān, klullamā dhakaraka wa dhakarahudh dhākirūna, wa kullamā ghafala ʿan dhikrika wa dhikrihil ghāfīlūna, ṣalātan dāʾimatan bidawāmika, bāqiyatan bibaqāʾika, lā muntahā lahā dūna ʿilmika, innaka ʿalā kulli shayʾin qadīr.",
        "translate": "O Allah, bless Sayyidina Muhammad the Ha'(ح) of Mercy, the two Meems (م) of the Kingdom and the Dal (د) of perpetuity, the perfect master, the opener, the seal, in quantity as great as that which is in your knowledge, of what is or what was, whenever the people of rememberance remember You and remember him; and whenever the heedless neglect You and neglect him, with a constant prayer, lasting as long as You, remaining as long as You remain, without end, as only You know, for You have power over all things. (3 times)",
        "isbookmarked": "false"
    },
    {
        "num": "14",
        "arabic_dua": "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ النَّبِيِّ الأُمِّيِّ وَعَلَى آلِ سَيِّدِنَا مُحَمَّدٍ الَّذِي هُوَ أَبْهَى شُمُوسِ الهُدَى نُورًا وَأَبْهَرُهَا، وَأَسْيَرُ الأَنْبِيَاءِ فَخْرًا وَأَشْهَرُهَا، وَنُورُهُ أَزْهَرُ أَنْوَارِ الأَنْبِيَاءِ وَأَشْرَفُهَا وَأَوْضَحُهَا، وَأَزْكَى الخَلِيقَةِ أَخْلَاقًا وَأَطْهَرُهَا، وَأَكْرَمُهَا خَلْقًا وَأَعْدَلُهَا.",
        "transcript": "Allāhummaṣalli ʿalā sayyidinā Muḥammadinin nabiyyil ummiyyi wa ʿalā āli sayyidinā Muḥammadinilladhi huwa abhā shumūsil hudā nūran wa abharuhā, wa asyarul anbiyāʾi fakhran wa ash-haruhā, wa nūruhu azharu anwāril anbiyāʾi wa ashrafuhā wa awḍaḥuhā, wa azkal khalīqati akhlāqan wa aṭ-haruhā, wa akramuhā khalqan wa aʿdaluhā.",
        "translate": "O Allah, bless Sayyidina Muhammad, the Unlettered Prophet, and the family of Sayyidina Muhammad whose light is the most beautiful and most dazzling of all the suns of guidance. And whose conduct and glory are the best and most renowned of all the Prophets. His light is the most splendid, brightest and clearest of the lights of the Prophets, and he is the purest and most immaculate of creation in character, and the noblest and most just of creation.",
        "isbookmarked": "false"
    },
    {
        "num": "15",
        "arabic_dua": "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ النَّبِيِّ الأُمِّيِّ وَعَلَى آلِ سَيِّدِنَا مُحَمَّدٍ الَّذِي هُوَ أَبْهَى مِنَ القَمَرِ التَّامِّ، وَأَكْرَمُ مِنَ السَّحَابِ المُرْسَلَةِ وَالبَحْرِ الخِضَمِّ.",
        "transcript": "Allāhummaṣalli ʿalā sayyidinā Muḥammadin nabiyyil ummiyyi wa ʿalā āli sayyidinā Muḥammadin alladhi huwa abha minal qamarit tāmmi, wa akramu minas saḥābil mursalati wal baḥril khiḍamm.",
        "translate": "O Allah, bless Sayyidina Muhammad, the Unlettered Prophet and the family of Sayyidina Muhammad who is more splendid than the full moon and more generous than the billowing clouds and the vast seas.",
        "isbookmarked": "false"
    },
    {
        "num": "16",
        "arabic_dua": "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ النَّبِيِّ الأُمِّيِّ وَعَلَى آلِ سَيِّدِنَا مُحَمَّدٍ الَّذِي قُرِنَتِ البَرَكَةُ بِذَاتِهِ وَمُحَيَّاهُ، وَتَعَطَّرَتِ العَوَالِمُ بِطِيبِ ذِكْرِهِ وَرَيَّاهُ.",
        "transcript": "Allāhummaṣalli ʿalā sayyidinā Muḥammadinin nabiyil ummiyyi wa ʿalā āli sayyidinā Muḥammadin alladhi qurinatil barakatu bidhātihi wa muḥayyāhu, wa taʿaṭṭaratil ʿawālimu biṭībi dhikrihi wa rayyāh.",
        "translate": "O Allah, bless Sayyidina Muhammad, the Unlettered Prophet, and the family of Sayyidina Muhammad to whose essence and countenance blessings are joined, and the worlds are scented by the fragrance of his dhikr.",
        "isbookmarked": "false"
    },
    {
        "num": "17",
        "arabic_dua": "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلَى آلِهِ وَسَلِّمْ.",
        "transcript": "Allāhummaṣalli ʿalā sayyidinā Muḥammadin wa ʿalā ālihi wa sallim.",
        "translate": "O Allah, bless Sayyidina Muhammad and the family of Sayyidina Muhammad and grant them peace.",
        "isbookmarked": "false"
    },
    {
        "num": "18",
        "arabic_dua": "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلَى آلِ سَيِّدِنَا مُحَمَّدٍ، وَبَارِكْ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلَى آلِ سَيِّدِنَا مُحَمَّدٍ، وَارْحَمْ سَيِّدَنَا مُحَمَّدًا وَآلَ سَيِّدِنَا مُحَمَّدٍ، كَمَا صَلَّيْتَ وَبَارَكْتَ وَتَرَحَّمْتَ عَلَى سَيِّدِنَا إِبْرَاهِيمَ وَعَلَى آلِ سَيِّدِنَا إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ.",
        "transcript": "Allāhummaṣalli ʿalā sayyidinā Muḥammadin wa ʿalā āli sayyidinā Muḥammadin, wa bārik ʿalā sayyidinā Muḥammadin wa ʿalā āli sayyidinā Muḥammadin, warḥam sayyidanā Muḥammadan wa āli sayyidinā Muḥammadin, kamā ṣallayta wa bārakta wa taraḥḥamta ʿalā sayyidinā Ibrāhīma wa ʿalā āli sayyidinā Ibrāhīma innaka ḥamīdun majīd.",
        "translate": "O Allah, bless Sayyidina Muhammad and the family of Sayyidina Muhammad, and sanctify Sayyidina Muhammad and the family of Sayyidina Muhammad, and show mercy to Sayyidina Muhammad and the family of Sayyidina Muhammad as You blessed, sanctified and showed mercy to Sayyidina Ibrahim and the family of Sayyidina Ibrahim. You are Praiseworthy, Glorious.",
        "isbookmarked": "false"
    },
    {
        "num": "19",
        "arabic_dua": "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ عَبْدِكَ وَنَبِيِّكَ وَرَسُولِكَ النَّبِيِّ الأُمِّيِّ وَعَلَى آلِ سَيِّدِنَا مُحَمَّدٍ.",
        "transcript": "Allāhummaṣalli ʿalā sayyidinā Muḥammadin ʿabdika wa nabiyyīka wa rasūlikan nabiyyil ummiyyi wa ʿalā āli sayyidinā Muḥammad.",
        "translate": "O Allah, bless Sayyidina Muhammad, Your slave, Prophet and Messenger, the Unlettered Prophet, and the family of Sayyidina Muhammad.",
        "isbookmarked": "false"
    },
    {
        "num": "20",
        "arabic_dua": "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلَى آلِ سَيِّدِنَا مُحَمَّدٍ مِلْءَ الدُّنْيَا وَمِلْءَ الآخِرَةِ، وَبَارِكْ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلَى آلِ سَيِّدِنَا مُحَمَّدٍ مِلْءَ الدُّنْيَا وَمِلْءَ الآخِرَةِ، وَارْحَمْ سَيِّدَنَا مُحَمَّدًا وَآلَ سَيِّدِنَا مُحَمَّدٍ مِلْءَ الدُّنْيَا وَمِلْءَ الآخِرَةِ، وَاجْزِ سَيِّدَنَا مُحَمَّدًا وَآلَ سَيِّدِنَا مُحَمَّدٍ مِلْءَ الدُّنْيَا وَمِلْءَ الآخِرَةِ، وَسَلِّمْ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلَى آلِ سَيِّدِنَا مُحَمَّدٍ مِلْءَ الدُّنْيَا وَمِلْءَ الآخِرَةِ.",
        "transcript": "Allāhummaṣalli ʿalā sayyidinā Muḥammadin wa ʿalā āli sayyidinā Muhammadin milʾad dunyā wa milʾal ākhirah, wa bārik ʿalā sayyidinā Muḥammadin wa ʿalā āli sayyidinā Muḥammadin milʾad dunyā wa milʾal ākhirah, warḥam sayyidanā Muḥammadan wa āla sayyidinā Muḥammadin milʾad dunyā wa milʾal ākhirah, wajzi sayyidanā Muḥammadan wa āla sayyidinā Muḥammadin milʾad dunyā wa milʾal ākhirah, wa ṣallim ʿalā sayyidinā Muḥammadin wa ʿalā āli sayyidinā Muḥammadin milʾad dunyā wa milʾal ākhirah.",
        "translate": "O Allah, bless Sayyidina Muhammad and the family of Sayyidina Muhammad [with blessings] that surpass the magnitude of this world and the Next. And sanctify Sayyidina Muhammad and the family of Sayyidina Muhammad [with blessings] that surpass the magnitude of this world and the Next. And show mercy to Sayyidina Muhammad and the family of Sayyidina Muhammad [with mercy] that surpasses the magnitude of this world and the Next. And reward Sayyidina Muhammad and the family of Sayyidina Muhammad [with a reward] that surpasses the magnitude of this world and the Next. And grant peace to Sayyidina Muhammad and the family of Sayyidina Muhammad [with peace] that surpasses the magnitude of this world and the Next.",
        "isbookmarked": "false"
    },
    {
        "num": "21",
        "arabic_dua": "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ كَمَا أَمَرْتَنَا أَنْ نُصَلِّيَ عَلَيْهِ، وَصَلِّ عَلَيْهِ كَمَا يَنْبَغِي أَنْ يُصَلَّى عَلَيْهِ.",
        "transcript": "Allāhummaṣalli ʿalā sayyidinā Muḥammadin kamā amartanā an nuṣalliya ʿalayhi, wa ṣalli ʿalayhi kamā yanbaghi an yuṣalla ʿalayhi.",
        "translate": "O Allah, bless Sayyidina Muhammad as You commanded that we bless him, and bless Sayyidina Muhammad as he must be blessed.",
        "isbookmarked": "false"
    },
    {
        "num": "22",
        "arabic_dua": "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ نَبِيِّكَ المُصْطَفَى، وَرَسُولِكَ المُرْتَضَى، وَوَلِيِّكَ المُجْتَبَى، وَأَمِينِكَ عَلَى وَحْيِ السَّمَاءِ.",
        "transcript": "Allāhummaṣalli ʿalā nabiyyikal muṣṭafā wa rasūlikal murtaḍā wa waliyyikal mujtabā wa amīnika ʿalā waḥyis samāʾi.",
        "translate": "O Allah, bless Your Chosen Prophet, Your approved Messenger, Your chosen wali, and Your guardian of heaven's revelation.",
        "isbookmarked": "false"
    },
    {
        "num": "23",
        "arabic_dua": "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ أَكْرَمِ الأَسْلَافِ، وَالقَائِمِ بِالعَدْلِ وَالإِنْصَافِ، المَنْعُوتِ فِي سُورَةِ الأَعْرَافِ، المُنْتَخَبِ مِنْ أَصْلَابِ الشِّرَافِ، وَالبُطُونِ الظِّرَافِ، المُصَفَّى مِنْ مُصَاصِ عَبْدِ المُطَّلِبِ بْنِ عَبْدِ مَنَافٍ، الَّذِي هَدَيْتَ بِهِ مِنَ الخِلَافِ، وَبَيَّنْتَ بِهِ سَبِيلَ العَفَافِ.",
        "transcript": "Allāhummaṣalli ʿalā sayyidinā Muḥammadin akramil aslāfī, wal qāʾimi bilʿadli wal inṣāfil manʿūti fī suratil aʿrāfī, Al muntakhabi min aṣlābish shirāfī, wal buṭūniẓ ẓirāfīl muṣaffa min muṣāṣi ʿAbdul Muṭṭalibi bni ʿAbdi Manāfīn, alladhi hadayta bihi minal khilāfī, wa bayyanta bihi sabīlal ʿafāf.",
        "translate": "O Allah, bless Sayyidina Muhammad, the noblest of forebearers - establishing justice and equity, the one described in Surat Al-A'raf, the one chosen from noble ancestors and wombs, the one purified from the best of 'Abdu'l-Muttalib ibn 'Abd Manaf, the one whom You guided from conflict and through whom You made clear the path of virtuousness.",
        "isbookmarked": "false"
    },
    {
        "num": "24",
        "arabic_dua": "اللَّهُمَّإِنِّي أَسْأَلُكَ بِأَفْضَلِ مَسْأَلَتِكَ، وَبِأَحَبِّ أَسْمَائِكَ إِلَيْكَ، وَأَكْرَمِهَا عَلَيْكَ، وَبِمَا مَنَنْتَ عَلَيْنَا بِسَيِّدِنَا مُحَمَّدٍ نَبِيِّنَا صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ، فَاسْتَنْقَذْتَنَا بِهِ مِنَ الضَّلَالَةِ، وَأَمَرْتَنَا بِالصَّلَاةِ عَلَيْهِ، وَجَعَلْتَ صَلَاتَنَا عَلَيْهِ دَرَجَةً وَكَفَّارَةً وَلُطْفًا وَمَنًّا مِنْ إِعْطَائِكَ، فَأَدْعُوكَ تَعْظِيمًا لِأَمْرِكَ، وَاتِّبَاعًا لِوَصِيَّتِكَ، وَمُنْتَجِزًا لِمَوْعُودِكَ، لِمَا يَجِبُ لِنَبِيِّنَا سَيِّدِنَا مُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ فِي أَدَاءِ حَقِّهِ قِبَلَنَا، إِذْ آمَنَّا بِهِ وَصَدَّقْنَاهُ، وَاتَّبَعْنَا النُّورَ الَّذِي أُنْزِلَ مَعَهُ، وَقُلْتَ وَقَوْلُكَ الحَقُّ:﴿إِنَّ اللَّهَ وَمَلَـٰٓئِكَتَهُۥ يُصَلُّونَ عَلَى النَّبِىِّ ۚ يَـٰٓأَيُّهَا الَّذِينَ ءَامَنُواْ صَلُّواْ عَلَيْهِ وَسَلِّمُواْ تَسْلِيمًا﴾، وَأَمَرْتَ العِبَادَ بِالصَّلَاةِ عَلَى نَبِيِّهِمْ، فَرِيضَةً افْتَرَضْتَهَا وَأَمَرْتَهُمْ بِهَا، فَنَسْأَلُكَ بِجَلَالِ وَجْهِكَ، وَنُورِ عَظَمَتِكَ، وَبِمَا أَوْجَبْتَ عَلَى نَفْسِكَ، أَنْ تُصَلِّيَ أَنْتَ وَمَلَائِكَتُكَ عَلَى سَيِّدِنَا مُحَمَّدٍ عَبْدِكَ وَرَسُولِكَ، وَنَبِيِّكَ وَصَفِيِّكَ، وَخِيرَتِكَ مِنْ خَلْقِكَ، أَفْضَلَ مَا صَلَّيْتَ عَلَى أَحَدٍ مِنْ خَلْقِكَ إِنَّكَ حَمِيدٌ مَجِيدٌ.",
        "transcript": "Allāhummainni asʾaluka bi afḍali masʾalatika, wa bi aḥabbi asmāʾika ilayka, wa akramihā ʿalayka wa bimā mananta ʿalaynā bisayyidinā Muḥammadin nabiyyinā ṣallAllāhu ʿalayhi wa ṣallama, fastanqadhtanā bihi minaḍ ḍalālati, wa amartanā biṣṣalāti ʿalayhi, wa jaʿalta ṣalātana ʿalayhi darajatan wa kaffāratan wa luṭfan wa mannan min iʿṭāʾika, faʾadʿūka taʿẓīman liʾamrika, wattibāʾan li waṣiyyatika, wa muntajizan li mawʿūdika, limā yajibu linabiyyinā sayyidinā Muḥammadin ṣallAllāhu ʿalayhi wa ṣallama fī adāʾi ḥaqqihi qibalanā, idh āmannā bihi wa ṣaddaqnāhu, wattabaʿnan nūralladhi unzila maʿahu, wa qulta waqawlukal ḥaqq: inAllāha wa malāʾikatahu yuṣallūna ʿalan nabiyyi yā ayyuhalladhīna āmanū ṣallū ʿalayhi wa ṣallimū taslīma. Wa amartal ʿibāda biṣṣalati ʿalā nabiyyihim, fariḍatan iftaraḍtahā wa amartahum bihā, fanasʾaluka bijalāli wajhika, wa nūri ʿaẓamatika, wa bimā awjabta ʿalā nafsika, an tuṣalli anta wa malāʾikatuka ʿalā sayyidinā Muḥammadin ʿabdika wa rasūlika, wa nabiyyika wa ṣafīyyika, wa khīratika min khalqika, afḍala mā ṣallayta ʿalā aḥadin min khalqika innaka ḥamīdun majīd.",
        "translate": "O Allah, I ask of You by the best of what is asked of You, by the most beloved of Your Names and the noblest to You, and by what You have bestowed on us by Sayyidina Muhammad, Your Prophet sallAllahu alayhi wasallam so that by him You have saved us from going astray. You ordered us to bless him and made our prayer on him a degree, expiation, kindness, and a gift from You. I call on You, respecting Your command, following Your order, and fulfilling what You promised - as is necessary for our Prophet sallAllahu alayhi wasallam, in performance of what is due to him from us since we have believed in him and affirmed him, and we followed the light which descended with him. You said – and Your word is true, \"Allah and His angels call down blessings on the Prophet. O you who believe! Call down blessings on him and ask for complete peace and safety for him.\" (Quran 33:56) You ordered the slaves to bless their Prophet as a commandment. We ask You by the glory of Your face and the light of Your sublimity and by what You oblige on Yourself for those who do good, that You and Your angels bless Sayyidina Muhammad, Your slave, Messenger and Prophet, sincere friend, and the pinnacle of Your creation, with the best of what You have blessed anyone of Your creation. You are Praiseworthy, Glorious.",
        "isbookmarked": "false"
    },
    {
        "num": "25",
        "arabic_dua": "اللَّهُمَّ ارْفَعْ دَرَجَتَهُ وَأَكْرِمْ مَقَامَهُ، وَثَقِّلْ مِيزَانَهُ، وَأَبْلِجْ حُجَّتَهُ، وَأَظْهِرْ مِلَّتَهُ، وَأَجْزِلْ ثَوَابَهُ، وَأَضِئْ نُورَهُ، وَأَدِمْ كَرَامَتَهُ، وَأَلْحِقْ بِهِ مِنْ ذُرِّيَّتِهِ وَأَهْلِ بَيْتِهِ مَا تُقِرُّ بِهِ عَيْنَهُ، وَعَظِّمْهُ فِي النَّبِيِّينَ الَّذِينَ خَلَوْا قَبْلَهُ.",
        "transcript": "Allāhummaarfaʿ darajatahu wa akrim maqāmahu, wa thaqqil mīzānahu wa ablij ḥujatahu, wa aẓhir millatahu, wa ajzil thawabahu, wa āḍiʾ nūrahu, wa adim karāmatahu, wa alḥiq bihi min dhurriyyatihi wa ahli baytihi mā tuqirru bihi ʿaynahu, wa ʿaẓẓimhu fīn nabiyyīnalladhīna khalaw qablahu.",
        "translate": "O Allah, raise his rank, ennoble his station, increase his scale, make his proof radiant, make his religion triumph, give him abundant reward, make his light shine, make his honour endure, unite him with his descendants and the People of his House with what delights him, and exalt him among the Prophets who have gone before him.",
        "isbookmarked": "false"
    },
    {
        "num": "26",
        "arabic_dua": "اللَّهُمَّ اجْعَلْ سَيِّدَنَا مُحَمَّدًا أَكْثَرَ النَّبِيِّينَ تَبَعًا، وَأَكْثَرَهُمْ أُزَرَاءَ، وَأَفْضَلَهُمْ كَرَامَةً وَنُورًا، وَأَعْلَاهُمْ دَرَجَةً، وَأَفْسَحَهُمْ فِي الجَنَّةِ مَنْزِلًا.",
        "transcript": "Allāhummajʿal sayyidanā Muḥammadan aktharan nabiyyīna tabaʿan, wa aktharahum uzarāʾa, wa afḍalahum karāmatan wa nūran, wa aʿlāhum darajatan, wa afsaḥahum fīljannati manzila.",
        "translate": "O Allah, make Sayyidina Muhammad the Prophet with the most followers, the greatest strength, the best nobility and the most radiant, the highest in rank, and the one with the most spacious abode in the Garden.",
        "isbookmarked": "false"
    },
    {
        "num": "27",
        "arabic_dua": "اللَّهُمَّ اجْعَلْ فِي السَّابِقِينَ غَايَتَهُ، وَفِي المُنْتَخَبِينَ مَنْزِلَتَهُ، وَفِي المُقَرَّبِينَ دَارَهُ، وَفِي المُصْطَفَينَ مَنْزِلَهُ.",
        "transcript": "Allāhummajʿal fīs sābiqīna ghāyatahu, wa fīl muntakhabīna manzilahu, wa fīl muqarrabīna dārahu, wa fīl muṣṭafayni manzilahu.",
        "translate": "O Allah, make his end be among the forerunners, his degree among the chosen, his abode among those brought near [to Allah], and his position among the elect.",
        "isbookmarked": "false"
    },
    {
        "num": "28",
        "arabic_dua": "اللَّهُمَّ اجْعَلْهُ أَكْرَمَ الأَكْرَمِينَ عِنْدَكَ مَنْزِلًا، وَأَفْضَلَهُمْ ثَوَابًا، وَأَقْرَبَهُمْ مَجْلِسًا، وَأَثْبَتَهُمْ مَقَامًا، وَأَصْوَبَهُمْ كَلَامًا، وَأَنْجَحَهُمْ مَسْأَلَةً، وَأَفْضَلَهُمْ لَدَيْكَ نَصِيبًا، وَأَعْظَمَهُمْ فِيمَا عِنْدَكَ رَغْبَةً، وَأَنْزِلْهُ فِي غُرُفَاتِ الفِرْدَوْسِ مِنَ الدَّرَجَاتِ العُلَى الَّتِي لَا دَرَجَةَ فَوْقَهَا.",
        "transcript": "Allāhummajʿalhu akramal akramīna ʿindaka manzilan, wa afḍalahum thawāban, wa aqrabahum majlisan, wa athbatahum maqāman, wa aṣwabahum kalāman, wa anjaḥahum masʾalatan, wa afḍalahum ladayka naṣīban, wa aʿẓamahum fīmā ʿindaka raghbatan, wa anzilhu fī ghurufātil firdawsi minad darajātil ʿulā allati lā darajata fawqahā.",
        "translate": "O Allah, make him the noblest of the noble in position with You, the best in reward, the nearest in assembly, the most confirmed in station, the truest in speech, the most successful in request, the best in portion with You, and the one who longs for You the most, and place him in the chambers of Paradise in the high ranks above which there is no higher rank.",
        "isbookmarked": "false"
    },
    {
        "num": "29",
        "arabic_dua": "اللَّهُمَّ اجْعَلْ سَيِّدَنَا مُحَمَّدًا أَصْدَقَ قَائِلٍ، وَأَنْجَحَ سَائِلٍ، وَأَوَّلَ شَافِعٍ، وَأَفْضَلَ مُشَفَّعٍ، وَشَفِّعْهُ فِي أُمَّتِهِ بِشَفَاعَةٍ يَغْبِطُهُ بِهَا الأَوَّلُونَ وَالآخِرُونَ، وَإِذَا مَيَّزْتَ عِبَادَكَ بِفَصْلِ قَضَائِكَ، فَاجْعَلْ سَيِّدَنَا مُحَمَّدًا فِي الأَصْدَقِينَ قِيلًا، وَالأَحْسَنِينَ عَمَلًا، وَفِي المَهْدِيِّينَ سَبِيلًا.",
        "transcript": "Allāhummajʿal sayyidanā Muḥammadin aṣdaqa qāʾilin, wa anjaḥa sāʾilin, wa awwala shāfīʿin, wa afḍala mushaffaʿin, wa shaffīʿhu fī ummatihi bishafāʿatin yaghbiṭuhu bihal awwalūna wal akhirūna, wa idha mayyazta ʿibādaka bifaṣli qaḍāʾika, fajʿal sayyidanā Muḥammadan fīl aṣdaqīna qīlan, wal aḥsanīna ʿamalan, wa fīl mahdiyyīna sabīla.",
        "translate": "O Allah, make Sayyidina Muhammad the most truthful in words, the most successful in request, the first in intercession, the most perfect intercessor, and give him intercession for his Ummah - an intercession envied by the first and the last. Since you have distinguished Your slaves by the rendering of Your decree, place Sayyidina Muhammad among the truthful in speech, the doers of good deeds and those who guide to the Path.",
        "isbookmarked": "false"
    },
    {
        "num": "30",
        "arabic_dua": "اللَّهُمَّ اجْعَلْ نَبِيَّنَا لَنَا فَرَطًا، وَاجْعَلْ حَوْضَهُ لَنَا مَوْعِدًا لِأَوَّلِنَا وَآخِرِنَا.",
        "transcript": "Allāhummajʿal nabiyyana lanā faraṭan, wajʿal ḥawḍahu lanā mawʿidan li awwalīna wa ākhirīna.",
        "translate": "O Allah, make our Prophet a forerunner for us (on judgment day), and make his wellspring a rendezvous for the first of us and the last of us.",
        "isbookmarked": "false"
    },
    {
        "num": "31",
        "arabic_dua": "اللَّهُمَّ احْشُرْنَا فِي زُمْرَتِهِ، وَاسْتَعْمِلْنَا بِسُنَّتِهِ، وَتَوَفَّنَا عَلَى مِلَّتِهِ، وَعَرِّفْنَا وَجْهَهُ، وَاجْعَلْنَا فِي زُمْرَتِهِ وَحِزْبِهِ.",
        "transcript": "Allāhummaaḥshurnā fī zumratihi, wastaʿmilnā bi sunnatihi, wa tawaffanā ʿalā millatihi, wa ʿarrifna wajhahu, wajʿalnā fī zumratihi wa ḥizbihi.",
        "translate": "O Allah, gather us in his party, make us act by his sunnah, let us pass away following his religion, acquaint us with his face, and place us in his party and group.",
        "isbookmarked": "false"
    },
    {
        "num": "32",
        "arabic_dua": "اللَّهُمَّاجْمَعْ بَيْنَنَا وَبَيْنَهُ كَمَا آمَنَّا بِهِ وَلَمْ نَرَهُ، وَلَا تُفَرِّقْ بَيْنَنَا وَبَيْنَهُ حَتَّى تُدْخِلَنَا مَدْخَلَهُ، وَتُورِدَنَا حَوْضَهُ وَتَجْعَلَنَا مِنْ رُفَقَائِهِ، مَعَ المُنْعَمِ عَلَيْهِمْ ﴿مِّنَ النَّبِيِّيـنَ وَالصِّدِّيقِينَ وَالشُّهَدَآءِ وَالصَّـٰلِحِينَ ۚ وَحَسُنَ أُوْلَـٰٓئِكَ رَفِيقًا﴾، وَالحَمْدُ للَّهِ رَبِّ العَالَمِينَ.",
        "transcript": "Allāhummajmaʿ baynanā wa baynahu kamā āmanna bihi walam narahu, wa lā tufarriq baynanā wa baynahu ḥatta tudkhilanā madkhalahu, wa tūridanā ḥawḍahu wa tajʿalanā min rufaqāʾihi, maʿal munʿami ʿalayhim minan nabiyyīna waṣ ṣiddiqīna wash shuhadāʾi waṣ ṣāliḥīna wa ḥasuna ulāʾika rafīqan, wal ḥamduliLlāhi rabbil ʿālamīn.",
        "translate": "O Allah, unite us with him as we have believed in him without seeing him. Do not separate us from him so that You make us enter where he enters, let us drink at his wellspring, and make us among his comrades along with those who are blessed among the Prophets, the truthful, the martyrs and the righteous. They are the best companions. Praise be to Allah, Lord of the Worlds.",
        "isbookmarked": "false"
    },
    {
        "num": "33",
        "arabic_dua": "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ نُورِ الهُدَى، وَالقَائِدِ إِلَى الخَيْرِ، وَالدَّاعِي إِلَى الرُّشْدِ، نَبِيِّ الرَّحْمَةِ، وَإِمَامِ المُتَّقِينَ، وَرَسُولِ رَبِّ العَالَمِينَ، لَا نَبِيَّ بَعْدَهُ، كَمَا بَلَّغَ رِسَالَتَكَ، وَنَصَحَ لِعِبَادِكَ، وَتَلَا آيَاتِكَ، وَأَقَامَ حُدُودَكَ، وَوَفَّى بِعَهْدِكَ، وَأَنْفَذَ حُكْمَكَ، وَأَمَرَ بِطَاعَتِكَ، وَنَهَى عَنْ مَعْصِيَتِكَ، وَوَالَى وَلِيَّكَ الَّذِي تُحِبُّ أَنْ تُوَالِيَهُ، وَعَادَى عَدُوَّكَ الَّذِي تُحِبُّ أَنْ تُعَادِيَهُ، وَصَلَّى اللَّهُ عَلَى سَيِّدِنَا مُحَمَّدٍ.",
        "transcript": "Allāhummaṣalli ʿalā sayyidinā Muḥammadin nūril huda, wal qāʾidi ilal khayri, wad daʿi ilār rushdi, nabiyyir raḥmati, wa imāmil muttaqīna, wa rasūli rabbil ʿālamīn, lā nabiyya baʿdahu, kamā ballagha risālataka, wa naṣaḥa li ʿibādika, wa talā āyātika, wa aqāma ḥudūdaka, wa waffā bi ʿahdika, wa anfadha ḥukmaka, wa amara bi ṭāʿatika, wa naha ʿan maʿṣiyatika, wa wālā waliyakalladhi tuḥibu an tuwāliyahu, wa ʿādā ʿaduwwakalladhi tuḥibbu an tuʿādiyahu, wa ṣallAllahu ʿalā sayyidinā Muḥammadin.",
        "translate": "O Allah, bless Sayyidina Muhammad, the light of guidance, the guide to good, the caller to guidance, the Prophet of guidance, the imam of the godfearing and the Messenger of the Lord of the Worlds. There is no Prophet after him as he conveyed Your message, counselled Your slaves, recited Your ayats, established Your hudud, was faithful to Your covenant, carried out Your judgements, commanded obedience to You, forbade disobedience to You, befriended Your friend whom You befriend, and opposed Your enemy whom You opposed, and may Allah bless Sayyidina Muhammad.",
        "isbookmarked": "false"
    },
    {
        "num": "34",
        "arabic_dua": "اللَّهُمَّ صَلِّ عَلَى جَسَدِهِ فِي الأَجْسَادِ، وَعَلَى رُوحِهِ فِي الأَرْوَاحِ، وَعَلَى مَوْقِفِهِ فِي المَوَاقِفِ، وَعَلَى مَشْهَدِهِ فِي المَشَاهِدِ، وَعَلَى ذِكْرِهِ إِذَا ذُكِرَ، صَلَاةً مِنَّا عَلَى نَبِيِّنَا.",
        "transcript": "Allāhummaṣalli ʿalā jasadihi fīl ajsād, wa ʿalā rūḥihi fīl arwāḥ, wa ʿalā mawqifīhi fīl mawāqif, wa ʿalā mashhadihi fīl mashāhidi, wa ʿalā dhikrihi idha dhukira, ṣalātan minnā ʿalā nabiyyina.",
        "translate": "O Allah, bless his body among the bodies, his soul among the souls, his station among the stations, his assembly among the assemblies, and his mention when he is mentioned, with a prayer on our Prophet from us.",
        "isbookmarked": "false"
    },
    {
        "num": "35",
        "arabic_dua": "اللَّهُمَّ أَبْلِغْهُ مِنَّا السَّلَامَ، كَمَا ذُكِرَ السَّلَامُ، وَالسَّلَامُ عَلَى النَّبِيِّ، وَرَحْمَةُ اللَّهِ تَعَالَى وَبَرَكَاتُهُ.",
        "transcript": "Allāhummaablighhu minnās salāma, kamā dhukiras salāmu, was salāmu ʿalannabiyyi, wa raḥmatulLlāhi taʿala wa barakātuhu.",
        "translate": "O Allah, convey our peace to him whenever the greeting of peace is mentioned, and peace be upon the Prophet, and the mercy of Allah Almighty, and His blessings.",
        "isbookmarked": "false"
    },
    {
        "num": "36",
        "arabic_dua": "اللَّهُمَّ صَلِّ عَلَى مَلَائِكَتِكَ المُقَرَّبِينَ، وَعَلَى أَنْبِيَائِكَ المُطَهَّرِينَ، وَعَلَى رُسُلِكَ المُرْسَلِينَ، وَعَلَى حَمَلَةِ عَرْشِكَ، وَعَلَى سَيِّدِنَا جِبْرِيلَ، وَسَيِّدِنَا مِيكَائِيلَ، وَسَيِّدِنَا إِسْرَافِيلَ، وسَيِّدِنَا مَلَكِ المَوْتِ، وَرِضْوَانَ خَازِنِ جَنَّتِكَ، وَسَيِّدِنَا مَالِكٍ، وَصَلِّ عَلَى الكِرَامِ الكَاتِبِينَ، وَصَلِّ عَلَى أَهْلِ طَاعَتِكَ أَجْمَعَينَ، مِنْ أَهْلِ السَّمَوَاتِ وَالأَرَضِينَ.",
        "transcript": "Allāhummaṣalli ʿalā malāʾikatikal muqarrabīn, wa ʿalā anbiyāʾikal muṭahharīna, wa ʿalā rusulikal mursalīn, wa ʿalā ḥamalati ʿarshika, wa ʿalā sayyidinā Jibrīla wa sayyidinā Mīkāʾīla, wa sayyidinā Isrāfīla, wa sayyidinā Malakil mawt, wa sayyidinā Riḍwāna khāzini jannatika, wa sayyidinā Mālik, wa ṣalli ʿalāl kirāmil kātibīna, wa ṣalli ʿalā ahli ṭāʿatika ajmaʿīna, min ahlis samawāti wal araḍīn.",
        "translate": "O Allah, bless Your near angels, Your pure Prophets, Your Messengers, the bearers of Your Throne, and Sayyidina Jibril, Sayyidina Mika'il, Sayyidina Israfil, Sayyidina Malik Al-Mawt, Sayyidina Ridwan, the Guard of Your Garden, and Sayyidina Malik. Bless the noble recording angels and bless all the people who obey You among the people of the heavens and the earths.",
        "isbookmarked": "false"
    },
    {
        "num": "37",
        "arabic_dua": "اللَّهُمَّ آتِ أَهْلَ بَيْتِ نَبِيِّكَ أَفْضَلَ مَا آتَيْتَ أَحَدًا مِنْ أَهْلِ بُيُوتِ المُرْسَلِينَ، وَاجْزِ أَصْحَابَ نَبِيِّكَ أَفْضَلَ مَا جَازَيْتَ أَحَدًا مِنْ أَصْحَابِ المُرْسَلِينَ.",
        "transcript": "Allāhummaāti ahla bayti nabiyyika afḍala mā ātayta aḥadan min ahli buyūtil mursalīn, wajzi aṣ-ḥāba nabiyyika afḍala mā jazayta aḥadan min aṣ-ḥābil mursalīn.",
        "translate": "O Allah, give the people of The House of Your Prophet the best of what You have given any of The People of the Houses of the Messengers, and reward the companions of Your Prophet with the best of what You have rewarded the companions of the Messengers.",
        "isbookmarked": "false"
    },
    {
        "num": "38",
        "arabic_dua": "اللَّهُمَّاغْفِرْ لِلْمُؤْمِنِينَ وَالمُؤْمِنَاتِ، وَالمُسْلِمِينَ وَالمُسْلِمَاتِ، الأَحْيَاءِ مِنْهُمْ وَالأَمْوَاتِ وَ﴿اغْفِرْ لَنَا وَلِإِخْوَٰنِنَا الَّذِينَ سَبَقُونَا بِالْإِيمَـٰنِ وَلَا تَجْعَلْ فِى قُلُوبِنَا غِلًّا لِّلَّذِينَ ءَامَنُواْ رَبَّنَآ إِنَّكَ رَؤُوفٌ رَّحِيمٌ﴾.",
        "transcript": "Allāhummaghfīr lil muʾminīna wal muʾmināti, wal muslimīna wal muslimāti, alʾaḥyāʾi minhum wal amwāti, waghfīrlanā wa li ikhwānalladhīna sabaqūna bil īmani walā tajʿal fī qulūbinā ghillan lilladhīna āmanū. Rabbanā innaka raʾūfun raḥīm.",
        "translate": "O Allah, forgive the believing men and women, and the Muslim men and women, living and passed, and forgive us and our brothers who preceded us in faith, and do not place rancour in our hearts towards those who believe, Our Lord. You are Compassionate, Merciful.",
        "isbookmarked": "false"
    },
    {
        "num": "39",
        "arabic_dua": "اللَّهُمَّ صَلِّ عَلَى النَّبِيِّ الهَاشِمِيِّ سَيِّدِنَا مُحَمَّدٍ وَعَلَى آلِهِ وَصَحْبِهِ وَسَلِّمْ تَسْلِيمًا.",
        "transcript": "Allāhummaṣalli ʿalan nabiyyil hāshimiyyi sayyidinā Muḥammadin wa ʿalā ālihi wa ṣaḥbihi wa ṣallim taslīma.",
        "translate": "O Allah, bless the Hashimi Prophet, Sayyidina Muhammad and his family and companions, and grant them peace.",
        "isbookmarked": "false"
    },
    {
        "num": "40",
        "arabic_dua": "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ خَيْرِ البَرِيَّةِ، صَلَاةً تُرْضِيكَ وَتُرْضِيهِ، وَتَرْضَى بِهَا عَنَّا يَا أَرْحَمَ الرَّاحِمِينَ.",
        "transcript": "Allāhummaṣalli ʿalā sayyidinā Muḥammadin khayril bariyyah, ṣalātan turḍīka wa turḍīhi, wa tarḍa bihā ʿannā yā arḥamar rāḥimīn.",
        "translate": "O Allah, bless Sayyidina Muhammad, the best of creation, with a blessing that pleases You and him, and by which You are pleased with us, O Most Merciful of the Merciful.",
        "isbookmarked": "false"
    },
    {
        "num": "41",
        "arabic_dua": "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلَى آلِهِ وَصَحْبِهِ وَسَلِّمْ تَسْلِيمًا كَثِيرًا، طَيِّبًا مُبَارَكًا فِيهِ، جَزِيلًا جَمِيلًا، دَائِمًا بِدَوَامِ مُلْكِ اللَّهِ.",
        "transcript": "Allāhummaṣalli ʿalā sayyidinā Muḥammadin wa ʿalā ālihi wa ṣaḥbihi wa ṣallim taslīman kathīran, ṭayyiban mubārakan fīhi, jazīlan jamīlan, dāʾiman bidawāmi mulkiLlāh.",
        "translate": "O Allah, bless Sayyidina Muhammad and his family and companions, and grant them much peace - pleasant, blessed, abundant, beautiful, constant, and lasting as long as the Kingdom of Allah.",
        "isbookmarked": "false"
    },
    {
        "num": "42",
        "arabic_dua": "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلَى آلِهِ مِلْءَ الفَضَاءِ، وَعَدَدَ النُّجُومِ فِي السَّمَاءِ، صَلَاةً تُوَازِنُ السَّمَوَاتِ وَالأَرْضَ، وَعَدَدَ مَا خَلَقْتَ وَمَا أَنْتَ خَالِقُهُ إِلَى يَوْمِ القِيَامَةِ.",
        "transcript": "Allāhummaṣalli ʿalā sayyidinā Muḥammadin wa ʿalā ālihi milʾal faḍāʾi, wa ʿadadan nujūmi fīssamāʾi, ṣalātan tuwāzinus samawāti wal arḍa, wa ʿadada mā khalaqta wamā anta khāliquhu ilā yawmil qiyāmah.",
        "translate": "O Allah, bless Sayyidina Muhammad and his family to the extent of celestial space, and in quantity as great as the stars in the sky, with a blessing equal in weight to the heavens and the earth, and in quantity as great as what You created and what You will create until the Day of Resurrection.",
        "isbookmarked": "false"
    },
    {
        "num": "43",
        "arabic_dua": "اللَّهُمَّ صَلِّ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلَى آلِ سَيِّدِنَا مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى سَيِّدِنَا إِبْرَاهِيمَ، وَبَارِكْ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلَى آلِ سَيِّدِنَا مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى سَيِّدِنَا إِبْرَاهِيمَ وَعَلَى آلِ سَيِّدِنَا إِبْرَاهِيمَ فِي العَالَمِينَ إِنَّكَ حَمِيدٌ مَجِيدٌ.",
        "transcript": "Allāhummaṣalli ʿalā sayyidinā Muḥammadin wa ʿalā āli sayyidinā Muḥammadin kamā ṣallayta ʿalā sayyidanā Ibrāhīma, wa bārik ʿalā sayyidinā Muḥammadin wa ʿalā āli sayyidinā Muḥammadin kamā bārakta ʿalā sayyidanā Ibrāhīma wa ʿalā āli sayyidinā Ibrāhīma fīl ʿālamīna inaka ḥamīdun majīd.",
        "translate": "O Allah, bless Sayyidina Muhammad and the family of Sayyidina Muhammad as You blessed Sayyidina Ibrahim. And sanctify Sayyidina Muhammad and the family of Sayyidina Muhammad as You sanctified Sayyidina Ibrahim and the family of Sayyidina Ibrahim, in the worlds. You are Praiseworthy, Glorious.",
        "isbookmarked": "false"
    },
    {
        "num": "44",
        "arabic_dua": "اللَّهُمَّ إنِّي أَسْأَلُكَ العَفْوَ وَالعَافِيَةَ فِي الدِّينِ وَالدُّنْيَا وَالآخِرَةِ (3).اللَّهُمَّ اسْتُرْنَا بِسِتْرِكَ الجَمِيلِ (3)",
        "transcript": "Allāhummainnī asʾalukal ʿafwa wal ʿāfīyata fīddīni wad dunyā wal ākhirah (3).Allāhummasturnā bisitrikal jamīl (3).",
        "translate": "O Allah, I ask you for pardon and welfare in the deen, in this world and in the hereafter. (3 times)O Allah, veil us from wrong actions with Your beautiful veil. (3 times)",
        "isbookmarked": "false"
    },
    {
        "num": "45",
        "arabic_dua": "اللَّهُمَّ إنِّي أَسْأَلُكَ بِحَقِّكَ العَظِيمِ، وَبِحَقِّ نُورِ وَجْهِكَ الكَرِيمِ، وَبِحَقِّ عَرْشِكَ العَظِيمِ، وَبِمَا حَمَلَ كُرْسِيُّكَ مِنْ عَظَمَتِكَ وَجَلَالِكَ وَجَمَالِكَ، وَبَهَائِكَ وَقُدْرَتِكَ وَسُلْطَانِكَ، وَبِحَقِّ أَسْمَائِكَ المَخْزُونَةِ المَكْنُونَةِ الَّتِي لَمْ يَطَّلِعْ عَلَيْهَا أَحَدٌ مِنْ خَلْقِكَ.",
        "transcript": "Allāhummainnī asʾaluka biḥaqqikal ʿaẓīmi, wa biḥaqqi nūri wajhikal karīmi, wa biḥaqqi ʿarshikal aẓīmi, wa bimā ḥamala kursiyyuka min ʿaẓamatika wa jalālika wa jamālika, wa bahāʾika wa qudratika wa sulṭānika, wa biḥaqqi asmāʾikal makhzūnatil maknūnatillatī lam yaṭṭaliʿ ʿalayhā aḥadun min khalqika.",
        "translate": "O Allah, I ask You by Your mighty truth, by the light of Your noble Face, by Your mighty Throne, by what carries Your Footstool of Your sublimity, majesty, beauty, radiance, power and might, and by the right of Your hidden, treasured Names of which none of Your creation has knowledge.",
        "isbookmarked": "false"
    },
    {
        "num": "46",
        "arabic_dua": "اللَّهُمَّ وَأَسْأَلُكَ بِالِاسْمِ الَّذِي وَضَعْتَهُ عَلَى اللَّيْلِ فَأَظْلَمَ، وَعَلَى النَّهَارِ فَاسْتَنَارَ، وَعَلَى السَّمَوَاتِ فَاسْتَقَلَّتْ، وَعَلَى الأَرْضِ فَاسْتَقَرَّتْ، وَعَلَى الجِبَالِ فَرَسَتْ، وَعَلَى البِحَارِ وَالأَوْدِيَةِ فَجَرَتْ، وَعَلَى العُيُونِ فَنَبَعَتْ، وَعَلَى السَّحَابِ فَأَمْطَرَتْ.وَأَسْأَلُكَ اللَّهُمَّ بِالأَسْمَاءِ المَكْتُوبَةِ فِي جَبْهَةِ سَيِّدِنَا إِسْرَافِيلَ عَلَيْهِ السَّلَامُ، وَبِالأَسْمَاءِ المَكْتُوبَةِ فِي جَبْهَةِ سَيِّدِنَا جِبْرِيلَ عَلَيْهِ السَّلَامُ، وَعَلَى المَلَائِكَةِ المُقَرَّبِينَ، وَأَسْأَلُكَ اللَّهُمَّ بِالأَسْمَاءِ المَكْتُوبَةِ حَوْلَ العَرْشِ، وَبِالأَسْمَاءِ المَكْتُوبَةِ حَوْلَ الكُرْسِي، وَأَسْأَلُكَ اللَّهُمَّ بِالِاسْمِ المَكْتُوبِ عَلَى وَرَقِ الزَّيْتُونِ، وَأَسْأَلُكَ اللَّهُمَّ بِالأَسْمَاءِ العِظَامِ الَّتِي سَمَّيْتَ بِهَا نَفْسَكَ، مَا عَلِمْتُ مِنْهَا، وَمَا لَمْ أَعْلَمْ.",
        "transcript": "Allāhummawa asʾaluka bismilladhi wa ḍaʿtahu ʿalāl layli faʾaẓlama, wa ʿalān nahāri fastanāra, wa ʿalās samāwāti fastaqallat, wa ʿalāl arḍi fastaqarrat, wa ʿalāl jibāli faʾarsat, wa ʿalāl biḥāri wal awdiyati fajarat, wa ʿalāl ʿuyūni fanabaʿat, wa ʿalās saḥābi faʾamṭarat, wa asʾalukAllāhummabil asmāʾil maktūbati fī jabhati sayyidinā Isrāfīla ʿalayhis salāmu, wa bil asmāʾil maktūbati fī jabhati sayyidanā Jibrīla ʿalayhis salamu, wa ʿalal malāʾikatil muqarrabīna, wa asʾalukAllāhummabil asmāʾil maktūbati ḥawlal ʿarshi, wa asʾaluka bil asmāʾil maktūbati ḥawlal kursiyyi, wa asʾalukAllāhummabil ismil maktūbi ʿalā waraqiz zaytūni, wa asʾalukAllāhummabil asmāʾil ʿiẓāmallati sammayta bihā nafsaka, mā ʿalimtu minhā wa mā lam aʾlam.",
        "translate": "O Allah, and I ask You by the name which You set over the night so that it darkens, and over the day so that it gives light, and over the heavens so that they are raised up, and over the earth so that it is established, and over the mountains so that they are firmly fixed, and over the seas and rivers so that they flow, and over the springs so that they gush forth, and over the clouds so that they give rain.O Allah, I ask You by the names written on the brow of Sayyidina Israfil, peace be upon him, and by the names written on the brow of Sayyidina Jibril, peace be upon him, and on the near angels.O Allah, I ask You by the names written around the Throne, and by the names written around the Footstool.O Allah, I ask You by the name written on the leaf of the olive.O Allah, I ask You by the mighty Names by which You named Yourself, of what I know of them and what I do not know.",
        "isbookmarked": "false"
    }
]
